{
  "video_id": "aTvMAL-IgyQ",
  "title": "AI’s Insane Energy Problem Just Got Solved… By Natural Gas",
  "channel": "Nanalyze",
  "published_at": "2025-12-05T16:00:01Z",
  "duration": "PT14M48S",
  "thumbnail": "https://i.ytimg.com/vi/aTvMAL-IgyQ/hqdefault.jpg",
  "fetched_at": "2026-01-16T12:20:53.834391",
  "transcript": [
    {
      "start": 0.16,
      "duration": 5.92,
      "text": "Investors have been going bananas over the nuclear \nenergy AI trade, but they may be missing out on"
    },
    {
      "start": 6.08,
      "duration": 5.36,
      "text": "something much bigger. While everyone's waiting \nfor the nuclear buildout, it's only 5 years away"
    },
    {
      "start": 11.44,
      "duration": 6.48,
      "text": "now, companies are turning to other sources of \nenergy. Elon Musk just built one of the largest"
    },
    {
      "start": 17.92,
      "duration": 7.2,
      "text": "and fastest built data centers ever, and he used \nnatural gas to power it. Many of today's largest"
    },
    {
      "start": 25.12,
      "duration": 5.84,
      "text": "data centers are using natural gas and experts \nthink it's only just beginning. Is natural gas"
    },
    {
      "start": 30.96,
      "duration": 5.6,
      "text": "getting ready to boom on the back of the AI trade? \nWe'll answer that question. And we'll also let you"
    },
    {
      "start": 36.56,
      "duration": 8.88,
      "text": "in on a little known stock that's working with \nMusk and X AI on their data center energy needs."
    },
    {
      "start": 47.92,
      "duration": 6.48,
      "text": "So this chart by Goldman Sachs shows just how much \nenergy is going to be needed for the massive data"
    },
    {
      "start": 54.4,
      "duration": 6.16,
      "text": "center buildouts that are happening. And famed \ntech investor Andreessen Horowitz just did a"
    },
    {
      "start": 60.56,
      "duration": 6.72,
      "text": "really interesting two-part series on everything \nyou need to know about the US natural gas industry"
    },
    {
      "start": 67.28,
      "duration": 5.68,
      "text": "that's powering AI. Now that's not hyperbole. \nThat's actually happening in front of the meter"
    },
    {
      "start": 72.96,
      "duration": 6.72,
      "text": "and behind the meter. So in front of the meter, \nthis would actually be utility scale generation."
    },
    {
      "start": 79.68,
      "duration": 5.44,
      "text": "So the power companies we're all familiar with, \ntheir transmission infrastructure etc. Then you"
    },
    {
      "start": 85.12,
      "duration": 5.36,
      "text": "have behind the meter, which is commercial and \nresidential energy storage. So if you look at"
    },
    {
      "start": 90.48,
      "duration": 5.12,
      "text": "the state of California, for example, behind the \nmeter, all those solar installations they have"
    },
    {
      "start": 95.6,
      "duration": 5.6,
      "text": "are said, by the California Energy Commission, \nto only have displaced around 10% of front of"
    },
    {
      "start": 101.2,
      "duration": 6.24,
      "text": "the meter electricity from utilities. So that's \nstill quite a small chunk even in a solar-rich"
    },
    {
      "start": 107.44,
      "duration": 5.2,
      "text": "state like California because most behind the \nmeter is actually solar. The largest chunk of"
    },
    {
      "start": 112.64,
      "duration": 4.96,
      "text": "front-of-the-meter is actually natural gas. Here \nyou can see where that's broken down. So this was"
    },
    {
      "start": 117.6,
      "duration": 6.88,
      "text": "from 2023, but the numbers are still largely the \nsame. These ratios you have fossil fuels, nuclear,"
    },
    {
      "start": 124.48,
      "duration": 7.12,
      "text": "and, of course, renewables. And look under there. \nFossil fuels. 43% of electricity generation in"
    },
    {
      "start": 131.6,
      "duration": 5.04,
      "text": "the United States comes from natural gas. By \nfar the largest source. Now, there's really"
    },
    {
      "start": 136.64,
      "duration": 6.56,
      "text": "two main reasons for this. First is, and I was \nagain surprised to find this out, the US is the"
    },
    {
      "start": 143.2,
      "duration": 7.04,
      "text": "largest producer of natural gas in the world. And \nthere's three US regions that produce more natural"
    },
    {
      "start": 150.24,
      "duration": 6.48,
      "text": "gas than most countries. You can see those spelt \nout here in this very nice diagram. Natural gas"
    },
    {
      "start": 156.72,
      "duration": 6.56,
      "text": "is actually one of the cheapest forms of energy. \nWhen it comes to generating electricity, we always"
    },
    {
      "start": 163.28,
      "duration": 5.36,
      "text": "point to Lazard's levelized cost of energy, which \ntakes into account things like subsidies. And you"
    },
    {
      "start": 168.64,
      "duration": 5.52,
      "text": "see the two cheapest here, what they refer to as \nconventional generation. You have gas-combined"
    },
    {
      "start": 174.16,
      "duration": 6.56,
      "text": "cycle and US nuclear. And gas-combined cycle \nis the cheapest form of energy. So then you"
    },
    {
      "start": 180.72,
      "duration": 5.92,
      "text": "would expect that to be the most economical. Now, \nof course, there's a sensitivity there to fuel"
    },
    {
      "start": 186.64,
      "duration": 6.56,
      "text": "prices, natural gas. And this great chart again \nby Lazard shows that sensitivity, and it's not"
    },
    {
      "start": 193.2,
      "duration": 4.64,
      "text": "that meaningful, but it's certainly something \nthat's worth considering when you look at the"
    },
    {
      "start": 197.84,
      "duration": 5.68,
      "text": "price of natural gas over time. This great chart \nsimply plots that out over the past 10 years."
    },
    {
      "start": 203.52,
      "duration": 5.76,
      "text": "The big spike that you see there in 2022, that's \nprimarily due to the supply shock from Russia,"
    },
    {
      "start": 209.28,
      "duration": 5.76,
      "text": "the second largest producer of natural gas when \nthey invaded Ukraine. That was the impact on"
    },
    {
      "start": 215.04,
      "duration": 4.24,
      "text": "the price of natural gas. And you can see it's \nmaking new highs, and we're going to talk about,"
    },
    {
      "start": 219.28,
      "duration": 6.0,
      "text": "perhaps, why that is. Now, this piece that was \ncommissioned by Andreessen and written by this"
    },
    {
      "start": 225.28,
      "duration": 5.44,
      "text": "gentleman here who, I suppose, has given his job \nsome sort of a vested interest in natural gas. So,"
    },
    {
      "start": 230.72,
      "duration": 4.88,
      "text": "you need to take what he says with a grain \nof salt, but it's a very informative piece."
    },
    {
      "start": 235.6,
      "duration": 7.6,
      "text": "And it talks about how solar is not going to be \nthe most effective tool to solve the AI energy"
    },
    {
      "start": 243.2,
      "duration": 6.16,
      "text": "crisis as much as Musk would like it to be. Down \nthe road perhaps, but right now it isn't. And"
    },
    {
      "start": 249.36,
      "duration": 6.08,
      "text": "he's saying that we need to start building out \nmore natural gas energy production right now or"
    },
    {
      "start": 255.44,
      "duration": 4.96,
      "text": "we're going to end up doing that down the road \nanyway. This great chart, you see the yellow,"
    },
    {
      "start": 260.4,
      "duration": 6.16,
      "text": "this is the daily power-generation stack and it \nshows when power becomes available. And of course,"
    },
    {
      "start": 266.56,
      "duration": 5.68,
      "text": "solar power is only available when the sun shines. \nSo then you need all this expensive infrastructure"
    },
    {
      "start": 272.24,
      "duration": 6.24,
      "text": "to store the energy and to transmit it when the \nsun isn't shining. That increases the cost of"
    },
    {
      "start": 278.48,
      "duration": 4.64,
      "text": "solar significantly. Along the bottom there, \nyou see nuclear. That always stays the same,"
    },
    {
      "start": 283.12,
      "duration": 5.6,
      "text": "right? And then you have red there which is \nnatural gas which of course has to respond"
    },
    {
      "start": 288.72,
      "duration": 5.12,
      "text": "to a certain extent to the availability of \nelectricity from other intermittent sources"
    },
    {
      "start": 293.84,
      "duration": 5.6,
      "text": "such as solar. And when we look at where the \nlargest data centers are being powered from,"
    },
    {
      "start": 299.44,
      "duration": 5.84,
      "text": "the sources of energy, it's natural gas. Here \nyou can see again a great chart by Andreessen"
    },
    {
      "start": 305.28,
      "duration": 5.84,
      "text": "showing data centers in various countries and the \nmethods of electricity generation they're using,"
    },
    {
      "start": 311.12,
      "duration": 6.16,
      "text": "the largest there, using gas. Now, going to the \ngrid isn't the answer for immediate expansion for"
    },
    {
      "start": 317.28,
      "duration": 3.68,
      "text": "obvious reasons, right? Everybody's complaining \nabout their electricity prices going up because"
    },
    {
      "start": 320.96,
      "duration": 4.64,
      "text": "all the data centers are moving into the \nneighborhood. Behind the meter is the answer. So,"
    },
    {
      "start": 325.6,
      "duration": 4.48,
      "text": "that's really generating your own electricity \nthat doesn't come from the grid, and it doesn't"
    },
    {
      "start": 330.08,
      "duration": 5.12,
      "text": "impact anybody, except, perhaps, the environment. \nThat's certainly something to consider. And lots"
    },
    {
      "start": 335.2,
      "duration": 7.68,
      "text": "of new data centers being built are running off of \nbehind-the-meter natural gas with plans to replace"
    },
    {
      "start": 342.88,
      "duration": 7.36,
      "text": "these sources later. So behind-the-meter could be \nanything, from on-site gas turbines to fuel cells."
    },
    {
      "start": 350.24,
      "duration": 4.72,
      "text": "And this report by Goldman says that behind the \nmeter systems are expected to provide a quarter"
    },
    {
      "start": 354.96,
      "duration": 6.0,
      "text": "to a third of the incremental electricity demand \nfrom data centers that's anticipated through 2030,"
    },
    {
      "start": 360.96,
      "duration": 5.52,
      "text": "the chart we looked at earlier. That's a pretty \nsignificant amount. When we look at Colossus,"
    },
    {
      "start": 366.48,
      "duration": 6.16,
      "text": "so this is the massive data center that X AI \nbuilt. Musk driving this. They told him it"
    },
    {
      "start": 372.64,
      "duration": 7.76,
      "text": "would take 730 days. They built this data center \nin 122 days. That's simply remarkable. When we"
    },
    {
      "start": 380.4,
      "duration": 5.76,
      "text": "look at where Musk's turbines come from, there's \na company called Solaris trading under the ticker"
    },
    {
      "start": 386.16,
      "duration": 8.24,
      "text": "SEI. And they have a past that isn't so bright. \nSo they were valued at around $1.65 billion and"
    },
    {
      "start": 394.4,
      "duration": 5.04,
      "text": "they suffered five straight quarters of falling \nrevenues in their legacy oil field services."
    },
    {
      "start": 399.44,
      "duration": 6.72,
      "text": "That's before they pivoted and acquired a company \ncalled Mobile Energy Rentals, and they rebranded"
    },
    {
      "start": 406.16,
      "duration": 7.2,
      "text": "this as Solaris Power Solutions, shifting their \nfocus to gas-powered turbine leasing for data"
    },
    {
      "start": 413.36,
      "duration": 8.0,
      "text": "centers. All right. When you start to break down \nSolaris, you see that 96% of last year's revenue"
    },
    {
      "start": 421.36,
      "duration": 5.76,
      "text": "for that energy generation unit came from leasing \nrevenue from xAI. So, I mean, do you really want"
    },
    {
      "start": 427.12,
      "duration": 5.12,
      "text": "to be sitting across the table from Musk having \nnegotiations? No. You're not in a very good"
    },
    {
      "start": 432.24,
      "duration": 4.32,
      "text": "position. He's going to be able to strongarm you \nall over the place, and he certainly will. And"
    },
    {
      "start": 436.56,
      "duration": 6.48,
      "text": "Bloomberg correctly titles this article, Solaris \nties its future to xAI's success in the AI boom."
    },
    {
      "start": 443.04,
      "duration": 5.76,
      "text": "refers to this 7-year agreement that they have, \nthough Musk could connect to the grid sooner than"
    },
    {
      "start": 448.8,
      "duration": 5.2,
      "text": "that. Presumably, he will. And what happens to \nthis company that's hedged their entire success"
    },
    {
      "start": 454.0,
      "duration": 6.48,
      "text": "right now in xAI? xAI is leasing, and when you \ndo that, you really don't have to worry a lot"
    },
    {
      "start": 460.48,
      "duration": 4.0,
      "text": "about risk. So, we don't know what the terms \nof those leases look like, but when you look on"
    },
    {
      "start": 464.48,
      "duration": 6.08,
      "text": "the back end, Solaris is sourcing these units \nfrom either purchasing them, subleasing them,"
    },
    {
      "start": 470.56,
      "duration": 7.12,
      "text": "or even refurbishments. So this really isn't an \nideal solution. It seems to be what Musk could"
    },
    {
      "start": 477.68,
      "duration": 5.12,
      "text": "cobble together quickest to get that data \ncenter up and running. So it doesn't bode"
    },
    {
      "start": 482.8,
      "duration": 6.8,
      "text": "well necessarily for Solaris. And if Musk plugs \ninto the grid and gets his solar farms online,"
    },
    {
      "start": 489.6,
      "duration": 5.36,
      "text": "then it really makes these turbines obsolete. \nMaybe they move to the next Colossus data center"
    },
    {
      "start": 494.96,
      "duration": 5.84,
      "text": "that's being built and they're just a temporary \nsolution whilst Musk works as fast as he can to"
    },
    {
      "start": 500.8,
      "duration": 6.16,
      "text": "deploy data centers. For anybody that finds that \nstory compelling enough to invest in, Hindenburg"
    },
    {
      "start": 506.96,
      "duration": 5.76,
      "text": "linked Morpheus targeted Solaris in their first \nshort report. Here's how that works. If you're an"
    },
    {
      "start": 512.72,
      "duration": 4.88,
      "text": "investor in any company, you should be stoked when \na firm issues a short report because they've gone"
    },
    {
      "start": 517.6,
      "duration": 5.04,
      "text": "out there and found every single red flag, every \nsingle reason not to invest in a company. They've"
    },
    {
      "start": 522.64,
      "duration": 4.16,
      "text": "done that for you. And then you can vet that and \ndecide if you still want to make an investment."
    },
    {
      "start": 526.8,
      "duration": 4.4,
      "text": "Don't be a Dgen and just pull an ostrich and put \nyour head in the sand. You read the report. You"
    },
    {
      "start": 531.2,
      "duration": 5.76,
      "text": "see what takeaways are and you say, \"Yeah, I think \nwe'll stay invested.\" So, we see natural gas being"
    },
    {
      "start": 536.96,
      "duration": 7.12,
      "text": "used by data centers. And when you look at the \nStargate AI data center being built by OpenAI,"
    },
    {
      "start": 544.08,
      "duration": 4.88,
      "text": "it's going to be the world's largest AI \nsupercluster once it's fully built. And Sam Altman"
    },
    {
      "start": 548.96,
      "duration": 5.84,
      "text": "made the remark here. He said, \"We're burning gas \nto run this data center again.\" And he says, \"But"
    },
    {
      "start": 554.8,
      "duration": 6.08,
      "text": "the hope is to rely on many other power sources.\" \nOf course, we know Altman's connection with Oklo"
    },
    {
      "start": 560.88,
      "duration": 5.84,
      "text": "Nuclear coming down the road. We did a piece on \nthat, looking at how it may not be the panacea to"
    },
    {
      "start": 566.72,
      "duration": 5.44,
      "text": "the AI energy woes, right? It's going to take \na long time to build out, and some of these"
    },
    {
      "start": 572.16,
      "duration": 5.12,
      "text": "concepts are not proven at all. The SMR modular \nconcepts, there's a lot of them out there, and for"
    },
    {
      "start": 577.28,
      "duration": 4.96,
      "text": "investors, you really need to watch that piece. If \nyou think that nuclear energy is the way forward"
    },
    {
      "start": 582.24,
      "duration": 6.32,
      "text": "and be aware of the risks that are inherent to \nthat thesis. So why not build out these small"
    },
    {
      "start": 588.56,
      "duration": 6.48,
      "text": "gas turbines and just use these extensively across \nall data centers? The fuel is cheap, right? These"
    },
    {
      "start": 595.04,
      "duration": 5.6,
      "text": "modular systems must be cheaper. Well, they're not \nreally. So they actually have a much higher cost"
    },
    {
      "start": 600.64,
      "duration": 7.2,
      "text": "than that of the large combined-cycle natural gas \nturbines. But here's an interesting comment. Their"
    },
    {
      "start": 607.84,
      "duration": 6.08,
      "text": "modular nature makes them cost-competitive because \nwhat you can do is this. You have to have a 100%"
    },
    {
      "start": 613.92,
      "duration": 5.68,
      "text": "uptime, right? So if you have a 500 megawatt \npower plant and that goes down, you have to have"
    },
    {
      "start": 619.6,
      "duration": 6.88,
      "text": "another 500 megawatt power plant as a backup. \nWell, if you have five 100 megawatt turbines,"
    },
    {
      "start": 626.48,
      "duration": 5.12,
      "text": "these smaller installations, you only, perhaps, \nneed to have two as backups because you're only"
    },
    {
      "start": 631.6,
      "duration": 5.36,
      "text": "ever going to have one go out at a time, or \nperhaps two. So they're saying here that that"
    },
    {
      "start": 636.96,
      "duration": 6.16,
      "text": "actually makes them a lot more cost-competitive. \nAnd they go on to talk about how these solid"
    },
    {
      "start": 643.12,
      "duration": 5.44,
      "text": "oxide fuel cells, such as those produced by Bloom \nEnergy, have higher upfront and maintenance costs"
    },
    {
      "start": 648.56,
      "duration": 5.28,
      "text": "but are far more fuel efficient, as we talked \nabout, 10 to 30%. Of course, that advantage"
    },
    {
      "start": 653.84,
      "duration": 6.4,
      "text": "erodes as the price of natural gas falls. But \nthe other advantage there is when you look at"
    },
    {
      "start": 660.24,
      "duration": 5.52,
      "text": "some of these lawsuits being leveled at Musk, \nthat they're talking about environmental impact,"
    },
    {
      "start": 665.76,
      "duration": 5.6,
      "text": "and it's a lot easier, they say, for these \nfuel cell installations to get permits than"
    },
    {
      "start": 671.36,
      "duration": 6.64,
      "text": "it is for dirty gas turbines. Right? So investment \nangles, aside from Solaris that we talked about,"
    },
    {
      "start": 678.0,
      "duration": 4.4,
      "text": "which wouldn't be appealing from where we're \nsitting, for reasons that we gave, investing"
    },
    {
      "start": 682.4,
      "duration": 6.64,
      "text": "in spot natural gas commodity investment. You see \nthis a lot. It's really speculative because it's"
    },
    {
      "start": 689.04,
      "duration": 5.6,
      "text": "quite cyclical, right? It's really a speculative \nthesis than it is saying, well, gas is going to"
    },
    {
      "start": 694.64,
      "duration": 5.28,
      "text": "go up perpetually because of the demand. No, it's \nnot how it works, right? And for those of you that"
    },
    {
      "start": 699.92,
      "duration": 5.28,
      "text": "are looking for ETFs, you may come across this \nUnited States Natural Gas Fund under the ticker"
    },
    {
      "start": 705.2,
      "duration": 6.56,
      "text": "UNG. This is not a good investment. Probe around \na little bit there. Says nothing to do with giving"
    },
    {
      "start": 711.76,
      "duration": 4.48,
      "text": "you exposure to the price of natural gas. It's \nabout speculating on intra-day movements. You"
    },
    {
      "start": 716.24,
      "duration": 5.68,
      "text": "go look at the 10-year return is something like \na loss of 99%. You can read the definitions as"
    },
    {
      "start": 721.92,
      "duration": 5.04,
      "text": "to how this vehicle works. Really, investing in \nspot natural gas is the least desirable way to"
    },
    {
      "start": 726.96,
      "duration": 6.08,
      "text": "get exposure to this thesis. You have natural \ngas producers and pipeline infrastructure. So,"
    },
    {
      "start": 733.04,
      "duration": 7.36,
      "text": "you then end up investing in a lot more than just \nthe growth of data centers. This LNG thesis also"
    },
    {
      "start": 740.4,
      "duration": 6.16,
      "text": "comes into play. And you can read these pieces by \nAndreessen. They're rather verbose, but they sort"
    },
    {
      "start": 746.56,
      "duration": 5.92,
      "text": "of tie that in. The argument being that, well, LNG \nactually needs to pull back so that data centers"
    },
    {
      "start": 752.48,
      "duration": 6.56,
      "text": "can use all this natural gas instead of selling \nit. Then you have the manufacturers of turbines."
    },
    {
      "start": 759.04,
      "duration": 6.16,
      "text": "So when it comes to the larger-scale units, \nthe type of turbines being used by these large"
    },
    {
      "start": 765.2,
      "duration": 6.0,
      "text": "combined-gas cycle plants, we did a piece that \nlooked at Caterpillar in that context. Commons."
    },
    {
      "start": 771.2,
      "duration": 4.24,
      "text": "There's other firms out there building them. \nThey talk about a seven-to-eight-year backlog."
    },
    {
      "start": 775.44,
      "duration": 6.16,
      "text": "But they're also quite wary, in terms of ramping \nthat up, because they know, and this comment here,"
    },
    {
      "start": 781.6,
      "duration": 6.32,
      "text": "from that earlier article, bulls may view this as \nan opportunity, but the restraint shown by larger"
    },
    {
      "start": 787.92,
      "duration": 5.28,
      "text": "manufacturers serves as a reminder to investors \nthat heated markets do not always last. So,"
    },
    {
      "start": 793.2,
      "duration": 5.92,
      "text": "they're very wary of any sort of buildout. And \nthen when you look at any company, be aware of"
    },
    {
      "start": 799.12,
      "duration": 4.48,
      "text": "the actual exposure you're getting. Again, going \nback to that piece we did on Caterpillar, looking"
    },
    {
      "start": 803.6,
      "duration": 5.52,
      "text": "at how you get very little exposure to that thesis \nby investing the stock. So, just some thoughts"
    },
    {
      "start": 809.12,
      "duration": 5.92,
      "text": "here. Seems like front-of-meter expansion, so \nthese combined gas cycle plants, they're going"
    },
    {
      "start": 815.04,
      "duration": 5.84,
      "text": "to take a long time to ramp up because of the \nturbine backlog. Back-of-the-meter solutions can"
    },
    {
      "start": 820.88,
      "duration": 4.56,
      "text": "certainly provide some temporary capabilities \nwhile solar gets built out. That appears to be"
    },
    {
      "start": 825.44,
      "duration": 5.92,
      "text": "what Musk is doing, right? And then when nuclear \nenergy comes online, later on down the road,"
    },
    {
      "start": 831.36,
      "duration": 4.0,
      "text": "right, it's very expensive. And when you look at \nhow much it's moving the needle, it really is not"
    },
    {
      "start": 835.36,
      "duration": 6.4,
      "text": "very much. But eventually, we're going to start to \ngravitate again towards what's economical. Going"
    },
    {
      "start": 841.76,
      "duration": 5.84,
      "text": "back to that chart that Lazard has, which shows \nthe most efficient forms of energy generation,"
    },
    {
      "start": 847.6,
      "duration": 6.08,
      "text": "always beware of booms that are temporary, right? \nAs long-term investors, we want a thesis that"
    },
    {
      "start": 853.68,
      "duration": 5.76,
      "text": "extends beyond just half a decade. Now, Bloom \nEnergy, a few premium subscribers have asked us"
    },
    {
      "start": 859.44,
      "duration": 5.28,
      "text": "about that. So, we're going to be covering their \nfuel cell deployments in a coming piece. We've"
    },
    {
      "start": 864.72,
      "duration": 4.72,
      "text": "certainly covered that firm for a very long \ntime. Haven't looked at them for a while. So,"
    },
    {
      "start": 869.44,
      "duration": 5.68,
      "text": "we'll definitely take a look at that next. And \nif you're interested in reading more about what"
    },
    {
      "start": 875.12,
      "duration": 6.24,
      "text": "the state of nuclear energy is all about, we did \nthis recent piece, quite popular, which looks at"
    },
    {
      "start": 881.36,
      "duration": 5.04,
      "text": "just that. Give that a watch next. Thanks so much \nfor taking the time to watch this video today."
    }
  ]
}