{
  "video_id": "cg-IxAHO-w4",
  "title": "The “Next NVDA” Nobody is Talking About",
  "channel": "Nanalyze",
  "published_at": "2025-12-19T16:01:11Z",
  "duration": "PT12M1S",
  "thumbnail": "https://i.ytimg.com/vi/cg-IxAHO-w4/hqdefault.jpg",
  "fetched_at": "2026-01-16T12:18:18.057306",
  "transcript": [
    {
      "start": 0.16,
      "duration": 5.28,
      "text": "AI hype is making it really tough for retail \ninvestors. All the fintwats screaming about"
    },
    {
      "start": 5.44,
      "duration": 5.84,
      "text": "this and that. There's too much noise, too many \nstories about promises in the future. But one"
    },
    {
      "start": 11.28,
      "duration": 6.32,
      "text": "thing is for sure - AI is happening today. \nSo when a company starts to show extremely"
    },
    {
      "start": 17.6,
      "duration": 10.0,
      "text": "strong revenue growth, and they say that's \nbecause of AI, it's worth a closer look."
    },
    {
      "start": 27.6,
      "duration": 6.96,
      "text": "Now, today's story starts in the Nanalyze Discord \nserver where one of our extremely intelligent and"
    },
    {
      "start": 34.56,
      "duration": 6.88,
      "text": "good-looking paying subscribers pointed us towards \na stock called Credo. Now, this was nearly 3 years"
    },
    {
      "start": 41.44,
      "duration": 7.12,
      "text": "ago when this individual pointed us to five stocks \nthat they thought would benefit from AI. And when"
    },
    {
      "start": 48.56,
      "duration": 5.6,
      "text": "they followed up on those names, coincidentally, \nwe happened to be publishing a piece on finding"
    },
    {
      "start": 54.16,
      "duration": 5.84,
      "text": "the next great semiconductor stock. And \nCredo was featured in that piece with some"
    },
    {
      "start": 60.0,
      "duration": 7.28,
      "text": "comments around their lack of investor relations \ncollateral, strong revenue growth into China,"
    },
    {
      "start": 67.28,
      "duration": 5.28,
      "text": "and a number of other things that we noted. \nBut from around the beginning of 2023, when"
    },
    {
      "start": 72.56,
      "duration": 6.0,
      "text": "this individual followed up on these names until \nnow, how did these names perform? And it's very"
    },
    {
      "start": 78.56,
      "duration": 9.12,
      "text": "interesting. And Credo actually returned over a \n1,000%. Indie Semi lost 30%. Aehr only gained 7%,"
    },
    {
      "start": 87.68,
      "duration": 9.36,
      "text": "and you had SiTime up 245%, Valens Semi, not doing \nso well, down 67. What it all comes down to is an"
    },
    {
      "start": 97.04,
      "duration": 7.36,
      "text": "appropriate benchmark. So just simply investing in \nthe NASDAQ would have returned 128% over the past"
    },
    {
      "start": 104.4,
      "duration": 7.04,
      "text": "3 years. So, if you had a portfolio of these five \nstocks, you would have beaten the NASDAQ. Now,"
    },
    {
      "start": 111.44,
      "duration": 6.64,
      "text": "I also listed NVIDIA here, which is also up a \n1,000%. And I did that because I want to show"
    },
    {
      "start": 118.08,
      "duration": 6.64,
      "text": "you a classic example of where growth isn't \nbeing hyped. Now, when you look at NVIDIA's"
    },
    {
      "start": 124.72,
      "duration": 5.04,
      "text": "revenue growth over the past three years, \nthis is insane. This chart looks like your"
    },
    {
      "start": 129.76,
      "duration": 5.12,
      "text": "typical disruptive tech company that's showing \ndouble-digit growth every year. So this looks"
    },
    {
      "start": 134.88,
      "duration": 4.8,
      "text": "like a typical annual chart. This is quarterly. \nAnd with the exception, that one quarter you see"
    },
    {
      "start": 139.68,
      "duration": 4.96,
      "text": "there, where they're only up 6%, they managed \ndouble-digit growth. And this last quarter,"
    },
    {
      "start": 144.64,
      "duration": 7.52,
      "text": "22% growth, off of an extremely high base. This \nis why it's the most highly valued company in the"
    },
    {
      "start": 152.16,
      "duration": 4.88,
      "text": "world. And that's also because they're printing \ncash. So not all revenues are created equal. When"
    },
    {
      "start": 157.04,
      "duration": 6.88,
      "text": "you look at NVIDIA's profitability, look at their \noperating margin. So sitting around 60%. This is"
    },
    {
      "start": 163.92,
      "duration": 4.88,
      "text": "what happens when you have economies of scale, \nwhat they call Operating Leverage, and they're"
    },
    {
      "start": 168.8,
      "duration": 7.04,
      "text": "basically printing money. And for being one of \nthe most exciting growth stories in tech ever,"
    },
    {
      "start": 175.84,
      "duration": 5.04,
      "text": "they're actually not that highly valued. And these \nare some great charts. So the chart at the top"
    },
    {
      "start": 180.88,
      "duration": 5.36,
      "text": "shows that rapid stock price appreciation over \nthe years, but look at how earnings per share,"
    },
    {
      "start": 186.24,
      "duration": 5.76,
      "text": "the second chart there, look how that has grown \nto match share price. So when you calculate"
    },
    {
      "start": 192.0,
      "duration": 5.44,
      "text": "price-to-earnings, this is very interesting, \nthe bottom chart there, see how that has had a"
    },
    {
      "start": 197.44,
      "duration": 5.68,
      "text": "relatively steady cadence with the exception of \none blip there. And it's actually sort of been"
    },
    {
      "start": 203.12,
      "duration": 7.2,
      "text": "declining over time. So it's pretty easy to argue \nNVIDIA, if you look at forward price-to-earnings,"
    },
    {
      "start": 210.32,
      "duration": 7.6,
      "text": "isn't really overvalued at all. So the takeaway \nhere is that a company can justify a 1,000% stock"
    },
    {
      "start": 217.92,
      "duration": 7.36,
      "text": "price appreciation if fundamentals show good \nreason for it. And steady valuation ratios show"
    },
    {
      "start": 225.28,
      "duration": 6.8,
      "text": "you that fundamentals are keeping up with share \nprice. So if Credo is, let's say, the next NVIDIA,"
    },
    {
      "start": 232.08,
      "duration": 4.64,
      "text": "then what do we want to see? We want to see \nfundamentals absolutely soaring. We want to"
    },
    {
      "start": 236.72,
      "duration": 6.8,
      "text": "see profitability to match, and we want to see the \nvaluation maintaining itself over time. So when we"
    },
    {
      "start": 243.52,
      "duration": 5.76,
      "text": "look at Credo's revenue growth, this is a very \ninteresting chart. So over the past 3 years, two"
    },
    {
      "start": 249.28,
      "duration": 5.44,
      "text": "of those three years you would have spent waiting. \nAnd then here you can see, really, their NVIDIA"
    },
    {
      "start": 254.72,
      "duration": 4.96,
      "text": "moment, and you just know that management during \nthat earnings call was saying just that. This is"
    },
    {
      "start": 259.68,
      "duration": 5.04,
      "text": "our big moment, our breakout. This is when all our \nexplosive growth is going to happen. And indeed"
    },
    {
      "start": 264.72,
      "duration": 4.56,
      "text": "that's what's happened here. You can see the \nfollowing quarters and that black bar represents"
    },
    {
      "start": 269.28,
      "duration": 6.8,
      "text": "their expectations for next quarter. And if you \nhad invested in Credo around that NVIDIA moment,"
    },
    {
      "start": 276.08,
      "duration": 7.44,
      "text": "then you would be up significantly over NVIDIA \nitself and our benchmark QQQ. So to have held"
    },
    {
      "start": 283.52,
      "duration": 7.44,
      "text": "Credo for that long to realize that 1,000% gain \nwould have taken a lot of conviction. Right? So"
    },
    {
      "start": 290.96,
      "duration": 5.68,
      "text": "when we look at profitability for Credo, we see \nsome gross margins that are steadily increasing"
    },
    {
      "start": 296.64,
      "duration": 5.36,
      "text": "over time. You see here reaching the 65% mark. \nThat's pretty strong. That's great for a hardware"
    },
    {
      "start": 302.0,
      "duration": 6.32,
      "text": "solution. Then we see here, Net Margin. So if \nit was positive for a sufficient amount of time,"
    },
    {
      "start": 308.32,
      "duration": 4.32,
      "text": "then we could calculate price-to-earnings for \nthis company. But we can't because they've only"
    },
    {
      "start": 312.64,
      "duration": 6.24,
      "text": "recently seen that become positive. So, we have a \ntough time using price-to-earnings ratios to value"
    },
    {
      "start": 318.88,
      "duration": 5.28,
      "text": "this growth stock. What we've come up with is a \nsimple valuation ratio, which- it's pretty much"
    },
    {
      "start": 324.16,
      "duration": 6.88,
      "text": "the same thing as a price-to-sales ratio, but we \ndon't use the last trailing 12 months. We use the"
    },
    {
      "start": 331.04,
      "duration": 4.72,
      "text": "last quarter so that it's more responsive. And let \nme give you a classic example of where this works"
    },
    {
      "start": 335.76,
      "duration": 6.8,
      "text": "quite well. So, if we looked at the price-to-sales \nfor Credo, we use the last trailing 12 months of"
    },
    {
      "start": 342.56,
      "duration": 6.8,
      "text": "revenues. We divide their market cap, $26 billion \nby $800 million roughly. We get a price-to-sales"
    },
    {
      "start": 349.36,
      "duration": 8.64,
      "text": "of 32.5. But if we used last quarter, annualized, \nit actually brings it down to 24. So you're"
    },
    {
      "start": 358.0,
      "duration": 6.08,
      "text": "dividing 26 by over a billion. The reason that we \ndo that is so that it's more responsive. But then,"
    },
    {
      "start": 364.08,
      "duration": 6.88,
      "text": "if we use next quarter, annualized, we use that \nmidpoint of their guidance, brings it down to 19."
    },
    {
      "start": 370.96,
      "duration": 5.6,
      "text": "So, the takeaways here are that simple valuation \nratio is a lot more responsive and allows us to"
    },
    {
      "start": 376.56,
      "duration": 6.48,
      "text": "value things at more of a discount when growth \nis appreciating quite rapidly, which is good."
    },
    {
      "start": 383.04,
      "duration": 6.4,
      "text": "And the other point here that's quite important \nis that valuation changes very quickly when the"
    },
    {
      "start": 389.44,
      "duration": 4.88,
      "text": "fundamentals are changing as well. So as we looked \nat in the case of NVIDIA, you can have a company"
    },
    {
      "start": 394.32,
      "duration": 6.0,
      "text": "that can increase by a 1,000% without having \ntheir valuation change in 3 years. That's really,"
    },
    {
      "start": 400.32,
      "duration": 5.76,
      "text": "really crazy, right? And when you look at the \nforecasts for Credo, so JP Morgan happens to"
    },
    {
      "start": 406.08,
      "duration": 6.24,
      "text": "be quite bullish on Credo. They're forecasting \nthis compound annual growth rate for the next"
    },
    {
      "start": 412.32,
      "duration": 6.0,
      "text": "3 years for Credo of 50%, they're expecting 100% \ngrowth this year. Where's all this growth coming"
    },
    {
      "start": 418.32,
      "duration": 6.4,
      "text": "from? What does Credo even do? Aha. So now we can \nstart getting into information about this company,"
    },
    {
      "start": 424.72,
      "duration": 5.52,
      "text": "which is tough to come by because we weren't \nable to actually find any investor decks. It's"
    },
    {
      "start": 430.24,
      "duration": 5.6,
      "text": "all just earnings releases and 10-Q's and 10-Ks. \nBut they actually have a presentation floating"
    },
    {
      "start": 435.84,
      "duration": 6.48,
      "text": "around out there from back when they had their \nIPO in 2022. And you see here this very simple"
    },
    {
      "start": 442.32,
      "duration": 6.56,
      "text": "statement enabling every connection in the data \ncenter. So the acronym of today is AEC - Active"
    },
    {
      "start": 448.88,
      "duration": 5.76,
      "text": "Electric Cable. These are their key products that \nare driving a lot of their growth right now. So"
    },
    {
      "start": 454.64,
      "duration": 5.68,
      "text": "you can see these cables connecting these servers, \nright? Connecting servers to switches and such."
    },
    {
      "start": 460.32,
      "duration": 5.12,
      "text": "But here you can see the basic metrics, right? \nTotal bandwidth increases significantly whilst"
    },
    {
      "start": 465.44,
      "duration": 5.52,
      "text": "the power needed halves. So it's all about more \nefficient data centers, right? Because we don't"
    },
    {
      "start": 470.96,
      "duration": 6.48,
      "text": "have much power. So these products are selling \nlike hotcakes. Now these Active Electric Cables,"
    },
    {
      "start": 477.44,
      "duration": 5.44,
      "text": "these are their fastest-growing segment right \nnow in the company. So driving all that growth,"
    },
    {
      "start": 482.88,
      "duration": 5.28,
      "text": "they're preferred over traditional copper or \noptical cables for AI racks cause they're thinner,"
    },
    {
      "start": 488.16,
      "duration": 6.32,
      "text": "use less power, and support the extreme bandwidth \nrequired for GPU to switch connections. And here's"
    },
    {
      "start": 494.48,
      "duration": 6.72,
      "text": "a risk factor. Last quarter, four hyperscalers \naccounted for 93% of the revenues. Oh,"
    },
    {
      "start": 501.2,
      "duration": 4.56,
      "text": "and they have a fifth coming on. So they talk \nabout reducing customer concentration risk. Well,"
    },
    {
      "start": 505.76,
      "duration": 4.72,
      "text": "they likely won't, right? These hyperscalers \nwill continue to dominate. So everybody's kind"
    },
    {
      "start": 510.48,
      "duration": 4.0,
      "text": "of watching these hyperscalers. And the first \none that pulls back is going to be the canary"
    },
    {
      "start": 514.48,
      "duration": 3.28,
      "text": "in the coal mine. You're going to see C-Level \nfolks saying, \"Wait a minute here. Let's pull"
    },
    {
      "start": 517.76,
      "duration": 4.56,
      "text": "back. We- we don't really want to commit this \nspending, right?\" So this customer concentration"
    },
    {
      "start": 522.32,
      "duration": 5.84,
      "text": "risk is a problem, but it's also something \nthat you just have to accept as all the big"
    },
    {
      "start": 528.16,
      "duration": 6.32,
      "text": "spenders driving this AI boom are a small set of \ncompanies, what they refer to as the hyperscalers,"
    },
    {
      "start": 534.48,
      "duration": 8.4,
      "text": "right? So the real advantage here for Credo is \nthat they claim 80% market share leadership. So,"
    },
    {
      "start": 542.88,
      "duration": 6.24,
      "text": "this was from JP Morgan's analysts who thoroughly \nvetted the competition and Credto's competing"
    },
    {
      "start": 549.12,
      "duration": 6.48,
      "text": "against some real big players with deep pockets \nlike Broadcom, right? So, they're often seen as"
    },
    {
      "start": 555.6,
      "duration": 5.84,
      "text": "a giant competitor with Credo gaining share in \nsome niche high-efficiency areas. And then you"
    },
    {
      "start": 561.44,
      "duration": 7.84,
      "text": "have Astera Labs. So, Astera, being a pure-play \nAI data center connectivity play. So they say"
    },
    {
      "start": 569.28,
      "duration": 6.64,
      "text": "this is the closest pure-play peer. Both are \nhigh-growth AI interconnect stocks. And when"
    },
    {
      "start": 575.92,
      "duration": 5.84,
      "text": "you look at this chart here from JP Morgan, \nthey talk about beneficiaries of an AI-driven"
    },
    {
      "start": 581.76,
      "duration": 5.36,
      "text": "investment cycle thinking beyond the mega cap. \nThis is a great presentation. It's a great picture"
    },
    {
      "start": 587.12,
      "duration": 6.24,
      "text": "of how professionals manage portfolios. And they \npoint to a number of names here of interest. Credo"
    },
    {
      "start": 593.36,
      "duration": 5.12,
      "text": "being one of them. I think that's in their top \n10 overweight positions. They have a very large"
    },
    {
      "start": 598.48,
      "duration": 4.88,
      "text": "portfolio where they've overweighted some names, \nsuch as Credo, and some of the other names you"
    },
    {
      "start": 603.36,
      "duration": 7.28,
      "text": "see listed here today. So, some takeaways. Credo's \nbenefiting from a first-mover status in AEC's amid"
    },
    {
      "start": 610.64,
      "duration": 7.04,
      "text": "this AIinvestment boom, though larger rivals like \nBroadcom pose long-term threats with their scale"
    },
    {
      "start": 617.68,
      "duration": 7.04,
      "text": "and diversified offerings. So, is Credo the \nnext NVIDIA? Well, their success is certainly"
    },
    {
      "start": 624.72,
      "duration": 5.12,
      "text": "correlated to the growth of data centers. So your \nexposure from that perspective is really going"
    },
    {
      "start": 629.84,
      "duration": 6.16,
      "text": "to overlap with NVIDIA. Will Credo see stronger \ngrowth than NVIDIA, going forward? Well, likely"
    },
    {
      "start": 636.0,
      "duration": 5.6,
      "text": "coming off of a lower base, they might. Will it \never be as profitable? They're certainly doing a"
    },
    {
      "start": 641.6,
      "duration": 7.36,
      "text": "lot better. And as time goes on, JPM analysts see \nthe earnings per share significantly outpacing the"
    },
    {
      "start": 648.96,
      "duration": 6.4,
      "text": "growth of revenues. So people always want us to \nend with some decision. Credo's a buy, or Credo's"
    },
    {
      "start": 655.36,
      "duration": 4.48,
      "text": "a sell, or they want us to pull some price target \nout of our assets like everyone else does. None"
    },
    {
      "start": 659.84,
      "duration": 5.6,
      "text": "of that's going to make you a better investor. You \nneed to decide what to do here. Take the insights"
    },
    {
      "start": 665.44,
      "duration": 5.12,
      "text": "that we've provided you with today and use them \nto make better investment decisions. Our plan"
    },
    {
      "start": 670.56,
      "duration": 5.52,
      "text": "is going to be to continue to get data center \nhardware exposure from our largest position,"
    },
    {
      "start": 676.08,
      "duration": 5.84,
      "text": "which is NVIDIA. They're the undisputed leader \nin a critical data center component, perhaps the"
    },
    {
      "start": 681.92,
      "duration": 5.84,
      "text": "most important, right? And when you look at this \nchart here by JP Morgan, rather interesting. Look"
    },
    {
      "start": 687.76,
      "duration": 6.48,
      "text": "at this growth in data center revenue. They're \nexpecting from last year to 2027 for that to"
    },
    {
      "start": 694.24,
      "duration": 4.72,
      "text": "double. So that's pretty aggressive, right? Let's \nhope it happens. We'd love it if that happens,"
    },
    {
      "start": 698.96,
      "duration": 4.72,
      "text": "right? But we've talked a lot about valuation \ntoday, and I wanted to leave you with a video that"
    },
    {
      "start": 703.68,
      "duration": 5.92,
      "text": "we did on valuing NVIDIA. A lot of the concepts \nand ideas, and insights in this piece are still"
    },
    {
      "start": 709.6,
      "duration": 5.28,
      "text": "very relevant today. If you're somebody interested \nin the valuation component, then you want to give"
    },
    {
      "start": 714.88,
      "duration": 4.64,
      "text": "this video a watch next. Thanks so much for \ntaking the time to watch this video today."
    }
  ]
}