{
  "video_id": "El8-58mKnVs",
  "title": "Experts Say THIS is the Best Robo Advisor!",
  "channel": "Nanalyze",
  "published_at": "2025-12-08T16:00:24Z",
  "duration": "PT12M34S",
  "thumbnail": "https://i.ytimg.com/vi/El8-58mKnVs/hqdefault.jpg",
  "fetched_at": "2026-01-16T12:20:18.071470",
  "transcript": [
    {
      "start": 0.16,
      "duration": 6.64,
      "text": "Robo-advisors like Betterment, Wealthfront, \nVanguard, and Schwab now manage over $2 trillion"
    },
    {
      "start": 6.8,
      "duration": 4.08,
      "text": "in assets. Maybe you're using one of these \nservices and you're wondering if it's worth paying"
    },
    {
      "start": 10.88,
      "duration": 5.6,
      "text": "for. Are you leaving money on the table? Which \nof these robo-advisors is best? What does robo"
    },
    {
      "start": 16.48,
      "duration": 5.36,
      "text": "mean anyway? Today's presentation is chock full of \ninformation about robo-advisors that you need to"
    },
    {
      "start": 21.84,
      "duration": 5.28,
      "text": "know. So, we've been covering robo-advisors now \nfor over a decade. We've even worked with some"
    },
    {
      "start": 27.12,
      "duration": 6.96,
      "text": "of them in the past. And the name robo-advisor \nimplies some sort of AI usage when that's actually"
    },
    {
      "start": 34.08,
      "duration": 5.6,
      "text": "not really the case. The recipe-driven approach \nthat most robo-advisers take is quite simple. You"
    },
    {
      "start": 39.68,
      "duration": 6.8,
      "text": "may be familiar with the 100 minus your age rule. \nThat simply says that you take 100 minus your age"
    },
    {
      "start": 46.48,
      "duration": 4.96,
      "text": "and that's how much money you ought to have in \nequities and the rest in bonds. As time goes on,"
    },
    {
      "start": 51.44,
      "duration": 6.4,
      "text": "of course, as you age, the ratio of money going \ninto bonds increases. That's often called a glide"
    },
    {
      "start": 57.84,
      "duration": 4.88,
      "text": "path. And what you're doing there is you're \ngradually shifting your asset allocation from"
    },
    {
      "start": 62.72,
      "duration": 6.16,
      "text": "more risky assets to less risky assets, bonds, \nover time. As you get closer to retirement,"
    },
    {
      "start": 68.88,
      "duration": 6.48,
      "text": "you want to reduce volatility. So a robo-advisor \nroughly does the same thing. It automatically"
    },
    {
      "start": 75.36,
      "duration": 6.4,
      "text": "configures your allocations as you age. And \nthe real value ad for robo-advisors was that"
    },
    {
      "start": 81.76,
      "duration": 6.24,
      "text": "they were going to be a lower fee alternative \nto human advisors. This table here was actually"
    },
    {
      "start": 88.0,
      "duration": 5.36,
      "text": "taken from a piece that we did. I think this was \neight years ago looking at robo-advisors AI and"
    },
    {
      "start": 93.36,
      "duration": 5.2,
      "text": "asset allocation. And we had made the remark here \nthat these are really the same sort of tools that"
    },
    {
      "start": 98.56,
      "duration": 4.64,
      "text": "private wealth managers use except now they're \nstuffed into the cloud and automated so that"
    },
    {
      "start": 103.2,
      "duration": 5.68,
      "text": "anybody can access them. And when we think about \nthe $2 trillion that robo-advisers are managing,"
    },
    {
      "start": 108.88,
      "duration": 5.36,
      "text": "it's always important to put numbers into context. \nSo whilst that sounds very large, it actually"
    },
    {
      "start": 114.24,
      "duration": 4.96,
      "text": "isn't. So when you look at global assets under \nmanagement, so this would be money that's being"
    },
    {
      "start": 119.2,
      "duration": 8.16,
      "text": "managed by third parties, the value of that is \nnow close to $150 trillion. So robo-advisors"
    },
    {
      "start": 127.36,
      "duration": 4.96,
      "text": "manage about 2 trillion. That's about the same \namount of money that Edward Jones manages."
    },
    {
      "start": 132.32,
      "duration": 6.72,
      "text": "However, it's less than 2% of total wealth being \nmanaged. However, if you multiply that, let's say,"
    },
    {
      "start": 139.04,
      "duration": 5.12,
      "text": "by 30 basis points, perhaps the average fee being \ncharged by a robo adviser, you get a run rate of"
    },
    {
      "start": 144.16,
      "duration": 4.72,
      "text": "about $6 billion. So, there's a lot of money to \nbe made there. And we can look at this report"
    },
    {
      "start": 148.88,
      "duration": 6.64,
      "text": "by Morningstar, which looks at robo-advisors in \n2025. The executive summary here talks about how"
    },
    {
      "start": 155.52,
      "duration": 6.32,
      "text": "the great robo-advisor disruption never arrived. \nSo, it was anticipated that robo-advisors would"
    },
    {
      "start": 161.84,
      "duration": 5.28,
      "text": "replace human advisers. Well, that never really \nworked out. And this is pretty remarkable here."
    },
    {
      "start": 167.12,
      "duration": 6.32,
      "text": "It says just one pure robo-advisor remains that \ndoes not offer some person-to-person counsel with"
    },
    {
      "start": 173.44,
      "duration": 5.76,
      "text": "its algorithmic guidance. What this ended up \nturning into is really just a lead magnet to"
    },
    {
      "start": 179.2,
      "duration": 5.84,
      "text": "attract assets so that then they can upsell their \nclients personal advisor services. So really,"
    },
    {
      "start": 185.04,
      "duration": 4.8,
      "text": "we've just gone full circle and Morningstar \nhere talks about how for young investors with"
    },
    {
      "start": 189.84,
      "duration": 5.44,
      "text": "uncomplicated financial situations, robo-advisors \ncan be good starting places. Well, not when you"
    },
    {
      "start": 195.28,
      "duration": 5.28,
      "text": "have an environment now fueled by fintwats and \nsocial media where everybody's pushed towards"
    },
    {
      "start": 200.56,
      "duration": 5.36,
      "text": "high-risk options and prediction markets and \nthings like that. So whilst it may be good for"
    },
    {
      "start": 205.92,
      "duration": 4.0,
      "text": "young investors, I don't think a lot of them are \navailing themselves of these tools. And when you"
    },
    {
      "start": 209.92,
      "duration": 4.96,
      "text": "look at a robo-advisor like Betterment here, you \ncan see they're talking about how self-directed"
    },
    {
      "start": 214.88,
      "duration": 4.8,
      "text": "investing is here. Again, going full circle. \nThe idea was that it wouldn't be self-directed,"
    },
    {
      "start": 219.68,
      "duration": 4.8,
      "text": "that you would let these algorithms dictate your \nasset allocation. And now they're saying, well,"
    },
    {
      "start": 224.48,
      "duration": 4.32,
      "text": "you can be self-directed. They're really trying \nto be everything to everyone. And that sort of"
    },
    {
      "start": 228.8,
      "duration": 5.84,
      "text": "defeats the original purpose of robo-advisors. \nAnd here I've provided a table generated by Grok,"
    },
    {
      "start": 234.64,
      "duration": 5.84,
      "text": "which looks at the top robo-advisor by assets \nunder management. And there's a couple takeaways"
    },
    {
      "start": 240.48,
      "duration": 4.32,
      "text": "here. So, first of all, you're going to get \ndifferent numbers depending on where you look,"
    },
    {
      "start": 244.8,
      "duration": 7.6,
      "text": "but the leader by far would be Vanguard. \nRather remarkable. $333 billion in assets"
    },
    {
      "start": 252.4,
      "duration": 4.56,
      "text": "under management. And of course, they offer some \nof the lowest fees out there. You would expect"
    },
    {
      "start": 256.96,
      "duration": 5.36,
      "text": "that from Vanguard. That's their reputation, \nlow fees, right? Then you have Schwab here. Now,"
    },
    {
      "start": 262.32,
      "duration": 5.28,
      "text": "Schwab's done a great job of offering a lot \nof low-fee products, but they talk about here,"
    },
    {
      "start": 267.6,
      "duration": 3.6,
      "text": "no advisory fee. Well, there's no \nsuch thing as a free lunch, right? So,"
    },
    {
      "start": 271.2,
      "duration": 3.92,
      "text": "we're going to look into that. And then there's \nWealthfront, which is actually having an IPO. And"
    },
    {
      "start": 275.12,
      "duration": 5.12,
      "text": "that gives us an inside look into the mechanics \nof a robo-advisor, and we're going to talk about"
    },
    {
      "start": 280.24,
      "duration": 3.92,
      "text": "whether or not that would be something you'd \nwant to invest in. So, when we look at Schwab,"
    },
    {
      "start": 284.16,
      "duration": 4.96,
      "text": "you see here, no advisory fee charge. They \ncompare themselves to other robo-advisors."
    },
    {
      "start": 289.12,
      "duration": 4.24,
      "text": "And then when you dig into the mechanics, of \ncourse, you complete these questionnaires so"
    },
    {
      "start": 293.36,
      "duration": 4.64,
      "text": "they can assess your risk tolerance. It also takes \ninto account your age. And then you're given a"
    },
    {
      "start": 298.0,
      "duration": 6.32,
      "text": "diversified portfolio of ETFs. Well, those ETFs, \nof course, are charging fees. So there is no such"
    },
    {
      "start": 304.32,
      "duration": 6.24,
      "text": "thing as a free lunch. And when you look at the \nassessment of Schwab's offering by Morningstar,"
    },
    {
      "start": 310.56,
      "duration": 6.96,
      "text": "this is rather interesting. So technically, Schwab \ncould not charge fees at all and simply make money"
    },
    {
      "start": 317.52,
      "duration": 5.44,
      "text": "on the cash that they're holding. And they talk \nhere about how Schwab's intelligent portfolios"
    },
    {
      "start": 322.96,
      "duration": 4.48,
      "text": "make excessive cash allocations. You need \nto be careful there because there's a lot"
    },
    {
      "start": 327.44,
      "duration": 4.88,
      "text": "of incentive for Schwab to hold that cash. And \nwe're going to look at why that is when we take"
    },
    {
      "start": 332.32,
      "duration": 6.32,
      "text": "a closer look at Wealthfront, which realizes 75% \nof their revenues coming off of cash management."
    },
    {
      "start": 338.64,
      "duration": 6.32,
      "text": "And they talk here about how cash can be a drag on \nreturns. Well, really, when it comes to returns,"
    },
    {
      "start": 344.96,
      "duration": 4.4,
      "text": "this is a moot point. You need to focus on \nfees. So when you look at this collateral here,"
    },
    {
      "start": 349.36,
      "duration": 4.16,
      "text": "I think this is from Betterment talking about how \nsince they launched their core portfolio, it's"
    },
    {
      "start": 353.52,
      "duration": 4.56,
      "text": "delivered over 9%. Yeah. So roughly what the stock \nmarket has delivered. That's what you expect,"
    },
    {
      "start": 358.08,
      "duration": 5.12,
      "text": "right? You provided market performance. So what? \nThat's what your clients would expect. So, when"
    },
    {
      "start": 363.2,
      "duration": 5.84,
      "text": "you're looking to choose a robo-advisor, don't \npay attention to what they say their performance"
    },
    {
      "start": 369.04,
      "duration": 6.0,
      "text": "is. Focus on fee structures, which will differ \nby account sizes. So, typically the larger the"
    },
    {
      "start": 375.04,
      "duration": 4.8,
      "text": "account, the smaller the fees that you're paying. \nBut remember that the company managing the most"
    },
    {
      "start": 379.84,
      "duration": 5.6,
      "text": "assets is going to have the most flexibility when \nit comes to offering the lowest fees. And that's"
    },
    {
      "start": 385.44,
      "duration": 5.92,
      "text": "Vanguard. They've built their entire brand based \non being the lowcost leader. It's no surprise at"
    },
    {
      "start": 391.36,
      "duration": 4.88,
      "text": "all that they're ranked highest by Morningstar. \nI think three out of the past four years they've"
    },
    {
      "start": 396.24,
      "duration": 4.4,
      "text": "been ranked highest. But I noticed the footnote \nwas quite interesting. They said, compensation"
    },
    {
      "start": 400.64,
      "duration": 4.64,
      "text": "provided for use of the rating and marketing \nmaterials. So Morningstar rates them and then"
    },
    {
      "start": 405.28,
      "duration": 4.16,
      "text": "they have to pay Morningstar to put that in their \nmarket materials. It's rather shifty, but I think"
    },
    {
      "start": 409.44,
      "duration": 5.28,
      "text": "when you read this report by Morningstar, it all \nmakes sense. It comes down to fees. So, what you"
    },
    {
      "start": 414.72,
      "duration": 5.28,
      "text": "can do is go over to Vanguard's site and calculate \nthe cost or they don't call it a robo-advisor"
    },
    {
      "start": 420.0,
      "duration": 3.6,
      "text": "anymore. They call it a digital advisor. You \nplug in the amount of money that you're going"
    },
    {
      "start": 423.6,
      "duration": 4.64,
      "text": "to invest in it. It tells you what you're going \nto pay. So, I would say if you're going to pay"
    },
    {
      "start": 428.24,
      "duration": 7.28,
      "text": "20 basis points for an asset allocation glide path \nof the type that Vanguard is providing, just do it"
    },
    {
      "start": 435.52,
      "duration": 6.4,
      "text": "yourself with Fidelity Zero products and don't \npay any fees at all. A major reason why people"
    },
    {
      "start": 441.92,
      "duration": 5.6,
      "text": "have financial advisors is for emotional support. \nThis was taken from a piece we did that looked at"
    },
    {
      "start": 447.52,
      "duration": 6.64,
      "text": "financial advisors and why people hire them. \nAnd emotion-based reasons make up the majority"
    },
    {
      "start": 454.16,
      "duration": 5.68,
      "text": "of reasons why they're being hired. And that's \nbecause when the stock market starts crashing"
    },
    {
      "start": 459.84,
      "duration": 4.32,
      "text": "or a stock starts falling, that's when everybody \nstarts asking questions. Whenever there's a market"
    },
    {
      "start": 464.16,
      "duration": 4.64,
      "text": "correction, we get inundated with emails from \npeople who want assurance. They get that from"
    },
    {
      "start": 468.8,
      "duration": 4.08,
      "text": "financial advisors. One would hope they do, right? \nYou should stay the course. That's typically what"
    },
    {
      "start": 472.88,
      "duration": 5.2,
      "text": "a financial adviser would tell you. So, what you \ncan do then is pay Vanguard a little bit extra"
    },
    {
      "start": 478.08,
      "duration": 5.44,
      "text": "and get a personal advisor. So, you should always \nbe looking at fees that you're paying, divided by"
    },
    {
      "start": 483.52,
      "duration": 4.72,
      "text": "the money that you're giving them. So, simple math \nshows that for a personal adviser, you have to,"
    },
    {
      "start": 488.24,
      "duration": 4.88,
      "text": "I think, have at least 50k. That's going to be \n35 basis points. That's reasonable. Compare that"
    },
    {
      "start": 493.12,
      "duration": 4.56,
      "text": "to Edward Jones, which is going to charge you 1% \nupfront. And then, of course, hefty fees on the"
    },
    {
      "start": 497.68,
      "duration": 4.32,
      "text": "products that they push you towards. Right? What \nI really like about this is it explains it very"
    },
    {
      "start": 502.0,
      "duration": 3.92,
      "text": "clearly. The most you'll pay. And then when you \nlook at the mechanics here, well, they're saying,"
    },
    {
      "start": 505.92,
      "duration": 5.44,
      "text": "\"All right, we're going to refund the fees \nthat you're paying for the products we push you"
    },
    {
      "start": 511.36,
      "duration": 5.04,
      "text": "towards.\" And that goes against that fee. So the \nmost you're ever going to pay is 35 basis points."
    },
    {
      "start": 516.4,
      "duration": 6.56,
      "text": "Now, when it comes to the future of robo-advisors, \nit doesn't look all that promising to be honest."
    },
    {
      "start": 522.96,
      "duration": 6.08,
      "text": "I like this timeline that can be found in that \nMorningstar report and it looks at the various"
    },
    {
      "start": 529.04,
      "duration": 5.12,
      "text": "large firms out there that dabbled. What's \nremarkable is it took less than six years for"
    },
    {
      "start": 534.16,
      "duration": 5.6,
      "text": "Vanguard to simply dominate this space. So, back \nwhen we first started looking at robo-advisors,"
    },
    {
      "start": 539.76,
      "duration": 4.56,
      "text": "they weren't even playing, and now they're by \nfar the biggest leader. Took Goldman five years,"
    },
    {
      "start": 544.32,
      "duration": 5.6,
      "text": "less than 5 years, to decide robo-advisors \nweren't for them. JP Morgan also shuttered their"
    },
    {
      "start": 549.92,
      "duration": 6.24,
      "text": "offering on weak demand. So that brings us to the \nWealthfront IPO. So this was announced, I think,"
    },
    {
      "start": 556.16,
      "duration": 5.28,
      "text": "in September, and only recently got around to \nlooking at the S1. Not missing a whole lot,"
    },
    {
      "start": 561.44,
      "duration": 5.04,
      "text": "but certainly some interesting information here. \nSo first of all, they talk about $88 billion in"
    },
    {
      "start": 566.48,
      "duration": 3.92,
      "text": "assets under management. Well, that's different \nfrom the numbers we looked at before, and that's"
    },
    {
      "start": 570.4,
      "duration": 5.68,
      "text": "because they're breaking out cash management from \ninvestment advisory fees. So, if we take the money"
    },
    {
      "start": 576.08,
      "duration": 7.04,
      "text": "they're managing, $42 billion, we multiply that by \n25 bips, we get $105 million. Well, when we look"
    },
    {
      "start": 583.12,
      "duration": 7.28,
      "text": "at their actual revenues, investment advisory is \na lot less. But here is what's remarkable. Cash"
    },
    {
      "start": 590.4,
      "duration": 6.48,
      "text": "management makes up 75% of their revenues. So, \nthe lion's share of money they're making comes"
    },
    {
      "start": 596.88,
      "duration": 6.8,
      "text": "from interest that they're receiving from cash \nbalances that they're holding for their clients."
    },
    {
      "start": 603.68,
      "duration": 7.2,
      "text": "So this is potentially problematic. So if they \nshift that from cash management to investments,"
    },
    {
      "start": 610.88,
      "duration": 3.92,
      "text": "presumably they're going to make less. But \nwhat will really have them making less is"
    },
    {
      "start": 614.8,
      "duration": 5.52,
      "text": "when interest rates continue to drop. So this \ndoesn't bode well for their business. When we"
    },
    {
      "start": 620.32,
      "duration": 5.44,
      "text": "look at the future of robo-advisors, I think \nMorningstar says it best. Few digital advisers,"
    },
    {
      "start": 625.76,
      "duration": 4.88,
      "text": "robo-advisors, whatever you want to call \nthem, rely solely on computer algorithms."
    },
    {
      "start": 630.64,
      "duration": 5.44,
      "text": "They're now starting to look more like the firms \nthat they were trying to disrupt. Again, we're"
    },
    {
      "start": 636.08,
      "duration": 6.32,
      "text": "coming full circle. Nearly all digital advisers \nnow offer some human counsel, but they continue to"
    },
    {
      "start": 642.4,
      "duration": 5.6,
      "text": "compete on cost and new features. So, that's good \nfor customers. Morningstar says that none of these"
    },
    {
      "start": 648.0,
      "duration": 6.64,
      "text": "digital advisers foresee using AI to generate \nrecommendations yet because they're fearful of"
    },
    {
      "start": 654.64,
      "duration": 5.68,
      "text": "things like hallucinations. But when you consider \nthat this is simply an asset allocation exercise,"
    },
    {
      "start": 660.32,
      "duration": 6.48,
      "text": "how much real value is AI going to add anyway? So \nthis conclusion, of course, that digital advisers,"
    },
    {
      "start": 666.8,
      "duration": 5.68,
      "text": "robo advisers have supplemented rather than \nsupplanted traditional advisor. So the big"
    },
    {
      "start": 672.48,
      "duration": 5.76,
      "text": "question, should you use a robo-advisor? Well, if \nyou can't be asked to deal with asset allocation"
    },
    {
      "start": 678.24,
      "duration": 5.84,
      "text": "decisions yourself, then sure. But if you don't \nneed human contact, just create your own glide"
    },
    {
      "start": 684.08,
      "duration": 6.16,
      "text": "path using Fidelity Zero. And think long and hard \nabout paying for human contact. How often are you"
    },
    {
      "start": 690.24,
      "duration": 4.96,
      "text": "going to use that, right? So make sure that you're \ngetting, as we talked about in our financial"
    },
    {
      "start": 695.2,
      "duration": 4.4,
      "text": "advisor piece, you're getting sufficient value and \nyou understand all the fees you're paying. That's"
    },
    {
      "start": 699.6,
      "duration": 4.96,
      "text": "why we like Vanguard, right? Transparency. They're \nthe only robo-adviser we would consider. So they"
    },
    {
      "start": 704.56,
      "duration": 5.92,
      "text": "have the assets under management to truly compete \non price. Their fee structure is transparent with"
    },
    {
      "start": 710.48,
      "duration": 6.0,
      "text": "this will-not-exceed structure. Also, this isn't \na binary decision. You could allocate some of your"
    },
    {
      "start": 716.48,
      "duration": 5.84,
      "text": "assets to a robo-advisor and then use that as a \nbenchmark. Now, when it comes to Wealthfront's"
    },
    {
      "start": 722.32,
      "duration": 4.8,
      "text": "IPO, I don't think investing in that seems like \na great idea. Remains to be seen what the stock"
    },
    {
      "start": 727.12,
      "duration": 4.96,
      "text": "price does, but the company isn't attractive for \nthe reasons that we talked about. What happens"
    },
    {
      "start": 732.08,
      "duration": 5.28,
      "text": "when interest rates fall? So, I'm sure a fair \nnumber of you out there have financial advisors."
    },
    {
      "start": 737.36,
      "duration": 4.24,
      "text": "I think it's very important that you understand \nthe value that you're getting. So, you ought to"
    },
    {
      "start": 741.6,
      "duration": 5.92,
      "text": "watch this piece next. It's probing the sort of \nquestions you ought to be asking your financial"
    },
    {
      "start": 747.52,
      "duration": 4.72,
      "text": "advisor. So, give that a watch next. Thanks so \nmuch for taking the time to watch this today."
    }
  ]
}