{
  "video_id": "J5KvND_e_fM",
  "title": "Silver is Absolutely Skyrocketing. Here’s Why.",
  "channel": "Nanalyze",
  "published_at": "2025-12-26T15:02:35Z",
  "duration": "PT11M50S",
  "thumbnail": "https://i.ytimg.com/vi/J5KvND_e_fM/hqdefault.jpg",
  "fetched_at": "2026-01-16T12:16:09.550697",
  "transcript": [
    {
      "start": 0.08,
      "duration": 5.36,
      "text": "They say that the most appealing investment \nthesis has two key components. Number one"
    },
    {
      "start": 5.44,
      "duration": 4.72,
      "text": "is the promise of future riches. So that \ngoes without saying. But number two is much"
    },
    {
      "start": 10.16,
      "duration": 5.92,
      "text": "more interesting. The most attractive thesis \nproposed is that you only realize your gains"
    },
    {
      "start": 16.08,
      "duration": 3.92,
      "text": "when the rest of the world is collapsing. \nIt's critically important that people that"
    },
    {
      "start": 20.0,
      "duration": 5.44,
      "text": "don't have your Nostradamus-like investing \nacumen suffer while you wallow in wealth."
    },
    {
      "start": 25.44,
      "duration": 5.52,
      "text": "And that's the primal reason why investing \nin precious metals is so appealing to so"
    },
    {
      "start": 30.96,
      "duration": 3.44,
      "text": "many retail investors. Today, we're going to \nteach you everything you need to know about"
    },
    {
      "start": 34.4,
      "duration": 10.24,
      "text": "investing in silver. You're going to learn a \nlot in a very short period of time. I promise."
    },
    {
      "start": 44.64,
      "duration": 6.48,
      "text": "Now, we're not invested in silver directly, but \nwe are enjoying the benefits. Can you guess why?"
    },
    {
      "start": 51.12,
      "duration": 6.72,
      "text": "That's right, gold. We happen to hold gold as one \nof our alternative assets and we've been enjoying"
    },
    {
      "start": 57.84,
      "duration": 6.4,
      "text": "a similar price appreciation as silver. That's \nbecause gold and silver are highly correlated,"
    },
    {
      "start": 64.24,
      "duration": 6.4,
      "text": "which means the prices typically move together. \nI love this tool here, Portfolio Visualizer."
    },
    {
      "start": 70.64,
      "duration": 5.04,
      "text": "What it lets you do is put in various assets \nand see the correlations over time. This is"
    },
    {
      "start": 75.68,
      "duration": 7.28,
      "text": "rather interesting. We've taken two of the largest \nPrecious Metals ETFs, the Silver ETF and Gold ETF,"
    },
    {
      "start": 82.96,
      "duration": 6.56,
      "text": "and looked at their correlations over time. So, \nit's interesting to see a drop off around the"
    },
    {
      "start": 89.52,
      "duration": 6.4,
      "text": "time of the Rona. But these are still highly \ncorrelated. So, anything above 0.7 would be"
    },
    {
      "start": 95.92,
      "duration": 6.08,
      "text": "considered highly correlated. That means that \nholding one is going to give you similar exposure"
    },
    {
      "start": 102.0,
      "duration": 5.36,
      "text": "to holding the other. Now, another metric that \ngold investors like to use is the gold-silver"
    },
    {
      "start": 107.36,
      "duration": 5.92,
      "text": "ratio. So, you simply take the price of an ounce \nof gold and divide it by the price of silver. And"
    },
    {
      "start": 113.28,
      "duration": 6.24,
      "text": "then that's a ratio that you can plot over time. \nSo, when it spikes, that presumes that silver"
    },
    {
      "start": 119.52,
      "duration": 5.68,
      "text": "needs to catch up to gold. And then when it falls, \nthat means silver is catching up to gold. And you"
    },
    {
      "start": 125.2,
      "duration": 5.28,
      "text": "can see this metric declining recently. That's \nbecause silver has been hitting new highs and"
    },
    {
      "start": 130.48,
      "duration": 4.72,
      "text": "attracting a lot of attention. and it's caused our \npremium subscribers to start asking some questions"
    },
    {
      "start": 135.2,
      "duration": 4.72,
      "text": "around this, which is why we're covering silver \ntoday. Now, they say that gold is like a 3:00"
    },
    {
      "start": 139.92,
      "duration": 7.92,
      "text": "a.m. booty call. It only shines when everything \nelse has fallen apart. But lately, both gold and"
    },
    {
      "start": 147.84,
      "duration": 5.44,
      "text": "silver have been shining despite the fact that \nwe're still in a raging bull market. But this is"
    },
    {
      "start": 153.28,
      "duration": 4.88,
      "text": "very important. That's not why we're holding gold. \nIt's not because we expect gold to outperform."
    },
    {
      "start": 158.16,
      "duration": 5.52,
      "text": "It's very important to understand that. We hold \nit because of diversification effects. And again,"
    },
    {
      "start": 163.68,
      "duration": 5.12,
      "text": "Portfolio Visualizer, with this great correlation \nmatrix. We used to have to put these together"
    },
    {
      "start": 168.8,
      "duration": 7.68,
      "text": "manually in B school. And here, you can see how \nweakly correlated gold is against these various"
    },
    {
      "start": 176.48,
      "duration": 7.2,
      "text": "benchmarks. Institutional investors often use \ngold as a tool for its diversification effects,"
    },
    {
      "start": 183.68,
      "duration": 3.76,
      "text": "and that's why we hold it. Now, here's where \nthings get interesting. I didn't know this."
    },
    {
      "start": 187.44,
      "duration": 5.6,
      "text": "So silver actually has, generally, a higher \ncorrelation to equities than gold. That means"
    },
    {
      "start": 193.04,
      "duration": 5.44,
      "text": "that it more closely aligns with the stock market, \nand the reason is very intuitive. That's because"
    },
    {
      "start": 198.48,
      "duration": 6.64,
      "text": "there are a lot more industrial use cases for \nsilver than gold. So the diversification effect"
    },
    {
      "start": 205.12,
      "duration": 6.88,
      "text": "you get from holding silver is less than gold. And \nthis past year, both metals have rallied strongly."
    },
    {
      "start": 212.0,
      "duration": 4.64,
      "text": "So, if we look at performance real quick, \nyou can see on the 5-year chart here, yes,"
    },
    {
      "start": 216.64,
      "duration": 6.08,
      "text": "over the past several years, both silver and gold \nhave appreciated. You see, silver is outpacing"
    },
    {
      "start": 222.72,
      "duration": 6.16,
      "text": "gold. Both are beating the returns of the S&P \n500. But then, when we take this out to 20 years,"
    },
    {
      "start": 228.88,
      "duration": 5.6,
      "text": "it really gets interesting. Gold has actually \nbeaten the S&P 500 over the past 20 years,"
    },
    {
      "start": 234.48,
      "duration": 8.88,
      "text": "returning 521% versus the S&P 500 at 438%. Now, \ngold is often criticized. I believe Buffett would"
    },
    {
      "start": 243.36,
      "duration": 5.52,
      "text": "criticize gold and say, \"Well, it doesn't actually \ndo anything, right? It potentially costs money to"
    },
    {
      "start": 248.88,
      "duration": 5.84,
      "text": "store. It doesn't generate any sort of income.\" \nAnd an analogy I've always enjoyed is aliens"
    },
    {
      "start": 254.72,
      "duration": 5.36,
      "text": "looking down on our planet would see us digging up \nthis shiny rock and spending all this money trying"
    },
    {
      "start": 260.08,
      "duration": 4.8,
      "text": "to find it and dig it out of the ground. Then we \nrefine it a bit and then we put it back inside the"
    },
    {
      "start": 264.88,
      "duration": 5.36,
      "text": "ground in Fort Knox and guard it. So, what the \nhell are we even doing, right? It's a rock. A"
    },
    {
      "start": 270.24,
      "duration": 9.76,
      "text": "rock. A rock. Gold has no intrinsic value, really. \nIt doesn't produce dividends or earnings. However,"
    },
    {
      "start": 280.0,
      "duration": 5.04,
      "text": "there's a lot of value, culturally, for gold, \nespecially in places like India. You see here"
    },
    {
      "start": 285.04,
      "duration": 6.8,
      "text": "the usage of gold in jewelry. And only 7 to 10% \nof gold that's produced is used for industrial"
    },
    {
      "start": 291.84,
      "duration": 6.24,
      "text": "purposes. Contrast that to silver where 50 \nto 60% of all silver that's produced is used"
    },
    {
      "start": 298.08,
      "duration": 5.68,
      "text": "for industrial use cases. And the latest thesis \nthat we've been seeing, this title says it all,"
    },
    {
      "start": 303.76,
      "duration": 3.84,
      "text": "right? The world is running out of silver and AI \nis accelerating the squeeze. Well, first of all,"
    },
    {
      "start": 307.6,
      "duration": 5.36,
      "text": "the world's not running out of silver. There \nis a mismatch between supply and demand. We're"
    },
    {
      "start": 312.96,
      "duration": 4.88,
      "text": "going to look at in a second, but industrial use \ncases certainly have increased. They were at an"
    },
    {
      "start": 317.84,
      "duration": 7.04,
      "text": "all-time high in 2024. And data centers are \na driver of that because silver's used in the"
    },
    {
      "start": 324.88,
      "duration": 4.88,
      "text": "production of electronic equipment. Here's what's \nvery interesting. I didn't know this either."
    },
    {
      "start": 329.76,
      "duration": 7.76,
      "text": "Around 70% of silver, globally, is produced \nas a byproduct of producing other metals. So"
    },
    {
      "start": 337.52,
      "duration": 4.72,
      "text": "that starts to make things quite complex, right? \nBecause that means you have to start producing,"
    },
    {
      "start": 342.24,
      "duration": 5.28,
      "text": "in 70% of the cases, other metals more if you \nwant to increase the production of silver. So"
    },
    {
      "start": 347.52,
      "duration": 6.08,
      "text": "that makes it more difficult to respond to changes \nin demand, which, of course, is why you see the"
    },
    {
      "start": 353.6,
      "duration": 8.4,
      "text": "price appreciation. Demand has now exceeded supply \nfor the past 5 years. And what happens when we see"
    },
    {
      "start": 362.0,
      "duration": 4.72,
      "text": "supply not meeting demand? Well, there's going \nto be more recycling, right? The price goes"
    },
    {
      "start": 366.72,
      "duration": 5.04,
      "text": "up. It makes it more lucrative to recycle. New \nexploration, of course, it takes quite a while"
    },
    {
      "start": 371.76,
      "duration": 6.0,
      "text": "to bring mines online. So there's certainly a lag \nthere. You have technological advancements. Solar"
    },
    {
      "start": 377.76,
      "duration": 5.52,
      "text": "panels actually use quite a bit of silver, and now \nthey're looking at different ways that they can"
    },
    {
      "start": 383.28,
      "duration": 5.28,
      "text": "reduce the volume of silver needed. It's called \nthrifting. There are efficiency improvements,"
    },
    {
      "start": 388.56,
      "duration": 6.16,
      "text": "of course, and price increases are going to drive \nall these factors, right? So, eventually then,"
    },
    {
      "start": 394.72,
      "duration": 6.08,
      "text": "you'll have supply meeting demand. This is just \nhow basic economics work for commodities like gold"
    },
    {
      "start": 400.8,
      "duration": 6.32,
      "text": "and silver. Now you need to take this conversation \nto a higher level, to start out with. And start at"
    },
    {
      "start": 407.12,
      "duration": 6.56,
      "text": "the asset class allocation level and think about \nalternative asset class exposure. All right."
    },
    {
      "start": 413.68,
      "duration": 5.44,
      "text": "So what percentage of my assets do I want in \nalternatives? So we're targeting roughly 10%. For"
    },
    {
      "start": 419.12,
      "duration": 5.6,
      "text": "us, our alternative assets would be gold. We have \nsome Bitcoin, some wine, some art. In my mind,"
    },
    {
      "start": 424.72,
      "duration": 4.72,
      "text": "alternatives can also be things that you have a \nlittle bit of fun with, things that you enjoy,"
    },
    {
      "start": 429.44,
      "duration": 4.08,
      "text": "right? There's a lot of studies out there. Grok \nmakes it super easy now, or whatever your favorite"
    },
    {
      "start": 433.52,
      "duration": 5.68,
      "text": "LLM is. Just go and ask it what research says, and \nit'll go out there and find key research papers"
    },
    {
      "start": 439.2,
      "duration": 5.76,
      "text": "and tell you what the findings are. Whilst many of \nthese studies treat silver and gold differently,"
    },
    {
      "start": 444.96,
      "duration": 7.2,
      "text": "the combined recommendations say anywhere from \n5 to 15%. And you can look at asset owners like"
    },
    {
      "start": 452.16,
      "duration": 6.0,
      "text": "Norway's Sovereign Wealth Fund or Stanford's \nFund, like large asset owners and how they do"
    },
    {
      "start": 458.16,
      "duration": 4.64,
      "text": "asset-class allocation and mimic that. Which \nalternatives do you find appealing? Right? If"
    },
    {
      "start": 462.8,
      "duration": 3.2,
      "text": "you're starting to think about investing in \nalternatives, you probably accumulated some"
    },
    {
      "start": 466.0,
      "duration": 4.72,
      "text": "wealth, you can have some fun with it. And holding \ngold, I don't know. This was several years ago. We"
    },
    {
      "start": 470.72,
      "duration": 3.68,
      "text": "were sort of thinking about that and saying, \nis there something more relevant? So we cover"
    },
    {
      "start": 474.4,
      "duration": 4.56,
      "text": "dividend growth stocks and disruptive growth \nstocks. Is there some alternative asset that's"
    },
    {
      "start": 478.96,
      "duration": 3.84,
      "text": "more relevant? Let's say investing in startups, \nright? We were thinking about that now that gold"
    },
    {
      "start": 482.8,
      "duration": 5.68,
      "text": "is appreciating rapidly, right? It becomes very \ndifficult to start changing your alternative asset"
    },
    {
      "start": 488.48,
      "duration": 4.88,
      "text": "allocation strategy, right, when something's \nrunning. But at any rate, people are going to"
    },
    {
      "start": 493.36,
      "duration": 6.48,
      "text": "wonder, well, how should you hold gold or silver? \nI think holding physical bullion is a lot of fun,"
    },
    {
      "start": 499.84,
      "duration": 4.72,
      "text": "right? Taking out your little bag of gold coins. \nIt's fun to hold physical bullion, right? Now,"
    },
    {
      "start": 504.56,
      "duration": 4.32,
      "text": "of course, you hold it in a safe or a lock box \nsomewhere. You don't tell anyone about it. But if"
    },
    {
      "start": 508.88,
      "duration": 6.56,
      "text": "you can't do that, then you can consider an ETF \nlike SLV, which charges 50 basis points. That's"
    },
    {
      "start": 515.44,
      "duration": 5.68,
      "text": "quite high, half a percent. Or you have SIVR, \n30 basis points. We would always just choose"
    },
    {
      "start": 521.12,
      "duration": 8.0,
      "text": "the lowest-fee ETF. So for gold, we're paying 10 \nbasis points for the SPDR Gold MiniShares ETF,"
    },
    {
      "start": 529.12,
      "duration": 5.36,
      "text": "right? That's really a good deal. We always look \nand choose the lowest-fee ETF. Now, miners just"
    },
    {
      "start": 534.48,
      "duration": 4.56,
      "text": "aren't compelling. A lot of people would probably \ndisagree with that. That's because your exposure"
    },
    {
      "start": 539.04,
      "duration": 5.44,
      "text": "isn't so pure. You know, the idea, oh, I'm going \nto get, you know, leveraged returns on precious"
    },
    {
      "start": 544.48,
      "duration": 5.52,
      "text": "metals. Yeah, there's a lot of risk there. And \ngenerally speaking, the risks don't justify"
    },
    {
      "start": 550.0,
      "duration": 5.84,
      "text": "the rewards. Really, avoid anything relating to \njunior miners. Just a bad idea. Now, let's say you"
    },
    {
      "start": 555.84,
      "duration": 5.12,
      "text": "wanted to hold a basket of all precious metals, \nokay? Not just gold and silver. I found this,"
    },
    {
      "start": 560.96,
      "duration": 5.28,
      "text": "the abrdn Physical Precious Metals Basket. What \nthey've done here is they're looking at market"
    },
    {
      "start": 566.24,
      "duration": 6.08,
      "text": "value and liquidity and coming up with weightings. \nAnd look how interesting this is. So 92% of this"
    },
    {
      "start": 572.32,
      "duration": 4.64,
      "text": "ETF would be in gold and silver. So there really \nisn't a need to go rooting around for that"
    },
    {
      "start": 576.96,
      "duration": 6.16,
      "text": "additional 8% exposure to Paladium or platinum, \nright? And if you wanted to invest in this basket,"
    },
    {
      "start": 583.12,
      "duration": 5.28,
      "text": "they're going to charge you 60 bips. That's way \ntoo much. So you could do this instead. So have"
    },
    {
      "start": 588.4,
      "duration": 7.76,
      "text": "your own weightings. Hold 65% in a gold ETF. As I \nsaid, SPDR Gold MiniShares at 10 bips. Hold 35% in"
    },
    {
      "start": 596.16,
      "duration": 6.48,
      "text": "a silver ETF. So, you can use the abrdn Physical \nSilver Shares ETF, charging 30 bips. You're paying"
    },
    {
      "start": 602.64,
      "duration": 6.4,
      "text": "a blended 17 bips. This isn't a bad idea, frankly, \nand we could do that in our own portfolio. But"
    },
    {
      "start": 609.04,
      "duration": 6.8,
      "text": "since these assets are highly correlated and gold \ngives you that additional diversification effect,"
    },
    {
      "start": 615.84,
      "duration": 4.0,
      "text": "I think we'll probably just stick with \nwhere we're at. Now, people might say, well,"
    },
    {
      "start": 619.84,
      "duration": 5.84,
      "text": "is silver going to benefit more with the AI boom? \nYou could certainly make a case for that. But I"
    },
    {
      "start": 625.68,
      "duration": 5.84,
      "text": "don't think that's a compelling enough reason for \nus to switch our weightings because, again, we're"
    },
    {
      "start": 631.52,
      "duration": 6.16,
      "text": "primarily holding gold for the diversification \neffect from an asset allocation perspective. So,"
    },
    {
      "start": 637.68,
      "duration": 6.72,
      "text": "so silver and gold offer similar exposure profiles \nbecause they're highly correlated, and silver has"
    },
    {
      "start": 644.4,
      "duration": 5.68,
      "text": "more industrial use cases. So, it may stand to \nbenefit more from the growth of AI. It's also more"
    },
    {
      "start": 650.08,
      "duration": 5.04,
      "text": "correlated to equities. So, from a diversification \nperspective, that's not so appealing. If you're"
    },
    {
      "start": 655.12,
      "duration": 5.92,
      "text": "all in on any precious metal, I think, you need \nto start thinking about diversifying over time"
    },
    {
      "start": 661.04,
      "duration": 4.64,
      "text": "into other asset classes. A great opportunity to \ndo that. You're someone sitting on the sidelines."
    },
    {
      "start": 665.68,
      "duration": 6.16,
      "text": "Think about alternative assets more holistically. \nNo FOMO. And I think a blend of gold and silver"
    },
    {
      "start": 671.84,
      "duration": 5.44,
      "text": "might make sense, and physical bullion, if \nyou can. Then you avoid fees entirely. And"
    },
    {
      "start": 677.28,
      "duration": 6.16,
      "text": "if you're going to invest in silver, invest \nfrom the perspective of an alternative asset,"
    },
    {
      "start": 683.44,
      "duration": 4.72,
      "text": "not just because of AI data center growth. That's \njust an incidental benefit, hopefully. Right? So"
    },
    {
      "start": 688.16,
      "duration": 4.56,
      "text": "I know some investors out there will be raising \nthe question, well, there's other metals that you"
    },
    {
      "start": 692.72,
      "duration": 4.88,
      "text": "can invest in that will benefit from the growth \nof AI data centers. And one of those is copper."
    },
    {
      "start": 697.6,
      "duration": 4.88,
      "text": "So we published this piece, this was in summer \nof last year, that looks at ways to invest in"
    },
    {
      "start": 702.48,
      "duration": 5.76,
      "text": "copper. Give that a watch next. Thanks so much \nfor taking the time to watch this video today."
    }
  ]
}