{
  "video_id": "jOL2GMJmYkQ",
  "title": "10 Fuel Cell Stocks Solving the AI Energy Crisis",
  "channel": "Nanalyze",
  "published_at": "2025-12-12T16:01:20Z",
  "duration": "PT13M39S",
  "thumbnail": "https://i.ytimg.com/vi/jOL2GMJmYkQ/hqdefault.jpg",
  "fetched_at": "2026-01-16T12:19:32.773369",
  "transcript": [
    {
      "start": 0.32,
      "duration": 6.08,
      "text": "Solving the AI energy crisis with nuclear \nenergy is taking a while. And in the meantime,"
    },
    {
      "start": 6.4,
      "duration": 5.68,
      "text": "data centers are scrambling to find energy \nsources. One answer could be fuel cells,"
    },
    {
      "start": 12.08,
      "duration": 6.24,
      "text": "a technology that checks all the boxes and more. \nModular fuel cell systems can be deployed in less"
    },
    {
      "start": 18.32,
      "duration": 6.4,
      "text": "than a year. They're 10 to 30% more efficient than \ngas turbines, and they emit fewer emissions as"
    },
    {
      "start": 24.72,
      "duration": 5.44,
      "text": "well. They're also quieter, and they come with \nmore load versatility. But that doesn't mean I"
    },
    {
      "start": 30.16,
      "duration": 5.76,
      "text": "should immediately go out and start adding fuel \ncell stocks to my portfolio. Not all fuel cell"
    },
    {
      "start": 35.92,
      "duration": 5.44,
      "text": "stocks are created equal. We've been covering \nthe fuel cell thesis for over a decade now. And"
    },
    {
      "start": 41.36,
      "duration": 4.72,
      "text": "if fuel cells were ever going to have their big \nmoment, it's now. Today, we're going to do three"
    },
    {
      "start": 46.08,
      "duration": 6.0,
      "text": "things. We're going to check for fuel cell ETFs. \nWe're then going to identify a universe of fuel"
    },
    {
      "start": 52.08,
      "duration": 5.6,
      "text": "cell stocks. And we're going to identify companies \nthat we might want to dig further into. So,"
    },
    {
      "start": 57.68,
      "duration": 11.92,
      "text": "let's get my Lambo journey started and jump \nright into a list of stonks we can choose from."
    },
    {
      "start": 69.6,
      "duration": 5.52,
      "text": "About 5 years ago, we published a guide to \ninvesting in fuel cell stocks and identified"
    },
    {
      "start": 75.12,
      "duration": 6.08,
      "text": "10 names of interest. Today, our tech stock \ncatalog holds eight fuel cell stocks and one"
    },
    {
      "start": 81.2,
      "duration": 6.64,
      "text": "fuel cell ETF, the Global X Hydrogen ETF. So, \nlet's start there. It trades under the ticker"
    },
    {
      "start": 87.84,
      "duration": 6.88,
      "text": "HYDR. It has less than $100 million in assets \nunder management. So that means that not a lot"
    },
    {
      "start": 94.72,
      "duration": 5.28,
      "text": "of investors are interested in the fuel cell \nthesis right now. It has an expense ratio of"
    },
    {
      "start": 100.0,
      "duration": 7.12,
      "text": "50 BIPS. Seems about right for an actively managed \nETF and just 25 constituents. So it's going to be"
    },
    {
      "start": 107.12,
      "duration": 6.16,
      "text": "very concentrated. What we've done here is pulled \nup a list of the top 10 constituents that account"
    },
    {
      "start": 113.28,
      "duration": 7.84,
      "text": "for about 70% of the entire ETF. And what we can \nthen do is cross-check that list against our own"
    },
    {
      "start": 121.12,
      "duration": 6.88,
      "text": "list. And here I've pulled it up. You see I've \nexcluded two names here that don't have revenues."
    },
    {
      "start": 128.0,
      "duration": 6.08,
      "text": "So our rule, probably one of the most effective \nrules we have for taking out the trash is simply"
    },
    {
      "start": 134.08,
      "duration": 5.2,
      "text": "this: No meaningful revenues, no interest, no \nexceptions. That's a showstopper. We don't go"
    },
    {
      "start": 139.28,
      "duration": 7.04,
      "text": "any further. So, of the remaining names, six are \noverlapping with the top 10 on the Global X list,"
    },
    {
      "start": 146.32,
      "duration": 6.24,
      "text": "which means there are some names we're missing. \nHowever, we have covered some of these missing"
    },
    {
      "start": 152.56,
      "duration": 6.32,
      "text": "names. And I'll tell you one thing that's great \nabout our growing community of global investors is"
    },
    {
      "start": 158.88,
      "duration": 6.48,
      "text": "the network effect. So, the more people that begin \nsubscribing to our channel, our premium content,"
    },
    {
      "start": 165.36,
      "duration": 7.04,
      "text": "and following our brand, the more information gets \nfed to us. And a longtime reader of ours who lives"
    },
    {
      "start": 172.4,
      "duration": 6.16,
      "text": "somewhere in the Nordic region, brought up a few \nnames. This was nearly 5 years ago, names he said"
    },
    {
      "start": 178.56,
      "duration": 6.24,
      "text": "we ought to look at. Power Cell Sweden and also \nthis Nel Hydrogen from Norway. We'll take a look"
    },
    {
      "start": 184.8,
      "duration": 3.92,
      "text": "at those trying to answer two basic questions. \nFirst of all, are they growing revenues? Right?"
    },
    {
      "start": 188.72,
      "duration": 4.56,
      "text": "You can't be disrupting anything if you're not \ngrowing revenues. And are they being hyped? So,"
    },
    {
      "start": 193.28,
      "duration": 5.28,
      "text": "starting with Power Cell, what we see starting \noff would be consistent revenue growth. This"
    },
    {
      "start": 198.56,
      "duration": 5.6,
      "text": "looks really nice, right? And a positive gross \nmargin. Whether or not operating income turns"
    },
    {
      "start": 204.16,
      "duration": 5.84,
      "text": "positive. We can figure that out later on down \nthe road. So, looking at this fundamental data,"
    },
    {
      "start": 210.0,
      "duration": 5.92,
      "text": "you would expect that since the company was \nraised 5 years ago that the stock price ought to"
    },
    {
      "start": 215.92,
      "duration": 7.92,
      "text": "have performed quite well, right? Wrong. This is \nrather surprising. Stock price is down 86%. Now,"
    },
    {
      "start": 223.84,
      "duration": 6.96,
      "text": "for whatever reason, I've seen this same \nplaybook unfold for many foreign stocks"
    },
    {
      "start": 230.8,
      "duration": 6.32,
      "text": "over the years. I don't know why. So, it's this \ninitial extreme overvaluation of the company and"
    },
    {
      "start": 237.12,
      "duration": 6.4,
      "text": "their thesis followed by a long period of time \nwhere presumably the share price comes back down"
    },
    {
      "start": 243.52,
      "duration": 6.72,
      "text": "to reality. And what we can do here is calculate \na price-to-sales ratio. That's a basic method of"
    },
    {
      "start": 250.24,
      "duration": 5.44,
      "text": "looking at valuation. And in our case, we use \nwhat's called a simple valuation ratio. That's"
    },
    {
      "start": 255.68,
      "duration": 5.44,
      "text": "just market cap divided by annualized revenues. \nNow, we're going to use trailing 12-month revenues"
    },
    {
      "start": 261.12,
      "duration": 5.12,
      "text": "for all these calculations in this presentation \nbecause for most these firms, quarterly revenues"
    },
    {
      "start": 266.24,
      "duration": 5.2,
      "text": "are sporadic. So, we've done that. Here you \nget a simple valuation ratio. So, basically,"
    },
    {
      "start": 271.44,
      "duration": 6.24,
      "text": "price- to-sales of around five. That's around our \ncatalog average. That's what you'd expect. So,"
    },
    {
      "start": 277.68,
      "duration": 5.04,
      "text": "the valuation has sort of reverted to the \nmean over time. Fundamentals have improved"
    },
    {
      "start": 282.72,
      "duration": 5.44,
      "text": "while share price has sunk. And when you start \nlooking at what you're getting exposure to here,"
    },
    {
      "start": 288.16,
      "duration": 6.64,
      "text": "projects, so that you see there, dominates their \nrevenues. We don't like project-based companies,"
    },
    {
      "start": 294.8,
      "duration": 5.6,
      "text": "right? We want to see other things here. Services \nand royalty fees. These are sustainable over time."
    },
    {
      "start": 300.4,
      "duration": 5.44,
      "text": "So, this is a company that's too small to be on \nour radar despite the fact that they seem to have"
    },
    {
      "start": 305.84,
      "duration": 6.4,
      "text": "a growing business that relates to fuel cells. \nThe other Nordic stock on our list here, NEL ASA,"
    },
    {
      "start": 312.24,
      "duration": 7.76,
      "text": "they have growing revenues, $422 million market \ncap, $99 million and trailing 12 months revenues."
    },
    {
      "start": 320.0,
      "duration": 5.2,
      "text": "And that gives them a simple valuation ratio \nof around four. So, about the same as the other"
    },
    {
      "start": 325.2,
      "duration": 7.76,
      "text": "stock, right? Since shares have dropped 90% over \nthe past 5 years, if there was ever a time to look"
    },
    {
      "start": 332.96,
      "duration": 5.44,
      "text": "at these two Nordic fuel cell stocks, it would be \nnow. That's not just because these share prices"
    },
    {
      "start": 338.4,
      "duration": 5.12,
      "text": "have plummeted. It's because their fundamentals \nare showing some strength. And when we try to"
    },
    {
      "start": 343.52,
      "duration": 7.36,
      "text": "explain the decrease in share price value over the \npast 5 years, what we can do is pull up the Global"
    },
    {
      "start": 350.88,
      "duration": 6.08,
      "text": "X Hydrogen ETF, HYDR, and we can take a look at \nwhat that's done. That's our benchmark. Look,"
    },
    {
      "start": 356.96,
      "duration": 7.36,
      "text": "it's down 70%. Now, that explains it. So, the \nentire fuel cell thesis has been on a decline"
    },
    {
      "start": 364.32,
      "duration": 6.72,
      "text": "for the last 5 years. And we may be moving into \na different era where fuel cells are no longer a"
    },
    {
      "start": 371.04,
      "duration": 4.96,
      "text": "solution looking for a problem. There's a problem \nthat fuel cells can solve, potentially. And that's"
    },
    {
      "start": 376.0,
      "duration": 6.32,
      "text": "the AI energy crisis. And investors seem to be \nfiguring that out to a certain extent. Here you"
    },
    {
      "start": 382.32,
      "duration": 5.68,
      "text": "can see volume has increased significantly. You \nsee this spike in volume over the past several"
    },
    {
      "start": 388.0,
      "duration": 6.24,
      "text": "months. So investors may be thinking the same \nthing as Goldman Sachs, which is that fuel cells"
    },
    {
      "start": 394.24,
      "duration": 7.2,
      "text": "will be able to solve potentially a lot of the \nshort-term problems with energy supply that the AI"
    },
    {
      "start": 401.44,
      "duration": 6.08,
      "text": "industry is facing. So here's something that you \nreally want to pay attention to. Oftentimes, these"
    },
    {
      "start": 407.52,
      "duration": 5.84,
      "text": "hardware companies, especially in the green tech \nspace, tend to subsidize their products to get"
    },
    {
      "start": 413.36,
      "duration": 6.8,
      "text": "them off the ground. And you can only sustain this \nact for so long. So, a number of the larger fuel"
    },
    {
      "start": 420.16,
      "duration": 5.2,
      "text": "cell companies out there are not worth looking \nat until they sort this problem out. The biggest"
    },
    {
      "start": 425.36,
      "duration": 6.88,
      "text": "example that we've been pointing to for years as \nproblematic is Plug Power. Back in 2023, we looked"
    },
    {
      "start": 432.24,
      "duration": 5.12,
      "text": "at their inability to sell a product or service \nat a profit. That was the last time we looked"
    },
    {
      "start": 437.36,
      "duration": 5.44,
      "text": "at them. That was all expected to change in 2023 \nbecause of this green hydrogen they were going to"
    },
    {
      "start": 442.8,
      "duration": 5.2,
      "text": "produce internally. Well, it didn't. This company \nhas now been around for 26 years, and they're"
    },
    {
      "start": 448.0,
      "duration": 4.24,
      "text": "always on the cusp of a positive gross margin. And \nwhen you look at their fundamentals, they're worse"
    },
    {
      "start": 452.24,
      "duration": 4.96,
      "text": "than ever. They're not even close to approaching a \npositive gross margin. I don't know what this is,"
    },
    {
      "start": 457.2,
      "duration": 5.44,
      "text": "but it's not a sustainable business. It's nothing \nwe'd ever want to have anything to do with. And"
    },
    {
      "start": 462.64,
      "duration": 5.28,
      "text": "it's even more surprising to see that they're not \nalone. Another company subsidizing their products,"
    },
    {
      "start": 467.92,
      "duration": 6.4,
      "text": "Fuel Cell Energy, here, trading under the ticker \nFCEL. Negative gross profits across the board,"
    },
    {
      "start": 474.32,
      "duration": 7.44,
      "text": "no interest at all. And not surprisingly, their \nshare price is down 96% over the past five years."
    },
    {
      "start": 481.76,
      "duration": 5.2,
      "text": "No matter how hard the cheerleaders try to \nresuscitate it, they may see some temporary"
    },
    {
      "start": 486.96,
      "duration": 4.56,
      "text": "stock price appreciation. But if you do what we \ndo, which is focus on investing in companies,"
    },
    {
      "start": 491.52,
      "duration": 4.72,
      "text": "not stocks, then you're going to see that this \nisn't something that's worth looking at until"
    },
    {
      "start": 496.24,
      "duration": 5.92,
      "text": "they solve the gross margin problem. Remember, a \ndeclining share price doesn't equate to value when"
    },
    {
      "start": 502.16,
      "duration": 6.56,
      "text": "the fundamentals are absolute [ __ ] And also, in \nthis list of companies that can't seem to produce"
    },
    {
      "start": 508.72,
      "duration": 5.6,
      "text": "a product or service and sell it for more than it \ncosts to produce would be Ballard. There's nothing"
    },
    {
      "start": 514.32,
      "duration": 6.32,
      "text": "to see here. Also, a negative gross profit \nover time. Now, when it comes to the two UK"
    },
    {
      "start": 520.64,
      "duration": 5.28,
      "text": "stocks in our list, we also have ITM Power with \na negative gross margin. Nothing to see there."
    },
    {
      "start": 525.92,
      "duration": 6.8,
      "text": "However, there are a few companies out there worth \ninvestigating. One would be Ceres Power Holdings."
    },
    {
      "start": 532.72,
      "duration": 6.56,
      "text": "They have an $888 million market cap. So, \nthey're under our $1 billion threshold. However,"
    },
    {
      "start": 539.28,
      "duration": 4.8,
      "text": "what we see here are growing revenues over \ntime. So, these are in British pounds. So,"
    },
    {
      "start": 544.08,
      "duration": 6.8,
      "text": "multiply, what, by 1.3 or so. And we've done that. \nWe've translated British pounds into US dollars"
    },
    {
      "start": 550.88,
      "duration": 6.56,
      "text": "along the bottom here. $888 million market cap, \naround $60 million in trailing 12-month revenues,"
    },
    {
      "start": 557.44,
      "duration": 5.76,
      "text": "giving them an SVR of 15. So, you see, they're \nmore richly priced, and there's good reason for"
    },
    {
      "start": 563.2,
      "duration": 6.8,
      "text": "that. Take a look at their gross profit margins. \nWow. Right? So, they're approaching 80%. Now, of"
    },
    {
      "start": 570.0,
      "duration": 4.24,
      "text": "course, they've been a little volatile over time, \nbut in looking at their investor deck, they're"
    },
    {
      "start": 574.24,
      "duration": 5.76,
      "text": "claiming to have lots of upside for data centers. \nI would want to know where these strong gross"
    },
    {
      "start": 580.0,
      "duration": 5.36,
      "text": "margins are coming from. So there's certainly some \ndigging that could happen here for UK investors"
    },
    {
      "start": 585.36,
      "duration": 5.28,
      "text": "or any investor that's looking for some exposure \nthat would also give you exposure to the British"
    },
    {
      "start": 590.64,
      "duration": 6.08,
      "text": "pound. So that brings us to the two Korean stocks \nthat aren't in our catalog but made their way"
    },
    {
      "start": 596.72,
      "duration": 7.52,
      "text": "onto the Global X ETF. First is Doosan Fuel Cell \nCompany. This is a $ 1.9 billion firm with almost"
    },
    {
      "start": 604.24,
      "duration": 5.84,
      "text": "$400 million in trailing 12-month revenues, an SVR \nof five, right? So you see some consistency there"
    },
    {
      "start": 610.08,
      "duration": 6.8,
      "text": "across geographies in the same theme. But what's \nworth noting here is this dramatic drop in gross"
    },
    {
      "start": 616.88,
      "duration": 5.6,
      "text": "profit. So this is potentially a company that you \nmight want to dig into. And I think figuring out"
    },
    {
      "start": 622.48,
      "duration": 5.2,
      "text": "that gross margin anomaly is going to teach you a \nlot about their business. The other Korean stock"
    },
    {
      "start": 627.68,
      "duration": 6.64,
      "text": "here, Vina Tech, $327 million company, 50 million \nin revenues, SVR of six. Again, some consistency"
    },
    {
      "start": 634.32,
      "duration": 4.16,
      "text": "there in valuation. But, couple things to note \nhere. First of all, it's below our market cap"
    },
    {
      "start": 638.48,
      "duration": 5.36,
      "text": "threshold. They do have growing revenues, but you \nsee they're sort of sporadic. So, you'd want to"
    },
    {
      "start": 643.84,
      "duration": 5.68,
      "text": "understand their business and pay attention to the \nincrease in volatility that could be exacerbated"
    },
    {
      "start": 649.52,
      "duration": 5.6,
      "text": "by Korean retail investors right now. It just \nseems to be something you observe across all these"
    },
    {
      "start": 655.12,
      "duration": 5.52,
      "text": "names because of an increased interest in fuel \ncell stocks. However, that brings us to probably"
    },
    {
      "start": 660.64,
      "duration": 5.68,
      "text": "the most notable name in the list, perhaps the one \nthat's worth investigating in the most. That would"
    },
    {
      "start": 666.32,
      "duration": 4.8,
      "text": "be Bloom Energy. And you need to be very careful \nhere. This article in Fortune says it all. Bloom"
    },
    {
      "start": 671.12,
      "duration": 5.36,
      "text": "Energy stock is up a 1000% in a year because \nits fuel cells are solving AI's data center"
    },
    {
      "start": 676.48,
      "duration": 4.72,
      "text": "power problem. No, that's not why it's up. It's \nup because of hype. Intrinsic value doesn't change"
    },
    {
      "start": 681.2,
      "duration": 5.92,
      "text": "that quickly. So, it was significantly undervalued \nbefore, presumably, and now it's overvalued."
    },
    {
      "start": 687.12,
      "duration": 6.8,
      "text": "At least not as bad as we had thought. So, $28 \nbillion company, $1.8 billion in trailing 12-month"
    },
    {
      "start": 693.92,
      "duration": 5.76,
      "text": "revenues, and SVR 15. So three times that of the \nother stocks. But perhaps there's a good reason"
    },
    {
      "start": 699.68,
      "duration": 4.48,
      "text": "for that. And when you look at their margins, \nthat's very important. That's been a recurring"
    },
    {
      "start": 704.16,
      "duration": 4.32,
      "text": "theme throughout this presentation. See how they \nstarted out with negative gross margins and they"
    },
    {
      "start": 708.48,
      "duration": 4.88,
      "text": "moved into positive. So you would have also seen, \nI think Rocket Lab did that. And when Rocket Lab"
    },
    {
      "start": 713.36,
      "duration": 5.2,
      "text": "actually started to show positive gross margins, \nthat turned out to be the right time to invest in"
    },
    {
      "start": 718.56,
      "duration": 4.96,
      "text": "the stock. And here you can see, lately, they're \nhitting 30% gross margins. I suppose that's pretty"
    },
    {
      "start": 723.52,
      "duration": 5.28,
      "text": "good for a hardware platform. Certainly better \nthan negative gross margins, right? And their"
    },
    {
      "start": 728.8,
      "duration": 6.56,
      "text": "operating margin is starting to move above zero. \nSo there's certainly something to look at there in"
    },
    {
      "start": 735.36,
      "duration": 5.28,
      "text": "a future presentation we're going to do on Bloom \nEnergy. So when you have a thesis like fuel cells,"
    },
    {
      "start": 740.64,
      "duration": 5.44,
      "text": "you always want to start out with a universe of \nstocks, as we've done today. Anything below a"
    },
    {
      "start": 746.08,
      "duration": 4.56,
      "text": "sustained $1 billion market cap is not on our \nradar. You might want to have your own market"
    },
    {
      "start": 750.64,
      "duration": 5.6,
      "text": "cap cut-off. And negative gross margins are always \nshowstoppers. We always invest in leaders. These"
    },
    {
      "start": 756.24,
      "duration": 5.84,
      "text": "are usually the larger of the lot. And right now, \nour short list of all the stocks we've looked at"
    },
    {
      "start": 762.08,
      "duration": 5.36,
      "text": "today seem to be Doosan, which a lot of people are \nprobably not familiar with; Bloom Energy, which a"
    },
    {
      "start": 767.44,
      "duration": 5.36,
      "text": "lot of people are familiar with; and Ceres, which \nmight be worth a poke around for those that dabble"
    },
    {
      "start": 772.8,
      "duration": 6.16,
      "text": "in smaller stocks. So, fuel cell stocks do not \nappear to be hyped. Yet. But they may be. So,"
    },
    {
      "start": 778.96,
      "duration": 5.6,
      "text": "pay attention to that. And remember that hype is \nnever a good reason to invest in any thesis. Now,"
    },
    {
      "start": 784.56,
      "duration": 4.48,
      "text": "I know a lot of you are looking beyond \nsolutions for today's energy problems"
    },
    {
      "start": 789.04,
      "duration": 5.52,
      "text": "into how we solve tomorrow's energy problems, \nand that seems to be nuclear energy. Though,"
    },
    {
      "start": 794.56,
      "duration": 4.64,
      "text": "you really need to be careful about the hype. \nWe've got you covered in this recent piece"
    },
    {
      "start": 799.2,
      "duration": 6.08,
      "text": "that looks at some nuclear stocks that many \nDGens have been buying high and selling low."
    },
    {
      "start": 805.28,
      "duration": 6.08,
      "text": "Molasses make for a great tax write off. Yes, \nyes, they do. So, give this video on investing"
    },
    {
      "start": 811.36,
      "duration": 6.08,
      "text": "in nuclear stocks a watch next. Thanks so much \nfor taking the time to watch this video today."
    }
  ]
}