{
  "video_id": "MbhUcT9vXyo",
  "title": "Why Grayscale's $35B IPO Could Tank Your Portfolio in 2026",
  "channel": "Nanalyze",
  "published_at": "2025-11-22T15:00:49Z",
  "duration": "PT11M44S",
  "thumbnail": "https://i.ytimg.com/vi/MbhUcT9vXyo/hqdefault.jpg",
  "fetched_at": "2026-01-16T18:54:01.213745",
  "transcript": [
    {
      "start": 0.48,
      "duration": 4.8,
      "text": "The largest digital asset platform in the world \nis finally going public. We're not calling it"
    },
    {
      "start": 5.28,
      "duration": 4.64,
      "text": "crypto anymore or crapto. They're called \nDigital Assets. This company's the market"
    },
    {
      "start": 9.92,
      "duration": 4.64,
      "text": "leader in every key market they operate in \nand we really like leaders. The company's"
    },
    {
      "start": 14.56,
      "duration": 5.44,
      "text": "called Grayscale. However, there's some \nmajor problems with their IPO that half,"
    },
    {
      "start": 20.0,
      "duration": 4.56,
      "text": "okay, all degenerates don't see coming. \nAnd if you dabble in crypto funds,"
    },
    {
      "start": 24.56,
      "duration": 4.64,
      "text": "you're thinking about investing in some \ncrypto ETFs, then this video is a mustwatch."
    },
    {
      "start": 31.44,
      "duration": 6.08,
      "text": "How to analyze any IPO? Well, typically, \nIPOs represent growth companies, so they"
    },
    {
      "start": 37.52,
      "duration": 4.64,
      "text": "better have meaningful revenue growth. That's \nnot optional. We want to look at who their key"
    },
    {
      "start": 42.16,
      "duration": 5.84,
      "text": "competitors are. What leadership position do they \nhave? Maybe there are better options for similar"
    },
    {
      "start": 48.0,
      "duration": 6.08,
      "text": "exposure elsewhere. How big is the opportunity? \nWell, Grayscale says this is a $365 billion"
    },
    {
      "start": 54.08,
      "duration": 5.2,
      "text": "opportunity. That's certainly big enough. Most \nimportantly, how does a company make money? What"
    },
    {
      "start": 59.28,
      "duration": 7.84,
      "text": "would you say you do here? This tells us what \nexposure we're getting. This is something that"
    },
    {
      "start": 67.12,
      "duration": 5.52,
      "text": "professional investors focus heavily on while \na lot of retail investors don't. So, I like"
    },
    {
      "start": 72.64,
      "duration": 5.36,
      "text": "this market map that Grayscale put together. They \ncall it mapping the digital asset universe. Now,"
    },
    {
      "start": 78.0,
      "duration": 5.04,
      "text": "when you look at the top there, under currencies \nand smart contract platforms, I like how they"
    },
    {
      "start": 83.04,
      "duration": 7.04,
      "text": "differentiate Bitcoin and Ethereum by these terms, \nthat makes up 70% of the entire crypto market,"
    },
    {
      "start": 90.08,
      "duration": 4.08,
      "text": "those two coins. And I think you need to be \ncareful here, when you start talking about"
    },
    {
      "start": 94.16,
      "duration": 4.72,
      "text": "tokenization. So, let's say you start to tokenize \nassets. Well, you don't want a double count there,"
    },
    {
      "start": 98.88,
      "duration": 5.84,
      "text": "right? Just because you tokenized $5 billion \nin real estate doesn't mean that the value"
    },
    {
      "start": 104.72,
      "duration": 5.84,
      "text": "of the entire crypto universe went up by $5 \nbillion. And then under consumer and culture"
    },
    {
      "start": 110.56,
      "duration": 5.36,
      "text": "here you have what we call crapto, especially \nthis pumped-up fun platform. I recently saw a"
    },
    {
      "start": 115.92,
      "duration": 5.52,
      "text": "piece where somebody was bragging how it's never \nbeen easier to print money by doing rug poles on"
    },
    {
      "start": 121.44,
      "duration": 5.28,
      "text": "the platform. The fact that that sort of thing is \njust allowed seems ludicrous to me. But anyway,"
    },
    {
      "start": 126.72,
      "duration": 6.0,
      "text": "when we start scrolling down the Grayscale -S1, \nwe come quickly to this section. They talk about"
    },
    {
      "start": 132.72,
      "duration": 6.96,
      "text": "their products, ETPs and ETFs. So, basically, \nfunds. They have both passive and active around"
    },
    {
      "start": 139.68,
      "duration": 6.48,
      "text": "$34 billion worth. So we want to put that number \ninto perspective. It sounds a lot on paper,"
    },
    {
      "start": 146.16,
      "duration": 7.52,
      "text": "but it's only about 1% of the total $3.3 trillion \ncrypto market. And that market just so happens to"
    },
    {
      "start": 153.68,
      "duration": 7.52,
      "text": "be about 2.6% of the total equities market. So, \nGrayscale manages some ETFs, and here you can"
    },
    {
      "start": 161.2,
      "duration": 6.16,
      "text": "see they're actually pretty formidable. They're \nthe 22nd largest ETF provider. They're hanging"
    },
    {
      "start": 167.36,
      "duration": 6.0,
      "text": "around popular names like ProShares, Wisdom Tree, \nGlobal X. So, they've fared quite well in terms of"
    },
    {
      "start": 173.36,
      "duration": 5.84,
      "text": "the amount of assets they've attracted and they \nalso offer some private funds. So, when it comes"
    },
    {
      "start": 179.2,
      "duration": 7.68,
      "text": "down to it, they manage about $35 billion worth \nof digital assets. Now, at a 1% expense ratio,"
    },
    {
      "start": 186.88,
      "duration": 6.0,
      "text": "that means their revenues should be around $350 \nmillion. Well, when we look at revenues, we find"
    },
    {
      "start": 192.88,
      "duration": 5.2,
      "text": "something interesting here. They're actually a lot \nmore. But, first of all, this revenue decline from"
    },
    {
      "start": 198.08,
      "duration": 7.6,
      "text": "2023 to 2024 is quite concerning. We'd wonder if \nthey're exposed to some degen volatility there."
    },
    {
      "start": 205.68,
      "duration": 4.8,
      "text": "But what stands out immediately is that this \nis an extremely profitable business. So those"
    },
    {
      "start": 210.48,
      "duration": 4.08,
      "text": "numbers you see there that I've highlighted, those \naren't gross margins. Those would be attractive"
    },
    {
      "start": 214.56,
      "duration": 5.04,
      "text": "if they were. These are operating margins. So \nthis company's printing money. And I love this,"
    },
    {
      "start": 219.6,
      "duration": 5.92,
      "text": "the letter in their S-1 from the founder. He talks \nabout money printer go burr. And he's talking"
    },
    {
      "start": 225.52,
      "duration": 5.36,
      "text": "about the economy. We should be talking about \nhis platform. And whenever you have a situation"
    },
    {
      "start": 230.88,
      "duration": 5.52,
      "text": "where somebody's printing money, it attracts \ncompetitors like mad, sharks in a blue ocean. Now,"
    },
    {
      "start": 236.4,
      "duration": 4.72,
      "text": "when we keep scrolling through the S-1, we \ncome across perhaps the most pertinent piece"
    },
    {
      "start": 241.12,
      "duration": 5.2,
      "text": "of information that you'll find, which is the \nweighted average management fee. Remember that"
    },
    {
      "start": 246.32,
      "duration": 5.52,
      "text": "we speculated that if it was 1%, they'd be \nmaking $350 million. Well, it's actually a"
    },
    {
      "start": 251.84,
      "duration": 6.16,
      "text": "lot more than that. And you can see here in 2023, \nit was actually upwards of 2%. And most recently,"
    },
    {
      "start": 258.0,
      "duration": 5.12,
      "text": "in the first nine months of this year, it's \nfloated down to around 1.4%. And the first"
    },
    {
      "start": 263.12,
      "duration": 5.36,
      "text": "thing you'll note here is that this average fee \nhas declined significantly over the past several"
    },
    {
      "start": 268.48,
      "duration": 6.24,
      "text": "years. And if we just took their assets under \nmanagement, multiplied it by this average fee,"
    },
    {
      "start": 274.72,
      "duration": 4.56,
      "text": "then we can project what their revenues might \nbe. We can compare those to actuals. And look,"
    },
    {
      "start": 279.28,
      "duration": 5.04,
      "text": "it's spot-on. So this is a very easy business \nto follow, right? The assets under management"
    },
    {
      "start": 284.32,
      "duration": 5.52,
      "text": "multiplied by their expense ratio gives you their \nrevenues. And this is where things start to become"
    },
    {
      "start": 289.84,
      "duration": 6.08,
      "text": "problematic. So when we look at their assets under \nmanagement, 70% of those are found in two ETFs,"
    },
    {
      "start": 295.92,
      "duration": 7.52,
      "text": "the Grayscale Bitcoin Trust ETF and the Grayscale \nEthereum Trust ETF, 88% of their revenues come"
    },
    {
      "start": 303.44,
      "duration": 5.68,
      "text": "from these two ETFs. And what you need to remember \nhere is that the size of these ETFs is going to"
    },
    {
      "start": 309.12,
      "duration": 4.24,
      "text": "depend on two things. First, the price of the \nunderlying asset. So in this case, the price"
    },
    {
      "start": 313.36,
      "duration": 5.6,
      "text": "of Bitcoin and Ethereum, plus the inflows and \noutflows. So investors have been pulling money"
    },
    {
      "start": 318.96,
      "duration": 5.76,
      "text": "out of these ETFs presumably because their fees \nare atrocious. And when you look at outflows last"
    },
    {
      "start": 324.72,
      "duration": 6.48,
      "text": "year, they had $25 billion in outflows. That's \nnot good at all. Essentially, you're losing market"
    },
    {
      "start": 331.2,
      "duration": 5.92,
      "text": "share. In the first nine months of this year, they \nhad another $3.5 billion in outflows. This is very"
    },
    {
      "start": 337.12,
      "duration": 4.72,
      "text": "problematic. It's very concerning. And when you \nlook at the largest crypto ETFs out there, we've"
    },
    {
      "start": 341.84,
      "duration": 5.84,
      "text": "pulled up this list from Vetify. You can see where \nthese two ETFs sit. Oh, look at the top there."
    },
    {
      "start": 347.68,
      "duration": 6.8,
      "text": "iShares Bitcoin Trust. So, they're absolutely \ndominating this space. When Bitcoin ETFs first"
    },
    {
      "start": 354.48,
      "duration": 4.24,
      "text": "came out, we did an analysis on them and looked \nat all the players. ARK was in there. Well, now"
    },
    {
      "start": 358.72,
      "duration": 5.68,
      "text": "it looks like we indeed have a winner in iShares. \nThat's no surprise at all. BlackRock dominating,"
    },
    {
      "start": 364.4,
      "duration": 6.24,
      "text": "as usual. Now, when it comes to fund investing for \ndegenerates, the beginner level is \"muh portfolio"
    },
    {
      "start": 370.64,
      "duration": 5.84,
      "text": "needs this ETF cuz Tom Lee said I should invest in \nit.\" These people usually buy high and sell low."
    },
    {
      "start": 376.48,
      "duration": 5.6,
      "text": "Then there's the DGEN that eventually realizes \nthat the asset that they're holding ought to"
    },
    {
      "start": 382.08,
      "duration": 6.72,
      "text": "reflect the value of its contents. This idea of \nnet asset value. That's when a basic understanding"
    },
    {
      "start": 388.8,
      "duration": 6.96,
      "text": "of NAV happens. So, then, you'll see people make \nexcuses as to why a fund ought to trade above NAV."
    },
    {
      "start": 395.76,
      "duration": 5.12,
      "text": "It never should. If it does, then just go buy the \nunderlying asset. It's silly, right? That happens"
    },
    {
      "start": 400.88,
      "duration": 4.88,
      "text": "because of hype and because of idiots. {you just \nblowing from stupid town.} And then you need"
    },
    {
      "start": 405.76,
      "duration": 5.68,
      "text": "to start asking, well, how much are you paying \nthe owners of this vehicle to provide you this"
    },
    {
      "start": 411.44,
      "duration": 4.72,
      "text": "exposure? This is not really something DGens has \nstarted questioning yet. They haven't gotten that"
    },
    {
      "start": 416.16,
      "duration": 5.6,
      "text": "far, but institutions certainly are. And that's \nwhere we can pull up this same list of crypto"
    },
    {
      "start": 421.76,
      "duration": 6.48,
      "text": "ETFs and start looking at fees. Wow, is this \ntelling? So, look at how expensive the Grayscale"
    },
    {
      "start": 428.24,
      "duration": 4.32,
      "text": "offerings are compared to the competition. \nThis is a big problem. And they're not going"
    },
    {
      "start": 432.56,
      "duration": 5.12,
      "text": "to be able to sustain their AUM. They're going to \nkeep seeing outflows unless they drop their fees,"
    },
    {
      "start": 437.68,
      "duration": 5.28,
      "text": "which is going to impact revenues, which is why \nyou have essentially flatlined revenues. So,"
    },
    {
      "start": 442.96,
      "duration": 5.92,
      "text": "just to summarize here, Grayscale is printing \nmoney simply by managing money. Their fees,"
    },
    {
      "start": 448.88,
      "duration": 5.6,
      "text": "while declining over time significantly, are \nstill very, very expensive. Nothing's going"
    },
    {
      "start": 454.48,
      "duration": 5.6,
      "text": "to stop large ETF providers like BlackRock from \nundercutting them on price. They could even use"
    },
    {
      "start": 460.08,
      "duration": 5.84,
      "text": "these vehicles as loss leaders, frankly, to \nattract institutions. I would go so far as to"
    },
    {
      "start": 465.92,
      "duration": 7.36,
      "text": "say nothing justifies these expense ratio premiums \nthat we're seeing. I'd challenge people to put up"
    },
    {
      "start": 473.28,
      "duration": 5.92,
      "text": "some evidence otherwise. Why should investors be \npaying so much for these funds? They shouldn't."
    },
    {
      "start": 479.2,
      "duration": 5.2,
      "text": "But most importantly, the problem here is going \nback to our initial set of screening criteria"
    },
    {
      "start": 484.4,
      "duration": 6.4,
      "text": "for IPOs, their revenues appear to be flatlining. \nFrankly, even declining. So if you look at 2023,"
    },
    {
      "start": 490.8,
      "duration": 6.72,
      "text": "2024, and a 2025 estimate we've provided here \nbased on that $35 billion in AUM they claim"
    },
    {
      "start": 497.52,
      "duration": 6.24,
      "text": "against the 1.39% expense ratio, you see they're \ngoing to be declining this year as well. Now, if"
    },
    {
      "start": 503.76,
      "duration": 6.96,
      "text": "you go into their S-1, I like how they point out \nthe risks. They do a very good job of highlighting"
    },
    {
      "start": 510.72,
      "duration": 6.16,
      "text": "the many problems in the crypto space. They \ntalk about how, from 2021 to 2023, the entire"
    },
    {
      "start": 516.88,
      "duration": 7.68,
      "text": "value of crypto dropped 62%. They point to all the \nmajor crypto companies that ended up liquidating."
    },
    {
      "start": 524.56,
      "duration": 5.92,
      "text": "In some cases, fraud was involved. The amount of \nfraud in this space is just incredible to believe."
    },
    {
      "start": 530.48,
      "duration": 6.16,
      "text": "And then they talk about this recent cascade of \nforced liquidation. So approximately $20 billion"
    },
    {
      "start": 536.64,
      "duration": 6.16,
      "text": "in leveraged positions were liquidated following \na sudden drop in Bitcoin and Ethereum prices. And"
    },
    {
      "start": 542.8,
      "duration": 6.24,
      "text": "look, here's the sudden drop, a massive crash, \nright? So, if there's ever actually any real"
    },
    {
      "start": 549.04,
      "duration": 5.28,
      "text": "significant volatility in the crypto space, then \nI guess, then people are just absolutely toast"
    },
    {
      "start": 554.32,
      "duration": 4.88,
      "text": "because they're not managing risk appropriately \nin probably what is, if you can call it an asset"
    },
    {
      "start": 559.2,
      "duration": 5.76,
      "text": "class, one of the most riskiest asset classes \nI've ever seen. So, when it comes to people that"
    },
    {
      "start": 564.96,
      "duration": 6.16,
      "text": "are looking at this company, I don't know what \nwill happen to the stock once the IPO happens,"
    },
    {
      "start": 571.12,
      "duration": 7.36,
      "text": "but we can certainly take a poke at valuation. \nSo, let's use those predicted 2025 revenues of"
    },
    {
      "start": 578.48,
      "duration": 6.96,
      "text": "$487 million. What we can then do is start looking \nat various levels of price to sales and, sort of,"
    },
    {
      "start": 585.44,
      "duration": 5.52,
      "text": "predicting a market cap. Now, for those of you who \nfollow our own internal simple valuation ratio,"
    },
    {
      "start": 590.96,
      "duration": 4.16,
      "text": "which is market cap divided by annualized \nrevenues, price to sales isn't much different."
    },
    {
      "start": 595.12,
      "duration": 6.08,
      "text": "And since we don't have last quarter's revenues, \nwe can just use 2025 predicted at a price to sales"
    },
    {
      "start": 601.2,
      "duration": 5.28,
      "text": "of three. They'd have a $ 1.5 billion market \ncap. An average price to sales would probably"
    },
    {
      "start": 606.48,
      "duration": 5.04,
      "text": "be around seven. That gives them a market cap \nof 3.4 billion. You double that, you get to 6.8."
    },
    {
      "start": 611.52,
      "duration": 5.36,
      "text": "And anything above $10 billion would be too rich. \nWell, guess what? Industry analysts are projecting"
    },
    {
      "start": 616.88,
      "duration": 6.8,
      "text": "potential valuations of $30-33 billion. So, way \noverpriced. Now it's going to trade under the"
    },
    {
      "start": 623.68,
      "duration": 6.08,
      "text": "ticker GRAY for those of you that are interested. \nWe always get the lazy DGEN leaving the \"this aged"
    },
    {
      "start": 629.76,
      "duration": 5.84,
      "text": "well' comment. One of my insightful contributions \nto humanity. The reality is that nobody knows how"
    },
    {
      "start": 635.6,
      "duration": 5.2,
      "text": "this stock is going to react at IPO time. The \nfintwats are likely going to hype this up for"
    },
    {
      "start": 640.8,
      "duration": 5.04,
      "text": "no good reason. And what will end up happening \nis a lot of people decide to play musical chairs"
    },
    {
      "start": 645.84,
      "duration": 4.96,
      "text": "with this momentum stock if it turns out to be \none. And that's a very bad idea. You always want"
    },
    {
      "start": 650.8,
      "duration": 5.28,
      "text": "to focus on the company that you're investing in. \nThink about two things here. What exposure are you"
    },
    {
      "start": 656.08,
      "duration": 4.96,
      "text": "looking for when you invest in Grayscale? Let's \nassume digital assets cuz that's the exposure"
    },
    {
      "start": 661.04,
      "duration": 6.24,
      "text": "you're getting, right? Largely exposure to Bitcoin \nand Ethereum ETFs. Are there better ways to get"
    },
    {
      "start": 667.28,
      "duration": 5.68,
      "text": "that exposure? Yes, there are. You could just buy \nBitcoin and Ethereum, for one. But Coinbase might"
    },
    {
      "start": 672.96,
      "duration": 5.36,
      "text": "be a better pick-and-shovel play because they have \ndiversified revenue streams. Again, if you want"
    },
    {
      "start": 678.32,
      "duration": 6.88,
      "text": "exposure to the two mechanisms that dictate most \nthe success of Grayscale as it lives today, then"
    },
    {
      "start": 685.2,
      "duration": 5.6,
      "text": "invest in Bitcoin and Ethereum. Now, if you want \ngreater exposure to crypto as an asset class, we"
    },
    {
      "start": 690.8,
      "duration": 5.6,
      "text": "did this really cool piece that looks at how you \ncan build your own crypto ETF and not pay these"
    },
    {
      "start": 696.4,
      "duration": 5.92,
      "text": "extravagant fees. Give that a watch next. Thanks \nso much for taking the time to watch this today."
    }
  ]
}