{
  "video_id": "MK1jTI7lkMs",
  "title": "IonQ Stock in Freefall. Here's Why.",
  "channel": "Nanalyze",
  "published_at": "2025-11-29T15:00:41Z",
  "duration": "PT17M45S",
  "thumbnail": "https://i.ytimg.com/vi/MK1jTI7lkMs/hqdefault.jpg",
  "fetched_at": "2026-01-16T12:22:04.277409",
  "transcript": [
    {
      "start": 0.24,
      "duration": 5.44,
      "text": "When my favorite stock goes up, it's because \nof my Nostradamus-like investing acumen,"
    },
    {
      "start": 5.68,
      "duration": 6.16,
      "text": "when my favorite stock falls, it's the market's \nfault. Well, IonQ has been falling a lot lately,"
    },
    {
      "start": 11.84,
      "duration": 5.76,
      "text": "which has some investors asking why. The answer \nis quite simple. It's the market. I'm joking,"
    },
    {
      "start": 17.6,
      "duration": 5.2,
      "text": "of course. It's because the value of the business \ndoesn't match the current stock price. Today,"
    },
    {
      "start": 22.8,
      "duration": 4.8,
      "text": "we're going to look at everything Ionq has been up \nto. And throughout this, you'll learn a lot about"
    },
    {
      "start": 27.6,
      "duration": 11.04,
      "text": "investing in quantum computing. I'll also answer \none question that you all haven't stopped asking."
    },
    {
      "start": 38.64,
      "duration": 6.56,
      "text": "Why quantum computing? Well, quantum computers can \nsolve problems that classical computers can't. So,"
    },
    {
      "start": 45.2,
      "duration": 7.52,
      "text": "here's a simple example. Your typical UPS driver, \nthe UPS man, makes an average of 135 deliveries"
    },
    {
      "start": 52.72,
      "duration": 5.2,
      "text": "daily. The number of possible routes they could \ntake is so large that you'd have to describe"
    },
    {
      "start": 57.92,
      "duration": 6.96,
      "text": "it with 227 digits. It would take a classical \ncomputer longer than the age of the universe to"
    },
    {
      "start": 64.88,
      "duration": 5.6,
      "text": "calculate the true optimal route for a driver. \nWhat they call the traveling salesman problem."
    },
    {
      "start": 70.48,
      "duration": 6.32,
      "text": "UPS would need to do this for more than 66,000 \nroutes daily. So basically, a quantum computer"
    },
    {
      "start": 76.8,
      "duration": 4.32,
      "text": "could solve all those route problems and save \nthe company a lot of money. And of course,"
    },
    {
      "start": 81.12,
      "duration": 4.96,
      "text": "this space is only starting out. I'm going \nto refer to this report by McKinsey. It's an"
    },
    {
      "start": 86.08,
      "duration": 6.48,
      "text": "excellent one throughout today's presentation. And \nthis first slide shows how, in the current year,"
    },
    {
      "start": 92.56,
      "duration": 5.04,
      "text": "the total amount of revenue generated from quantum \ncomputing is going to be about a billion dollars."
    },
    {
      "start": 97.6,
      "duration": 7.04,
      "text": "So, let's say IonQ has $110 million this year in \nrevenues. What they're roughly expecting, well,"
    },
    {
      "start": 104.64,
      "duration": 5.76,
      "text": "that would give them about 11% market share. And \nthere are all these grandiose estimates of how"
    },
    {
      "start": 110.4,
      "duration": 5.28,
      "text": "much potential market share there is to capture. \nThey seem credible. Though quantum computing,"
    },
    {
      "start": 115.68,
      "duration": 5.84,
      "text": "to be fair, has always been 5 years away for as \nlong as I can remember. Now, we first looked at"
    },
    {
      "start": 121.52,
      "duration": 6.0,
      "text": "IonQ about four years ago. We had favorable things \nto say about the company. We found the founders to"
    },
    {
      "start": 127.52,
      "duration": 5.2,
      "text": "be quite accomplished. That usually means they'll \nbe able to attract the best talent in that space."
    },
    {
      "start": 132.72,
      "duration": 5.6,
      "text": "They expected to deliver a rack-mounted quantum \ncomputer by 2023. Talk of the world's most"
    },
    {
      "start": 138.32,
      "duration": 5.84,
      "text": "powerful quantum computer. And we said that \nwe only wanted to see progress in the form of"
    },
    {
      "start": 144.16,
      "duration": 5.52,
      "text": "revenue growth. Well, perhaps we spoke a bit too \nsoon because not all types of revenue growth are"
    },
    {
      "start": 149.68,
      "duration": 5.2,
      "text": "created equal. When we look at where the founders \nare today, they seem to have bailed for a career"
    },
    {
      "start": 154.88,
      "duration": 6.96,
      "text": "in Academia. And in February of this year, you \nsaw the CEO and CFO change. That's not good."
    },
    {
      "start": 161.84,
      "duration": 6.08,
      "text": "and the gentleman who stepped in as CEO at that \ntime is now the Chairman of the Board. And when"
    },
    {
      "start": 167.92,
      "duration": 4.96,
      "text": "you have a CEO who is also the chairman of \nthe board, that's a conflict of interest,"
    },
    {
      "start": 172.88,
      "duration": 5.76,
      "text": "it's frowned upon by those who assess governance \nin corporations. But there are really two"
    },
    {
      "start": 178.64,
      "duration": 5.76,
      "text": "interpretations to be had here. The first would be \nthat the old management team sucked, so they were"
    },
    {
      "start": 184.4,
      "duration": 5.84,
      "text": "shown the door. That's because they missed their \nspack deck target so badly. And of course, the new"
    },
    {
      "start": 190.24,
      "duration": 5.76,
      "text": "management team is going to make everything right. \nOr you might say that the founders bailed because"
    },
    {
      "start": 196.0,
      "duration": 5.44,
      "text": "they didn't see the promise in the company, at \nleast the core product offering that they were"
    },
    {
      "start": 201.44,
      "duration": 5.12,
      "text": "showcasing at the time they had their SPAC. And \nall this management churn that we see indicates"
    },
    {
      "start": 206.56,
      "duration": 5.92,
      "text": "a poorly company as typically is the case. Just \ntoday, actually, they lost their Chief Revenue"
    },
    {
      "start": 212.48,
      "duration": 5.76,
      "text": "Officer. Who knows why? So let's just move past \nthat and start looking at revenue growth. So, of"
    },
    {
      "start": 218.24,
      "duration": 6.8,
      "text": "course, their glossy spack deck made promises they \ncouldn't keep. They were expecting $237 million"
    },
    {
      "start": 225.04,
      "duration": 6.96,
      "text": "for this year. They're now expecting instead about \n$108 million at the midpoint of guidance. Now,"
    },
    {
      "start": 232.0,
      "duration": 5.6,
      "text": "this still represents very strong revenue growth. \nAnd we'd ask, well, where is that coming from? Is"
    },
    {
      "start": 237.6,
      "duration": 5.44,
      "text": "this revenue coming from their core platform, \nthe one that they showcased in their SPAC, or"
    },
    {
      "start": 243.04,
      "duration": 5.52,
      "text": "is it coming from a lot of acquisitions that the \ncompany has been making lately? Well, the answer,"
    },
    {
      "start": 248.56,
      "duration": 5.44,
      "text": "of course, is acquisitions during 2025. They made \nfive different acquisitions. And it's so apparent"
    },
    {
      "start": 254.0,
      "duration": 6.48,
      "text": "here in the balance sheet. Just look at the sharp \nincrease in intangible assets and goodwill. So"
    },
    {
      "start": 260.48,
      "duration": 5.6,
      "text": "basically, goodwill is when you go to acquire a \ncompany and you can't account for all the money"
    },
    {
      "start": 266.08,
      "duration": 3.6,
      "text": "that you're paying for what you're receiving. \nSo you simply put that in a bucket and say, \"Oh,"
    },
    {
      "start": 269.68,
      "duration": 5.28,
      "text": "that's goodwill.\" That's future value. We're going \nto realize later because this is such a great"
    },
    {
      "start": 274.96,
      "duration": 6.24,
      "text": "acquisition. What it typically means is that you \noverpaid. Now, they're going to argue that they"
    },
    {
      "start": 281.2,
      "duration": 5.76,
      "text": "overpaid for good reason. And the explanation \nfor that comes from this diagram that McKinsey"
    },
    {
      "start": 286.96,
      "duration": 5.28,
      "text": "put forth that shows how Quantum technology is \nreally three major components. You have Quantum"
    },
    {
      "start": 292.24,
      "duration": 4.72,
      "text": "Computing, what we're all familiar with. Then you \nhave Quantum Communication and Quantum Sensing."
    },
    {
      "start": 296.96,
      "duration": 5.44,
      "text": "And when you move to IonQ's slide in their \nrecent investor deck, you see here they describe"
    },
    {
      "start": 302.4,
      "duration": 5.52,
      "text": "themselves as the only quantum platform company \nin the world. And they're touching on all these"
    },
    {
      "start": 307.92,
      "duration": 5.2,
      "text": "areas, right? And that sort of makes sense when \nyou look at who they acquired. So they acquired"
    },
    {
      "start": 313.12,
      "duration": 5.68,
      "text": "a company called ID Quantique. We covered them \nI think it was six years ago and looked at their"
    },
    {
      "start": 318.8,
      "duration": 6.08,
      "text": "hardware and they dabbled in Quantum Security \nand Quantum Communication Services. So it would"
    },
    {
      "start": 324.88,
      "duration": 4.8,
      "text": "make sense that IonQ would acquire them to fill \nthose gaps in their offering. And here you can"
    },
    {
      "start": 329.68,
      "duration": 6.24,
      "text": "see a list of the acquisitions that were made in \n2025. It appears to be six different names. And"
    },
    {
      "start": 335.92,
      "duration": 4.8,
      "text": "I wanted to focus on three of these. So we talked \nabout ID Quantique. You can check our past piece"
    },
    {
      "start": 340.72,
      "duration": 6.0,
      "text": "to learn more about what they do. Then we have \nOxford Ionics. So they're dabbling in trapped"
    },
    {
      "start": 346.72,
      "duration": 5.6,
      "text": "ion technology, which is what ion dabbles in. \nAnd, of course, the easy-to-understand thesis"
    },
    {
      "start": 352.32,
      "duration": 5.2,
      "text": "would be that they've simply acquired a competitor \nso they can accelerate their development efforts."
    },
    {
      "start": 357.52,
      "duration": 4.4,
      "text": "And that's particularly important because they \nhave a very formidable competitor. We're going"
    },
    {
      "start": 361.92,
      "duration": 4.48,
      "text": "to talk about a little bit later. And then there \nwas the acquisition that I really had to take a"
    },
    {
      "start": 366.4,
      "duration": 5.44,
      "text": "second look at because it didn't really seem \nto make sense. So Capella Space and, of course,"
    },
    {
      "start": 371.84,
      "duration": 5.12,
      "text": "the story is that Capella's technology will \nbe used as a basis for their Quantum Space"
    },
    {
      "start": 376.96,
      "duration": 5.28,
      "text": "hardware. They're ultimately going to sell to \nother satcom firms, right? And their executive"
    },
    {
      "start": 382.24,
      "duration": 4.88,
      "text": "chairman at the time makes this statement. He \nsays, \"Capella has an application today which"
    },
    {
      "start": 387.12,
      "duration": 4.72,
      "text": "is revenue generating.\" Yeah, it's generating \nrevenues, but these aren't quantum revenues."
    },
    {
      "start": 391.84,
      "duration": 5.44,
      "text": "their plan for turning this into a quantum play \ncomes down the road. He goes on to talk about a"
    },
    {
      "start": 397.28,
      "duration": 5.04,
      "text": "platform with bulletproof space heritage. Yeah, \nremember that. So, I guess the question here is"
    },
    {
      "start": 402.32,
      "duration": 5.84,
      "text": "how much revenue are we talking about? Because if \nit's a lot, then the pure playness, if you will,"
    },
    {
      "start": 408.16,
      "duration": 6.56,
      "text": "of IonQ just dropped meaningfully. And we can turn \nto this firm called LatkaAI. They talk about how"
    },
    {
      "start": 414.72,
      "duration": 8.64,
      "text": "Capella Space hit $74 million in revenue in \n2023. Well, that would be roughly 70% of the"
    },
    {
      "start": 423.36,
      "duration": 7.6,
      "text": "revenues that IonQ is guiding for this year. But, \nof course, that number was back in 2023. And when"
    },
    {
      "start": 430.96,
      "duration": 6.16,
      "text": "you look at this comment made in an earnings call \nby IonQ, they talk about how they're now going to"
    },
    {
      "start": 437.12,
      "duration": 5.2,
      "text": "own and operate a proliferated constellation \nof low Earth orbit satellites that they plan"
    },
    {
      "start": 442.32,
      "duration": 5.36,
      "text": "to outfit with quantum stuff. Well, when you \ncontinue reading this article by Payload,"
    },
    {
      "start": 447.68,
      "duration": 6.24,
      "text": "it's rather telling. So, in 2023, the same year \nthey had the supposed $73 million in revenues,"
    },
    {
      "start": 453.92,
      "duration": 5.76,
      "text": "the company suffered propulsion problems that \nled its satellites to decay faster than expected."
    },
    {
      "start": 459.68,
      "duration": 5.84,
      "text": "Apparently, the founding CEO stepped down that \nfall. And in this story, they talk about how the"
    },
    {
      "start": 465.52,
      "duration": 6.72,
      "text": "number of Capella spacecraft in orbit right now \nwould be four following two deorbits in March and"
    },
    {
      "start": 472.24,
      "duration": 6.4,
      "text": "May of 2025. So, there's a really good question \nto ask here. What has IonQ actually purchased? If"
    },
    {
      "start": 478.64,
      "duration": 6.64,
      "text": "they purchased $73 million in revenues, they just \ndiluted their quantum exposure a lot. They're now"
    },
    {
      "start": 485.28,
      "duration": 4.72,
      "text": "dabbling in something very different from the \nquantum work, the core quantum work that we"
    },
    {
      "start": 490.0,
      "duration": 5.52,
      "text": "all signed up for in that SPAC deck. And if they \ndidn't, if the revenues fell dramatically because"
    },
    {
      "start": 495.52,
      "duration": 4.88,
      "text": "half the satellites fell out of the sky, we're \nfalling right out of the sky. Then it sounds like"
    },
    {
      "start": 500.4,
      "duration": 5.52,
      "text": "they purchased a failed business. Which is it? \nThis just sounds like a typical SPAC playbook,"
    },
    {
      "start": 505.92,
      "duration": 4.56,
      "text": "right? You raise a bunch of money by making \ngrandiose promises that you realize you can't"
    },
    {
      "start": 510.48,
      "duration": 5.12,
      "text": "keep. Then you take your cash windfall and start \nbuying companies with it. You're bolting on that"
    },
    {
      "start": 515.6,
      "duration": 6.16,
      "text": "revenue growth. And exactly what sort of bargains \nare you hoping to acquire when you're operating"
    },
    {
      "start": 521.76,
      "duration": 5.2,
      "text": "during a time when there's a lot of quantum hype. \nInvestors who are selling their quantum companies"
    },
    {
      "start": 526.96,
      "duration": 4.8,
      "text": "are going to want a premium, which is why we see \nsuch a large goodwill balance on their balance"
    },
    {
      "start": 531.76,
      "duration": 6.32,
      "text": "sheet. Rarely does this strategy work out as \nplanned. And for those of you that think it will,"
    },
    {
      "start": 538.08,
      "duration": 5.6,
      "text": "you're going to pay a pretty price to participate. \nSo, before I start talking about valuation,"
    },
    {
      "start": 543.68,
      "duration": 4.88,
      "text": "I wanted to address a question that we've been \ngetting a lot lately about the elephant in the"
    },
    {
      "start": 548.56,
      "duration": 5.2,
      "text": "room. Why have I been shooting videos from an \nancient temple in the Japanese mountains? Okay,"
    },
    {
      "start": 553.76,
      "duration": 5.36,
      "text": "nobody asked. I just wanted to talk about it. So, \nas you might know, our Romanian fortune teller"
    },
    {
      "start": 559.12,
      "duration": 6.0,
      "text": "recently submitted her resignation letter, which \nmeans we're scrambling to find alternative sources"
    },
    {
      "start": 565.12,
      "duration": 6.4,
      "text": "of alpha. One possible source, you guessed \nit, Buddhism. And the population of Japan is"
    },
    {
      "start": 571.52,
      "duration": 8.0,
      "text": "declining. So, you get more karma for your dollar. \nSo, I'd like to extend a big Arigato Gozaimas to"
    },
    {
      "start": 579.52,
      "duration": 5.6,
      "text": "every premium subscriber who recently participated \nin our customer focus survey. We're going to be"
    },
    {
      "start": 585.12,
      "duration": 5.6,
      "text": "debuting a very cool enhancement soon, so stay \ntuned for that. Anywho, back to talking about"
    },
    {
      "start": 590.72,
      "duration": 5.52,
      "text": "IonQ. So, when we look at the current valuation \nof this company, it's somewhere around $15"
    },
    {
      "start": 596.24,
      "duration": 7.12,
      "text": "billion. We can then use a price-to-sales ratio \nbecause these companies don't have profit. So,"
    },
    {
      "start": 603.36,
      "duration": 5.52,
      "text": "you can't use your typical price-to-earnings \nratio, right? So, we have expected sales for 2025"
    },
    {
      "start": 608.88,
      "duration": 7.28,
      "text": "of $108 million and we'll just use that number, \nand we get a value of 137. So we need something"
    },
    {
      "start": 616.16,
      "duration": 5.04,
      "text": "to benchmark that against. I've pulled up our \ntech stock catalog here and I simply filtered"
    },
    {
      "start": 621.2,
      "duration": 5.52,
      "text": "on the companies with the highest what we call \nsimple valuation ratio. So we take market cap and"
    },
    {
      "start": 626.72,
      "duration": 5.6,
      "text": "divide it by annualized revenues, not forecasted \nrevenues. And here you can see that, what we call,"
    },
    {
      "start": 632.32,
      "duration": 5.84,
      "text": "the simple valuation ratio or SVR. You can see \nthat calculated along with their average over"
    },
    {
      "start": 638.16,
      "duration": 4.24,
      "text": "the past year. And then we have a premium or a \ndiscount. Kind of cool, right? So you can see well"
    },
    {
      "start": 642.4,
      "duration": 5.6,
      "text": "Robinhood has just gone through the roof in terms \nof their valuation. Same thing for Rocket Lab and,"
    },
    {
      "start": 648.0,
      "duration": 5.44,
      "text": "of course, Palantir. Now, if you took the average \nof all the companies that we calculate this for,"
    },
    {
      "start": 653.44,
      "duration": 4.96,
      "text": "it's somewhere around 7.5. Our cutoff is \nthree times that. So let's say around 22. We"
    },
    {
      "start": 658.4,
      "duration": 4.8,
      "text": "just don't buy companies that are richer than \nthat. And compared to these other companies,"
    },
    {
      "start": 663.2,
      "duration": 3.84,
      "text": "IonQ is extremely overvalued. So what \nyou can then do, this is rather fun,"
    },
    {
      "start": 667.04,
      "duration": 6.72,
      "text": "is you can back out the share price based on what \nsorts of valuations it ought to trade at. So let's"
    },
    {
      "start": 673.76,
      "duration": 5.6,
      "text": "say it traded at the same valuation Palantir did, \nwell that would be about $31 a share. If it traded"
    },
    {
      "start": 679.36,
      "duration": 6.24,
      "text": "at the same valuation as Rocket Lab, that would \nbe $14 a share. And if it traded at our cutoff,"
    },
    {
      "start": 685.6,
      "duration": 8.56,
      "text": "roughly around 22, that would be just under $7 \na share. So this firm is extremely overvalued"
    },
    {
      "start": 694.16,
      "duration": 5.84,
      "text": "and even IonQ agrees. You go back to their SPAC \ndeck, when they're talking about valuation here,"
    },
    {
      "start": 700.0,
      "duration": 6.56,
      "text": "they use a 10 times to 15 times revenue multiple. \nThey knew not to use a 100 times revenue multiple"
    },
    {
      "start": 706.56,
      "duration": 6.56,
      "text": "because even Joe Retail, well maybe not DGen Joe \nRetail, but even a retail investor with a small"
    },
    {
      "start": 713.12,
      "duration": 5.12,
      "text": "amount of investing acumen would realize that's \nabsolutely ridiculous. And here you can see their"
    },
    {
      "start": 718.24,
      "duration": 6.16,
      "text": "ridiculous valuation over time. We've plotted this \nover about a year and a half. You can see how it"
    },
    {
      "start": 724.4,
      "duration": 5.6,
      "text": "went from floating around the 30s to, sort of, \ngetting up there close to 200. But right now it's,"
    },
    {
      "start": 730.0,
      "duration": 6.96,
      "text": "as I said, floating around the mid-130s mark. \nSo what we usually say to investors is if you're"
    },
    {
      "start": 736.96,
      "duration": 4.08,
      "text": "going to set a valuation target, you should always \nhave one. If you're dabbling in the volatile world"
    },
    {
      "start": 741.04,
      "duration": 4.88,
      "text": "of tech stocks, what you can do is take the last \nfour values, average them, and set that as your"
    },
    {
      "start": 745.92,
      "duration": 4.72,
      "text": "target. Well, that's not going to work so well \nhere, right? Because this is persistently traded"
    },
    {
      "start": 750.64,
      "duration": 5.12,
      "text": "at such a rich valuation for such a long period \nof time. Two things will happen. Fundamentals"
    },
    {
      "start": 755.76,
      "duration": 5.36,
      "text": "will catch up or the valuation will revert to the \nmean. This isn't controversial. This is simply"
    },
    {
      "start": 761.12,
      "duration": 5.36,
      "text": "how markets work. You have to be careful about a \nlot of the flowery language they use. Of course,"
    },
    {
      "start": 766.48,
      "duration": 3.92,
      "text": "here they're talking about delivering the \nworld's most powerful quantum computer. I"
    },
    {
      "start": 770.4,
      "duration": 5.44,
      "text": "thought they already had that. Maybe it's this \nspecial one with 2 million cubits by 2030. Folks,"
    },
    {
      "start": 775.84,
      "duration": 4.48,
      "text": "it's always five years away, right? Well, maybe \nthis time it's different. Could very well be,"
    },
    {
      "start": 780.32,
      "duration": 5.2,
      "text": "with all the money being poured into quantum \ncomputing. But one expert I spoke with said"
    },
    {
      "start": 785.52,
      "duration": 6.08,
      "text": "that when companies start talking about cubits, \nthat's like a car being advertised with a price"
    },
    {
      "start": 791.6,
      "duration": 5.6,
      "text": "tag where you can't see what the mileage is, \nright? So without key additional information,"
    },
    {
      "start": 797.2,
      "duration": 5.36,
      "text": "that means next to nothing. I think Joe Retail \nhas a tendency to think that quantum computing"
    },
    {
      "start": 802.56,
      "duration": 5.6,
      "text": "is simply the four stonks that he sees shooting \nto the moon every day. But you see here IBM's"
    },
    {
      "start": 808.16,
      "duration": 6.0,
      "text": "press release this past summer. They expect to \ndebut the first largecale fault tolerant. That's"
    },
    {
      "start": 814.16,
      "duration": 4.56,
      "text": "very important for anybody that understands the \nproblems that they're facing in this space. The"
    },
    {
      "start": 818.72,
      "duration": 6.08,
      "text": "first fault-tolerant quantum computer. It's \nprojected to run 20,000 times more operations"
    },
    {
      "start": 824.8,
      "duration": 4.88,
      "text": "than today's quantum computers. The one thing \nnoticeable here is the approach they're taking"
    },
    {
      "start": 829.68,
      "duration": 4.96,
      "text": "where they use logical cubits which are built \non top of physical cubits, and that's supposed"
    },
    {
      "start": 834.64,
      "duration": 4.96,
      "text": "to solve the error correction problems. And you \nsee other firms are taking this approach as well,"
    },
    {
      "start": 839.6,
      "duration": 4.88,
      "text": "from the McKinsey report. Some of the world's \nbiggest tech companies are dabbling here. You've"
    },
    {
      "start": 844.48,
      "duration": 5.84,
      "text": "got Google, Amazon, Microsoft, right? IBM. And \nthis next slide is very nice. It breaks down"
    },
    {
      "start": 850.32,
      "duration": 4.56,
      "text": "the approaches taken by various companies. And \nlook here to the right. You have trapped ions."
    },
    {
      "start": 854.88,
      "duration": 6.16,
      "text": "There's IonQ. There's another company called AQT. \nI think they're out of Switzerland and Continuum."
    },
    {
      "start": 861.04,
      "duration": 5.68,
      "text": "So that's the Honeywell spin-off. That's one you \nshould really be watching closely. And then you"
    },
    {
      "start": 866.72,
      "duration": 5.68,
      "text": "go over here through the left and then you can see \nthe other various approaches being taken. But when"
    },
    {
      "start": 872.4,
      "duration": 5.28,
      "text": "you look at funding, and there's a lot of it going \ninto quantum startups. And this chart, of course,"
    },
    {
      "start": 877.68,
      "duration": 6.56,
      "text": "taken from the McKinsey report needs to be updated \nwith this little factoid. So, Continuum has now a"
    },
    {
      "start": 884.24,
      "duration": 6.72,
      "text": "valuation of $10 billion following a $600 million \nraise they did just several months ago. That"
    },
    {
      "start": 890.96,
      "duration": 6.48,
      "text": "doubled their valuation from the $5 billion it \nwas earlier last year. And, of course, NVIDIA's"
    },
    {
      "start": 897.44,
      "duration": 4.4,
      "text": "invested. Well, what isn't NVIDIA invested in? \nDoesn't mean a whole lot, right? They have so much"
    },
    {
      "start": 901.84,
      "duration": 4.48,
      "text": "cash. But some of these other names are notable. \nOf course, Honeywell, you have JP Morgan, Chase,"
    },
    {
      "start": 906.32,
      "duration": 6.72,
      "text": "and Mitsui. So it's likely that these investors \nsee something very promising with Continuum which"
    },
    {
      "start": 913.04,
      "duration": 7.04,
      "text": "is a direct competitor to IonQ. So let's sort \nof ignore statements that IonQ says here. I"
    },
    {
      "start": 920.08,
      "duration": 5.52,
      "text": "noted one in particular. \"We can confidently state \nthat in almost every case beyond IonQ, it's just"
    },
    {
      "start": 925.6,
      "duration": 5.52,
      "text": "a branding attempt.\" Really? So all 270 quantum \ncomputing startups out there, they're all branding"
    },
    {
      "start": 931.12,
      "duration": 4.64,
      "text": "attempts, right? None of them are doing anything \nlegitimate? Certainly, it's a red flag when you"
    },
    {
      "start": 935.76,
      "duration": 7.2,
      "text": "have C-suite types saying ridiculous things, and \nIonQ seems to be saying no shortage of ridiculous"
    },
    {
      "start": 942.96,
      "duration": 6.08,
      "text": "things. Though, of course, the bull thesis that \nthey're proposing, right, is compelling on paper,"
    },
    {
      "start": 949.04,
      "duration": 5.76,
      "text": "and they now have a whole bunch of cash. So this \nyear they raised, I guess, $3 billion. They have"
    },
    {
      "start": 954.8,
      "duration": 5.12,
      "text": "$3.5 billion in their balance sheet now. And when \nthey talk about what they're going to use it for"
    },
    {
      "start": 959.92,
      "duration": 4.32,
      "text": "now, they talk about investing in R&D. Well, \nthey've spent an awful lot of money on R&D. I"
    },
    {
      "start": 964.24,
      "duration": 4.64,
      "text": "think $200 million for the first 9 months of this \nyear. What exactly are they building if they're"
    },
    {
      "start": 968.88,
      "duration": 4.08,
      "text": "having to acquire everything? Let's say, well, \nwe're integrating everything together. Okay. So,"
    },
    {
      "start": 972.96,
      "duration": 5.04,
      "text": "once you get done with all these purchases, what's \nthe growth rate going to look like then? That's"
    },
    {
      "start": 978.0,
      "duration": 4.56,
      "text": "very key piece of information. Well, what might \nhappen here is they're going to take this $3.5"
    },
    {
      "start": 982.56,
      "duration": 5.2,
      "text": "billion and they're just going to keep acquiring, \nright? It's not necessarily a good thing at all."
    },
    {
      "start": 987.76,
      "duration": 6.64,
      "text": "So nearly every response that's going to be \ncritical of our analysis will have some sort of"
    },
    {
      "start": 994.4,
      "duration": 5.76,
      "text": "FOMO variation to it. This time it's different in \nreference to the valuation. No, it's not. There is"
    },
    {
      "start": 1000.16,
      "duration": 8.16,
      "text": "no rush at all here. And I like this table here. \nSo what do Space Nuclear and Quantum Computing"
    },
    {
      "start": 1008.32,
      "duration": 6.08,
      "text": "stocks have in common? Well, the answer is DGEN. \nSo all of the stocks that you see here on this"
    },
    {
      "start": 1014.4,
      "duration": 6.64,
      "text": "list are overvalued and being hyped very heavily. \nAnd look how they move in unison. There almost"
    },
    {
      "start": 1021.04,
      "duration": 5.84,
      "text": "seems to be a sort of correlation happening here. \nAnd that correlation, of course, is DGEN behavior."
    },
    {
      "start": 1026.88,
      "duration": 5.84,
      "text": "Be very careful out there. So we're going to check \nback in a year to see if the valuation is more"
    },
    {
      "start": 1032.72,
      "duration": 5.84,
      "text": "reasonable and if these acquisitions have stopped. \nSo then we can get an idea of what this collective"
    },
    {
      "start": 1038.56,
      "duration": 4.96,
      "text": "company looks like going forward and what sort of \nguidance they're giving on this new grand platform"
    },
    {
      "start": 1043.52,
      "duration": 4.8,
      "text": "that they've built. And in the meantime, other \ncompanies might see all this money being thrown"
    },
    {
      "start": 1048.32,
      "duration": 4.4,
      "text": "at publicly traded Quantum firms and want to get \nin on the action. And of course, that's happening."
    },
    {
      "start": 1052.72,
      "duration": 5.68,
      "text": "There's a new Quantum Computing IPO that's \ncoming. We analyzed that for you in this recent"
    },
    {
      "start": 1058.4,
      "duration": 5.04,
      "text": "piece. Give that a watch next. Thanks so much \nfor taking the time to watch this video today."
    }
  ]
}