{
  "video_id": "nruFwHNAeaE",
  "title": "A GREAT Health Care STOCK Nobody is Talking About!",
  "channel": "Nanalyze",
  "published_at": "2025-12-15T16:01:18Z",
  "duration": "PT14M29S",
  "thumbnail": "https://i.ytimg.com/vi/nruFwHNAeaE/hqdefault.jpg",
  "fetched_at": "2026-01-16T12:18:56.554464",
  "transcript": [
    {
      "start": 0.08,
      "duration": 4.8,
      "text": "The older you get, the more you care about \ninvesting in safe stocks. What do I mean by"
    },
    {
      "start": 4.88,
      "duration": 5.44,
      "text": "safe? In the words of Mr. Buffett himself, \nthese are stocks that you'd be comfortable"
    },
    {
      "start": 10.32,
      "duration": 5.92,
      "text": "holding if the stock market closed for the next 10 \nyears. Today's stock we don't ever plan to sell,"
    },
    {
      "start": 16.24,
      "duration": 5.12,
      "text": "and we likely will never have to because it's \nprobably one of the safest biotechs out there."
    },
    {
      "start": 21.36,
      "duration": 4.56,
      "text": "You want to know which one it is, don't you? You \nand your 7-second attention span. Well, if you"
    },
    {
      "start": 25.92,
      "duration": 4.96,
      "text": "click the like button on this video, the name of \nthe stock is going to pop up. Go ahead, click it."
    },
    {
      "start": 30.88,
      "duration": 5.2,
      "text": "There you go. It's Abbott Labs. And today, we're \ngoing to talk about three things. Why Abbott is"
    },
    {
      "start": 36.08,
      "duration": 6.8,
      "text": "so safe and what \"safe\" means. Abbott's position \nis the highest-ranked core dividend growth stock"
    },
    {
      "start": 42.88,
      "duration": 5.52,
      "text": "in our Quantigence universe. And the biggest issue \nwe have with a company, you always should be the"
    },
    {
      "start": 48.4,
      "duration": 4.8,
      "text": "most critical of firms that you're most bullish \nabout. So I remember getting asked this question"
    },
    {
      "start": 53.2,
      "duration": 5.2,
      "text": "in B school numerous times. The instructor would \nsay what's the highest priority for any business,"
    },
    {
      "start": 58.4,
      "duration": 4.08,
      "text": "and everybody would say profits or growth \nor returning money to shareholders. Well,"
    },
    {
      "start": 62.48,
      "duration": 6.4,
      "text": "the answer is simply this. The number one goal of \nany business is simply to survive. Now DGens who"
    },
    {
      "start": 68.88,
      "duration": 5.84,
      "text": "don't know this are simply helping along plenty \nof [ __ ] companies that shouldn't be surviving"
    },
    {
      "start": 74.72,
      "duration": 5.12,
      "text": "as long as they have. SPACs are a great example \nof this, and I think the jury is still out on some"
    },
    {
      "start": 79.84,
      "duration": 5.28,
      "text": "of those names. Just remember that a business \nwithout revenues is not a business. It's just"
    },
    {
      "start": 85.12,
      "duration": 6.4,
      "text": "an entity in survival mode, scrambling to raise \ncapital. So how does a business not survive? Well,"
    },
    {
      "start": 91.52,
      "duration": 5.92,
      "text": "it can go bankrupt, and usually that's a debt \nproblem. Some black swan event can befall the"
    },
    {
      "start": 97.44,
      "duration": 5.92,
      "text": "company and it can go into bankruptcy. Though debt \nis the vast majority of the reasons why companies"
    },
    {
      "start": 103.36,
      "duration": 5.2,
      "text": "go bankrupt. Or it can also dwindle into a \nformer shadow of itself and be acquired by"
    },
    {
      "start": 108.56,
      "duration": 6.64,
      "text": "another company. Basically, it runs out of options \nfor capital. Now, I asked ChatGPT to tell me about"
    },
    {
      "start": 115.2,
      "duration": 6.24,
      "text": "the industries that have the most bankruptcies \nas a proportion of the number of companies in"
    },
    {
      "start": 121.44,
      "duration": 5.12,
      "text": "the industry. And I think the answers here are \npretty obvious. You have retail, hospitality,"
    },
    {
      "start": 126.56,
      "duration": 5.76,
      "text": "construction. Basically, the industries you see \nhere listed, they won't have many or in some cases"
    },
    {
      "start": 132.32,
      "duration": 5.68,
      "text": "any dividend champions. And there are a number of \nreasons for that. I think you'd have to go into"
    },
    {
      "start": 138.0,
      "duration": 6.0,
      "text": "each industry to examine that. But maybe a better \nquestion to ask would be what industries have the"
    },
    {
      "start": 144.0,
      "duration": 5.2,
      "text": "least number of bankruptcies as a proportion of \nthe total numbers in each industry? That would be"
    },
    {
      "start": 149.2,
      "duration": 6.8,
      "text": "because they either have stable demand or are less \nsensitive to economic downturns, or both. And look"
    },
    {
      "start": 156.0,
      "duration": 5.2,
      "text": "what bubbles to the top of the list. It's health \ncare. And we've always said that if we had to pick"
    },
    {
      "start": 161.2,
      "duration": 5.36,
      "text": "one industry to invest in, we would always choose \nhealth care because it's not going away. People"
    },
    {
      "start": 166.56,
      "duration": 4.48,
      "text": "will always have money. Well, in some cases they \nwon't, but if they do have money, they'll spend"
    },
    {
      "start": 171.04,
      "duration": 6.0,
      "text": "it on their health as a priority. Now, one belief \nthat I used to hold was that conglomerates were,"
    },
    {
      "start": 177.04,
      "duration": 5.52,
      "text": "and perhaps they are, a great way to invest \nin a single company, if you could only invest"
    },
    {
      "start": 182.56,
      "duration": 4.72,
      "text": "in one company, because they enjoy internal \ndiversification. And there's an interesting"
    },
    {
      "start": 187.28,
      "duration": 4.56,
      "text": "statement you'll see thrown around. We always talk \nabout how there's no such thing as a free lunch."
    },
    {
      "start": 191.84,
      "duration": 5.52,
      "text": "And there is one exception to that, they say, \nwhich is diversification because it allows you"
    },
    {
      "start": 197.36,
      "duration": 7.12,
      "text": "to reduce portfolio risk and increase potential \nreturns without taking on additional risk. And you"
    },
    {
      "start": 204.48,
      "duration": 6.64,
      "text": "can read more into that philosophical statement. \nBut in the equities space, diversification across"
    },
    {
      "start": 211.12,
      "duration": 5.52,
      "text": "geography and industry and of course things like \nyour customer base, right? But broadly speaking,"
    },
    {
      "start": 216.64,
      "duration": 5.36,
      "text": "geography and industry are critically \nimportant. So if you must pick one stock,"
    },
    {
      "start": 222.0,
      "duration": 4.4,
      "text": "you'd want to see internal diversification. And \nof course, conglomerates have that, right? They're"
    },
    {
      "start": 226.4,
      "duration": 6.24,
      "text": "usually a collection of businesses across multiple \nindustries. However, there's some problems there."
    },
    {
      "start": 232.64,
      "duration": 4.64,
      "text": "Not the least being that you possibly won't \nhave a lot of synergies between businesses"
    },
    {
      "start": 237.28,
      "duration": 5.04,
      "text": "that operate in different industries. But some \nof the causes of the conglomerate discount,"
    },
    {
      "start": 242.32,
      "duration": 5.36,
      "text": "that is that conglomerates trade historically \nat a discount to what they should. And trying to"
    },
    {
      "start": 247.68,
      "duration": 5.44,
      "text": "explain why that is, I think ChatGPT does a good \njob of summarizing it. A conglomerate's management"
    },
    {
      "start": 253.12,
      "duration": 6.24,
      "text": "team probably lacks experience in all the \ndiverse fields it operates in. And consequently,"
    },
    {
      "start": 259.36,
      "duration": 4.32,
      "text": "since you have too many chefs in the kitchen, \nyou'll have challenges in terms of allocating"
    },
    {
      "start": 263.68,
      "duration": 4.56,
      "text": "capital and resources across these various \nbusinesses. And many investors would argue,"
    },
    {
      "start": 268.24,
      "duration": 6.16,
      "text": "well, why not just create your own collection of \ndiversified companies that are each pure play in"
    },
    {
      "start": 274.4,
      "duration": 5.6,
      "text": "various industries and have your own conglomerate \nexposure without the conglomerate discount. And"
    },
    {
      "start": 280.0,
      "duration": 3.84,
      "text": "that's a fair statement. And of course, I think \nthis holds true for any company. If you have"
    },
    {
      "start": 283.84,
      "duration": 5.52,
      "text": "several lower-performing divisions, this can \nimpact the overall market value of the company."
    },
    {
      "start": 289.36,
      "duration": 4.8,
      "text": "Now, when we look at the health care sector, we \nbreak it down by what's called the Global Industry"
    },
    {
      "start": 294.16,
      "duration": 5.04,
      "text": "Classification Standard or GICs. You can see here \nthere are quite a lot of categories. And if you"
    },
    {
      "start": 299.2,
      "duration": 6.16,
      "text": "were a health care company that was diversified \nacross these different classifications, that would"
    },
    {
      "start": 305.36,
      "duration": 5.52,
      "text": "be a great form of internal diversification. And, \nindeed, we see that with Abbott. This was taken"
    },
    {
      "start": 310.88,
      "duration": 6.64,
      "text": "from their 2024 investor report. And at the top \nhere you can see Diversity by Technology. I think"
    },
    {
      "start": 317.52,
      "duration": 5.6,
      "text": "Nutrition there perhaps might fall under consumer \nstaples. But then you have these other areas,:"
    },
    {
      "start": 323.12,
      "duration": 6.0,
      "text": "Medicines, Medical Devices, and Diagnostics. When \nit comes to geography, some great diversification,"
    },
    {
      "start": 329.12,
      "duration": 4.4,
      "text": "right? And I like their exposure to emerging \nmarkets and the fact that they call that out."
    },
    {
      "start": 333.52,
      "duration": 4.48,
      "text": "That's where all the population growth is going to \ncome from in the future, it seems. And they also"
    },
    {
      "start": 338.0,
      "duration": 5.2,
      "text": "talk about Diversity by Payer, which is important \nin the healthcare industry. And when you dig into"
    },
    {
      "start": 343.2,
      "duration": 6.08,
      "text": "that report, you're going to find this granular \ntable which describes each of these segments and"
    },
    {
      "start": 349.28,
      "duration": 4.8,
      "text": "subsegments. It's about the richest set of metrics \nyou're going to find for Abbott. Unfortunately,"
    },
    {
      "start": 354.08,
      "duration": 3.76,
      "text": "they don't provide a lot of investor relations \ncollateral. That's something we're going to talk"
    },
    {
      "start": 357.84,
      "duration": 5.2,
      "text": "about later. But the big news for Abbott recently \nis that they're acquiring Exact Sciences. And when"
    },
    {
      "start": 363.04,
      "duration": 4.4,
      "text": "you look at their four key business units, you \nsee Medical Devices dominating. This was from"
    },
    {
      "start": 367.44,
      "duration": 4.96,
      "text": "last quarter. The revenues from each segment. \nDiagnostics, that's going to go up significantly."
    },
    {
      "start": 372.4,
      "duration": 4.96,
      "text": "So revenues from Exact Sciences, that's the \ncompany they want to purchase, were around"
    },
    {
      "start": 377.36,
      "duration": 5.68,
      "text": "$850 million last quarter. So tack that on to \nthe Diagnostics segment. It's good to see that"
    },
    {
      "start": 383.04,
      "duration": 6.32,
      "text": "these are becoming more evenly balanced out. And \nas a result of acquiring Exact Sciences, Abbott's"
    },
    {
      "start": 389.36,
      "duration": 4.96,
      "text": "going to be taking on some debt. And before we \ntalk about that, I wanted to touch on debt and"
    },
    {
      "start": 394.32,
      "duration": 6.16,
      "text": "survivability. So bankruptcy, by definition, is \nan inability to pay back debts, right? And the"
    },
    {
      "start": 400.48,
      "duration": 6.32,
      "text": "majority of bankruptcies relate to this. Without \ndebt, typically bankruptcies wouldn't occur. And"
    },
    {
      "start": 406.8,
      "duration": 5.68,
      "text": "that's because companies can always take on more \ndebt to survive. As long as a company can keep"
    },
    {
      "start": 412.48,
      "duration": 4.96,
      "text": "raising capital, they can survive perpetually, \nright? But when they can't service their debt or"
    },
    {
      "start": 417.44,
      "duration": 5.68,
      "text": "nobody's willing to extend them more debt or buy \ntheir shares, then the company's toast. And we can"
    },
    {
      "start": 423.12,
      "duration": 5.92,
      "text": "look at real-world confirmation from major studies \nthat show just that. Debt is responsible for the"
    },
    {
      "start": 429.04,
      "duration": 5.28,
      "text": "vast majority of bankruptcies. So we want to pay \nvery close attention to debt for any company we"
    },
    {
      "start": 434.32,
      "duration": 6.72,
      "text": "want to consider safe. And you always want to \nfocus on net debt. So take the long-term debt on"
    },
    {
      "start": 441.04,
      "duration": 5.2,
      "text": "their balance sheet and subtract from that their \ncash. You get net debt. Abbott has net debt of"
    },
    {
      "start": 446.24,
      "duration": 6.88,
      "text": "$3.6 billion. That's not a whole lot for a $200 \nbillion company, intuitively. And when you go into"
    },
    {
      "start": 453.12,
      "duration": 6.0,
      "text": "that 2024 report, they break down their debt and \nlines of credit. You can look at this year versus"
    },
    {
      "start": 459.12,
      "duration": 4.8,
      "text": "the last year. You can see when they mature. So \nthis is important. That's when the money that they"
    },
    {
      "start": 463.92,
      "duration": 5.68,
      "text": "owe others comes due, right? And they have a nice \nspread of varying durations over time. These fixed"
    },
    {
      "start": 469.6,
      "duration": 6.64,
      "text": "interest rates look okay. And to fund this Exact \nSciences deal, they're going to take out a $20"
    },
    {
      "start": 476.24,
      "duration": 5.36,
      "text": "billion bridge loan. So, they're really going to \nincrease their debt. And they plan to eventually"
    },
    {
      "start": 481.6,
      "duration": 5.68,
      "text": "refinance that. I think the bridge loan comes due \nwithin a year, they'll need to raise more debt to"
    },
    {
      "start": 487.28,
      "duration": 6.0,
      "text": "replace that with bonds or other instruments. So, \nwe'll see how that goes. When it comes to rating a"
    },
    {
      "start": 493.28,
      "duration": 5.52,
      "text": "company's debt, especially large firms that are \ncovered by major credit ratings agencies, you"
    },
    {
      "start": 498.8,
      "duration": 4.72,
      "text": "want to pay attention to those reports. They're \nsuper valuable. You can often find them for free"
    },
    {
      "start": 503.52,
      "duration": 6.72,
      "text": "and they describe any potential problems a company \nmight run into. I've circled here on this spectrum"
    },
    {
      "start": 510.24,
      "duration": 6.16,
      "text": "of classifications where Abbott sits for S&P and \nMoody's. So, they're investment grade. They're"
    },
    {
      "start": 516.4,
      "duration": 4.24,
      "text": "just below the highest tier of investment-grade \ndebt. So, that would be a good thing to do,"
    },
    {
      "start": 520.64,
      "duration": 4.64,
      "text": "right? Look at the companies you're holding and \nsee how many are in the speculative grade area."
    },
    {
      "start": 525.28,
      "duration": 6.0,
      "text": "But that may change at least for S&P, which \nhas placed Abbott on credit watch, they say,"
    },
    {
      "start": 531.28,
      "duration": 5.36,
      "text": "with negative implications following their planned \nacquisition of Exact Sciences. So you want to"
    },
    {
      "start": 536.64,
      "duration": 5.2,
      "text": "pay attention to that. When we look at the deal \nstructure, they're going to raise $20 billion from"
    },
    {
      "start": 541.84,
      "duration": 5.2,
      "text": "that bridge loan. They're assuming $1.8 billion in \ndebt from Exact Sciences. So, what, they're going"
    },
    {
      "start": 547.04,
      "duration": 5.68,
      "text": "to increase their debt around $22 billion. The \ntransaction is expected to close the middle of"
    },
    {
      "start": 552.72,
      "duration": 5.44,
      "text": "next year. And the strategic rationale, well, they \nhave an investor deck they put out, surprisingly,"
    },
    {
      "start": 558.16,
      "duration": 5.12,
      "text": "that goes over that. It's quite good. Give it a \nglance if you're an Abbott shareholder. And they"
    },
    {
      "start": 563.28,
      "duration": 6.8,
      "text": "project this $50 million in annual synergies \nby year three. And when you look at the data,"
    },
    {
      "start": 570.08,
      "duration": 5.2,
      "text": "it shows that, I think, only a third of time \ncompanies realize synergies. So you're really"
    },
    {
      "start": 575.28,
      "duration": 6.32,
      "text": "looking for larger firms that have experience \nin acquiring other companies and they're able to"
    },
    {
      "start": 581.6,
      "duration": 5.84,
      "text": "create those synergies. Let's hope that's Abbott. \nAnd since this is a value stock, we hold this as"
    },
    {
      "start": 587.44,
      "duration": 5.28,
      "text": "part of our dividend growth investment strategy. \nWe're not so interested in the revenue side of"
    },
    {
      "start": 592.72,
      "duration": 5.12,
      "text": "things. We're more interested in earnings or, \nspecifically, cash flows. So you can see here"
    },
    {
      "start": 597.84,
      "duration": 6.64,
      "text": "along the top the net earnings from Abbott for \nthe past 3 years, but I've highlighted the cash"
    },
    {
      "start": 604.48,
      "duration": 5.44,
      "text": "from operating activities. So, as the old saying \ngoes: earnings are an opinion, cash is a fact."
    },
    {
      "start": 609.92,
      "duration": 5.44,
      "text": "And we want to make sure that they're generating a \nnice healthy chunk of cash they can use to service"
    },
    {
      "start": 615.36,
      "duration": 5.84,
      "text": "that debt. Now, when you look here at where the \ncash being thrown off from their business goes,"
    },
    {
      "start": 621.2,
      "duration": 4.48,
      "text": "you can see, well, they're making some investments \nwith that - acquisitions of property and"
    },
    {
      "start": 625.68,
      "duration": 5.12,
      "text": "equipment - but also under Financing activities, \nthey're purchasing back stock and also paying"
    },
    {
      "start": 630.8,
      "duration": 4.96,
      "text": "dividends. So, if you take dividends and express \nthem as a percentage of operating cash flows,"
    },
    {
      "start": 635.76,
      "duration": 4.4,
      "text": "which that's typically not how payout ratio is \ncalculated. They base it off earnings. But I"
    },
    {
      "start": 640.16,
      "duration": 5.2,
      "text": "always like to look at operating cash flows \nagainst dividends paid. Or more accurately,"
    },
    {
      "start": 645.36,
      "duration": 5.76,
      "text": "free cash flow which shows what they have after \ncapex. But here you can see their operating cash"
    },
    {
      "start": 651.12,
      "duration": 4.48,
      "text": "flows easily would cover that dividend. They \nalso have some leeway if they stopped buying"
    },
    {
      "start": 655.6,
      "duration": 6.0,
      "text": "back their shares. So it seems like the interest \non this debt they would be easily able to cover."
    },
    {
      "start": 661.6,
      "duration": 5.28,
      "text": "And since we've invested in Abbott as part of \nour dividend growth investing strategy, dividend"
    },
    {
      "start": 666.88,
      "duration": 5.52,
      "text": "growth is a critical component. It's one of the \nreasons why this is the highest-ranked stock in"
    },
    {
      "start": 672.4,
      "duration": 6.08,
      "text": "our Quantigence core universe. It's because across \nthe board they have great metrics, such as their"
    },
    {
      "start": 678.48,
      "duration": 6.32,
      "text": "low payout ratio, their 10-year growth rate which \napproaches 10%. So every year, essentially, you've"
    },
    {
      "start": 684.8,
      "duration": 5.76,
      "text": "been getting a 10% raise in that dividend income. \nThat's great. That adds up really fast over time."
    },
    {
      "start": 690.56,
      "duration": 6.32,
      "text": "And when we look at the entire Q-score here, \nwe've calculated that using a number of factors"
    },
    {
      "start": 696.88,
      "duration": 4.72,
      "text": "including size, the number of years they've \nincreased the dividend, international sales,"
    },
    {
      "start": 701.6,
      "duration": 4.72,
      "text": "5-year, 10-year dividend growth, and their yield, \nwhich is rather low. But again, just pay attention"
    },
    {
      "start": 706.32,
      "duration": 4.88,
      "text": "to the growth because that yield, what they call \nthe yield on cost, changes very quickly when you"
    },
    {
      "start": 711.2,
      "duration": 5.68,
      "text": "have a dividend growing at double digits. However, \nthe Q-scores that you see here don't change very"
    },
    {
      "start": 716.88,
      "duration": 4.64,
      "text": "often, which is one of the things that makes \nthis strategy quite unique. And we update these"
    },
    {
      "start": 721.52,
      "duration": 5.6,
      "text": "actually twice a year and provide commentary on \nthe changes. Very informative. So, now that Abbott"
    },
    {
      "start": 727.12,
      "duration": 5.28,
      "text": "is acquiring Exact Sciences, we're rather excited \nabout that because that happens to be a disruptive"
    },
    {
      "start": 732.4,
      "duration": 6.16,
      "text": "tech stock we like. We've covered it extensively \nover the years. And we're quite stoked now that,"
    },
    {
      "start": 738.56,
      "duration": 4.8,
      "text": "potentially, they'll be acquired by Abbott and \nwe can actually hold that stock as part of our"
    },
    {
      "start": 743.36,
      "duration": 6.48,
      "text": "Abbott holding. And when you look at this slide \nfrom Abbott, it talks about this delicate balance"
    },
    {
      "start": 749.84,
      "duration": 6.24,
      "text": "they have between returning cash to shareholders \nwhilst investing appropriately so that they"
    },
    {
      "start": 756.08,
      "duration": 5.2,
      "text": "can keep growing their business, whether that's \ntop-line revenues or the bottom-line earnings per"
    },
    {
      "start": 761.28,
      "duration": 6.16,
      "text": "share. And they seem to be doing that balancing \nact quite well. You can dig further. I think they"
    },
    {
      "start": 767.44,
      "duration": 5.36,
      "text": "had an investor relations deck earlier this year \nthat talks a little bit more about that. But that"
    },
    {
      "start": 772.8,
      "duration": 4.64,
      "text": "leads me to the biggest point of contention that \nI have with this firm. They don't have - unless"
    },
    {
      "start": 777.44,
      "duration": 5.28,
      "text": "I couldn't find them, they should be very easy \nto find - investor decks that accompany earnings"
    },
    {
      "start": 782.72,
      "duration": 4.96,
      "text": "calls so that you can quickly scan through. And \nof course, we only check in with companies once"
    },
    {
      "start": 787.68,
      "duration": 5.68,
      "text": "a year. We find that cadence allows you to sort of \nremove the noise and really be able to understand"
    },
    {
      "start": 793.36,
      "duration": 4.56,
      "text": "how a company's progressing. But they also \ndon't have any high-level investment deck,"
    },
    {
      "start": 797.92,
      "duration": 5.6,
      "text": "aside from that one I mentioned back in January \nof last year, which certainly isn't updated as"
    },
    {
      "start": 803.52,
      "duration": 5.6,
      "text": "it needs to be. But, since we've invested in this \ncompany as part of that dividend growth strategy,"
    },
    {
      "start": 809.12,
      "duration": 4.4,
      "text": "we sort of set it and forget it. We don't \ncheck in very often with our dividend growth"
    },
    {
      "start": 813.52,
      "duration": 5.76,
      "text": "holdings because they sort of just sit there and \nappreciate in value and our income every year"
    },
    {
      "start": 819.28,
      "duration": 4.32,
      "text": "goes up and we're certainly happy with that. You \nget the income growth component and the capital"
    },
    {
      "start": 823.6,
      "duration": 5.12,
      "text": "appreciation which you don't even touch. And if \nyou snowball that dividend growth, then it really"
    },
    {
      "start": 828.72,
      "duration": 5.2,
      "text": "starts to get impactful and that's what we looked \nat in our research paper on the performance from"
    },
    {
      "start": 833.92,
      "duration": 4.4,
      "text": "this strategy. And we did a piece on that, which \ntalked about how it absolutely spanked the S&P"
    },
    {
      "start": 838.32,
      "duration": 6.0,
      "text": "500. So, we're glad now to be holding this stock \nand I think the next time that we would check"
    },
    {
      "start": 844.32,
      "duration": 5.76,
      "text": "in with them would be once that Exact Sciences \nacquisition goes through and give that some time"
    },
    {
      "start": 850.08,
      "duration": 6.16,
      "text": "for dust to settle. In the meantime, if you're \ninterested in investing on the disruptive growth"
    },
    {
      "start": 856.24,
      "duration": 4.88,
      "text": "side, there's an AI healthcare stock that we \ninvested in this year that I think is rather"
    },
    {
      "start": 861.12,
      "duration": 5.68,
      "text": "interesting. Give that video a watch next. Thanks \nso much for taking the time to watch this today."
    }
  ]
}