{
  "video_id": "qri6xIVdLHw",
  "title": "Prepare Your Portfolio For MASSIVE Deflation",
  "channel": "Nanalyze",
  "published_at": "2025-11-24T16:01:33Z",
  "duration": "PT15M16S",
  "thumbnail": "https://i.ytimg.com/vi/qri6xIVdLHw/hqdefault.jpg",
  "fetched_at": "2026-01-16T18:53:22.609319",
  "transcript": [
    {
      "start": 0.16,
      "duration": 5.04,
      "text": "Tech investor Marc Andreessen, says that \nartificial intelligence is about to make"
    },
    {
      "start": 5.2,
      "duration": 7.04,
      "text": "everything so cheap that it's going to break \nthe economy. Amazon now runs over $520,000"
    },
    {
      "start": 12.24,
      "duration": 7.68,
      "text": "AI-powered robots in its fulfillment centers. \nWalmart saves roughly $1.5 billion a year with"
    },
    {
      "start": 19.92,
      "duration": 7.92,
      "text": "AI-driven inventory management. And Maersk \nhas cut vessel idle time by 30% using AI. Now,"
    },
    {
      "start": 27.84,
      "duration": 4.8,
      "text": "these all sound like good things, but experts have \nbeen warning that this is going to lead to massive"
    },
    {
      "start": 32.64,
      "duration": 6.8,
      "text": "deflation. What if that happens? How would your \nportfolio be impacted? Is deflation good or bad?"
    },
    {
      "start": 39.44,
      "duration": 5.12,
      "text": "I'm going to answer all those questions today \nusing simple terms. So, let's get started. Now,"
    },
    {
      "start": 44.56,
      "duration": 6.88,
      "text": "the prices of things go up over time consistently. \nIt's called inflation. And the generally accepted"
    },
    {
      "start": 51.44,
      "duration": 8.16,
      "text": "average for inflation is 3% a year. So the stock \nmarket returns about 9% per year and inflation at"
    },
    {
      "start": 59.6,
      "duration": 6.56,
      "text": "3% nullifies some of those gains. So that means \nthat the real returns for the stock market are"
    },
    {
      "start": 66.16,
      "duration": 7.04,
      "text": "about 6% per year, adjusted for inflation. When \nthe rate of inflation goes up, the price of goods"
    },
    {
      "start": 73.2,
      "duration": 5.6,
      "text": "goes up. That becomes more noticeable. People \nstart to complain. And everyone in the USA right"
    },
    {
      "start": 78.8,
      "duration": 4.88,
      "text": "now is complaining about the prices of goods \ngoing up. So are they actually going up? Well,"
    },
    {
      "start": 83.68,
      "duration": 6.96,
      "text": "we use a metric called the Consumer Price Index \nto measure this over time. It's a widely accepted"
    },
    {
      "start": 90.64,
      "duration": 7.04,
      "text": "metric that economists use to gauge the rate of \ninflation. And as you can see here, it's about 3%."
    },
    {
      "start": 97.68,
      "duration": 5.68,
      "text": "And there's a number of categories here. You see \nFood and Energy, and these all other items bucket,"
    },
    {
      "start": 103.36,
      "duration": 4.88,
      "text": "which is quite a lot more elaborate than I \nthought. And you can Google this and go look"
    },
    {
      "start": 108.24,
      "duration": 5.92,
      "text": "at the data yourself. But you can see here they \nprovide a table that shows the rate of inflation"
    },
    {
      "start": 114.16,
      "duration": 6.88,
      "text": "for every single subcategory. And there's actually \na geographic structure and an item structure. Here"
    },
    {
      "start": 121.04,
      "duration": 5.68,
      "text": "you can see there are eight major groups and some \nexamples of the categories that can be found in"
    },
    {
      "start": 126.72,
      "duration": 5.28,
      "text": "each group. So there's a lot of stuff being \nmeasured here. And when we look at that rate"
    },
    {
      "start": 132.0,
      "duration": 8.32,
      "text": "of inflation over time, you can see from May 2008 \ntill July 2008 that inflation was increasing. So"
    },
    {
      "start": 140.32,
      "duration": 6.48,
      "text": "it peaked there at about 5% and then it started \nfalling. So the rate of inflation was falling"
    },
    {
      "start": 146.8,
      "duration": 6.88,
      "text": "year-over-year. That's called disinflation. So \nthe rate at which inflation increases slows."
    },
    {
      "start": 153.68,
      "duration": 6.16,
      "text": "And then you can see when the rate of inflation \nactually goes negative. That means that prices are"
    },
    {
      "start": 159.84,
      "duration": 6.72,
      "text": "cheaper than they were a year ago. That's called \ndeflation. And it's actually not a good thing. But"
    },
    {
      "start": 166.56,
      "duration": 5.6,
      "text": "the good thing about deflation is that it doesn't \nlast very long. And here we've zoomed out. This is"
    },
    {
      "start": 172.16,
      "duration": 8.48,
      "text": "a great chart. Simple. Shows the rate of inflation \nfrom 2005 until 2025. And the gray on the chart"
    },
    {
      "start": 180.64,
      "duration": 6.24,
      "text": "shows the recession between 2007 to 2009, which \nwas very dramatic. That's when I started my career"
    },
    {
      "start": 186.88,
      "duration": 5.36,
      "text": "on Wall Street. Everything was all scary and you \ncan see that short period of deflation. And then"
    },
    {
      "start": 192.24,
      "duration": 5.76,
      "text": "when you look more to the right, you see that \nother gray line that represents the brief COVID"
    },
    {
      "start": 198.0,
      "duration": 4.64,
      "text": "19 recession. I don't think you could really call \nthat even a recession, but they do. And then you"
    },
    {
      "start": 202.64,
      "duration": 6.8,
      "text": "can see now that inflation has settled around 3%, \nit's sort of around the average. Now when we look"
    },
    {
      "start": 209.44,
      "duration": 6.16,
      "text": "at historical precedents for deflation, the most \ndramatic deflationary period in US history was"
    },
    {
      "start": 215.6,
      "duration": 7.6,
      "text": "actually the Great Depression. It was between 1930 \nand 1933. The second most dramatic deflationary"
    },
    {
      "start": 223.2,
      "duration": 8.88,
      "text": "period was the 2007 and 2009 period referred \nto by economists as the Great Recession. And"
    },
    {
      "start": 232.08,
      "duration": 6.32,
      "text": "during both of these events, unemployment spiked \ndramatically. Okay. Now, was it the unemployment"
    },
    {
      "start": 238.4,
      "duration": 4.64,
      "text": "that created the deflation? In other words, fewer \npeople are buying goods, the demand dropped,"
    },
    {
      "start": 243.04,
      "duration": 6.64,
      "text": "so prices drop. Or was it that deflation, the \nprices dropping, resulted in unemployment? Well,"
    },
    {
      "start": 249.68,
      "duration": 5.92,
      "text": "it's largely believed that recessions caused both \ndeflation and unemployment. However, this time"
    },
    {
      "start": 255.6,
      "duration": 6.16,
      "text": "they're expecting deflation to be caused by the \nmost disruptive technology of our time, artificial"
    },
    {
      "start": 261.76,
      "duration": 5.44,
      "text": "intelligence. It's largely believed that the \ndramatic AI efficiencies that we're seeing,"
    },
    {
      "start": 267.2,
      "duration": 4.4,
      "text": "such as the examples given at the beginning of \nthis presentation, are going to cause the price of"
    },
    {
      "start": 271.6,
      "duration": 5.52,
      "text": "things to drop dramatically. Now, you could argue \nhere that the big bad corporations are going to"
    },
    {
      "start": 277.12,
      "duration": 5.84,
      "text": "be taking these excess profits and that the price \ncuts will never be passed on to the consumers, but"
    },
    {
      "start": 282.96,
      "duration": 5.44,
      "text": "that's really oversimplifying things. But let's \ngo ahead and assume that corporations are going"
    },
    {
      "start": 288.4,
      "duration": 6.08,
      "text": "to become enormously profitable from the use of \nAI for automation. How can we measure that? Well,"
    },
    {
      "start": 294.48,
      "duration": 4.8,
      "text": "there's a metric called Corporate Profits as a \npercentage of GDP and it's already at historical"
    },
    {
      "start": 299.28,
      "duration": 5.28,
      "text": "highs. So, companies, as you can see in this \nchart, are already highly profitable. Now, this is"
    },
    {
      "start": 304.56,
      "duration": 8.64,
      "text": "from 1940 to 2024, but the most recent measurement \nis around 11%. So, it roughly lines up with what"
    },
    {
      "start": 313.2,
      "duration": 6.08,
      "text": "this chart shows you. And again, the gray bars are \nshowing us recessions. And what this would tell us"
    },
    {
      "start": 319.28,
      "duration": 7.04,
      "text": "is that the rich forward price to earnings ratios \nthat you see out there, let's say on average"
    },
    {
      "start": 326.32,
      "duration": 6.0,
      "text": "they're rich, right? Those can be justified based \non the expectations of all the efficiencies that"
    },
    {
      "start": 332.32,
      "duration": 6.32,
      "text": "are going to be created. But there's some big \nconcerns around that because, turns out, AI isn't"
    },
    {
      "start": 338.64,
      "duration": 6.32,
      "text": "coming for the 3Ds, the dirty, dull, and dangerous \njobs. It's coming for white collar jobs. So the"
    },
    {
      "start": 344.96,
      "duration": 5.28,
      "text": "impact is going to be far more pronounced since \nthese folks have much higher purchasing power"
    },
    {
      "start": 350.24,
      "duration": 6.16,
      "text": "right now. High unemployment leads to deflation \nbecause it causes a decrease in overall spending"
    },
    {
      "start": 356.4,
      "duration": 5.84,
      "text": "which puts a downward pressure on prices. This can \ncreate what they call a deflationary cycle where"
    },
    {
      "start": 362.24,
      "duration": 6.4,
      "text": "lower demand leads to lower prices which causes \nbusinesses to cut wages or layoff workers. Make a"
    },
    {
      "start": 368.64,
      "duration": 3.92,
      "text": "note of the layoffs. We're going to talk about \nthat in a second. And the cycle keeps getting"
    },
    {
      "start": 372.56,
      "duration": 7.28,
      "text": "worse and worse. Now, indeed, some of this appears \nto be happening. And this recent article by CNBC"
    },
    {
      "start": 379.84,
      "duration": 6.16,
      "text": "raised some eyebrows. So, job cuts in October hit \ntheir highest level for the month in 22 years."
    },
    {
      "start": 386.0,
      "duration": 4.88,
      "text": "There's this firm called Challenger. They monitor \nthis stuff over time. It's all rather interesting."
    },
    {
      "start": 390.88,
      "duration": 3.68,
      "text": "You ought to pop open the report and take a look \nat it. Or actually, I'll do that for you. Show"
    },
    {
      "start": 394.56,
      "duration": 5.52,
      "text": "you some of the more interesting parts. So they \nsaid that this is now the worst year for layoffs"
    },
    {
      "start": 400.08,
      "duration": 6.32,
      "text": "since 2009, right? The great recession. And they \nsay this is because a disruptive technology is"
    },
    {
      "start": 406.4,
      "duration": 5.68,
      "text": "changing the landscape. So you can see this table \nhere. The first four columns show each quarter for"
    },
    {
      "start": 412.08,
      "duration": 5.92,
      "text": "the given years. And the last column there simply \nsums them. And through October of this year,"
    },
    {
      "start": 418.0,
      "duration": 6.4,
      "text": "employers have announced over a million job cuts. \nThis is an increase of 65% from the first 10"
    },
    {
      "start": 424.4,
      "duration": 7.12,
      "text": "months of last year. And when you look at 2007 and \n2008, you see these large job cuts that happened."
    },
    {
      "start": 431.52,
      "duration": 5.28,
      "text": "And then of course in 2020, the pandemic, right, \nbrought out a bunch of job cuts during that"
    },
    {
      "start": 436.8,
      "duration": 5.76,
      "text": "short-lived recession. And now we're on track to \nexceed a million, perhaps hit the numbers that we"
    },
    {
      "start": 442.56,
      "duration": 6.8,
      "text": "were at in 2008 and 2009. Now, you can contrast \nthese numbers to the total unemployed people,"
    },
    {
      "start": 449.36,
      "duration": 6.88,
      "text": "which as of August 2025 in the United States was \naround 7.38 million. So you're simply adding to"
    },
    {
      "start": 456.24,
      "duration": 4.72,
      "text": "that number and there are of course folks \nthat will get rehired but that might start"
    },
    {
      "start": 460.96,
      "duration": 5.68,
      "text": "to become difficult because there aren't going \nto be that many open jobs with AI creating so"
    },
    {
      "start": 466.64,
      "duration": 4.96,
      "text": "many efficiencies. Now one thing to note about \nthese numbers is when you dig into them you see"
    },
    {
      "start": 471.6,
      "duration": 6.8,
      "text": "that there's actually a root cause here that is \nonly recently arrived and that is DOGE. So if"
    },
    {
      "start": 478.4,
      "duration": 4.32,
      "text": "you look at the layoff location you see District \nof Columbia. Look at how dramatic that is. So,"
    },
    {
      "start": 482.72,
      "duration": 7.12,
      "text": "you had what 35,000 job cuts year-to-date in 2024 \nand over 300,000 year-to-date this year. And the"
    },
    {
      "start": 489.84,
      "duration": 5.04,
      "text": "other thing that backs this up is when you look \nat the leading reason for job cut announcements"
    },
    {
      "start": 494.88,
      "duration": 7.52,
      "text": "in 2025, it's DOGE Impact. And look at this. Very \ncool. They provide a breakdown of the job cuts by"
    },
    {
      "start": 502.4,
      "duration": 6.72,
      "text": "reason. So, Doge is sort of a one-off, right? \nThat's the US government's attempt to create"
    },
    {
      "start": 509.12,
      "duration": 5.2,
      "text": "efficiencies in the government. Then of course \nthe second leading cause here, market economic"
    },
    {
      "start": 514.32,
      "duration": 4.8,
      "text": "conditions, the old macroeconomic headwinds \nblowing stuff right and then look further down"
    },
    {
      "start": 519.12,
      "duration": 5.68,
      "text": "the list, you have artificial intelligence. Now \nif you're going out and aggregating all this data,"
    },
    {
      "start": 524.8,
      "duration": 6.24,
      "text": "companies aren't going to be coming right out \nand saying well AI created all these efficiencies"
    },
    {
      "start": 531.04,
      "duration": 6.8,
      "text": "necessarily because there's going to start to be \npublic backlash around that. So whilst they want"
    },
    {
      "start": 537.84,
      "duration": 4.24,
      "text": "to let investors know, hey, we're using AI and \ncreating all these efficiencies, they have to"
    },
    {
      "start": 542.08,
      "duration": 4.0,
      "text": "be very careful there because then when they talk \nabout job cuts relating to AI, and people aren't"
    },
    {
      "start": 546.08,
      "duration": 5.36,
      "text": "going to find that so palatable. And interestingly \nenough, there's a new bipartisan bill that would"
    },
    {
      "start": 551.44,
      "duration": 5.52,
      "text": "require companies to report AI job losses. I \nonly wonder how effective that's going to be when"
    },
    {
      "start": 556.96,
      "duration": 5.12,
      "text": "you think about how corporate America operates. \nThere's a lot of ways that you can spin job cuts"
    },
    {
      "start": 562.08,
      "duration": 4.64,
      "text": "without having to put them into this bucket. I \ndon't know what you would do with this information"
    },
    {
      "start": 566.72,
      "duration": 5.6,
      "text": "necessarily. Perhaps it would just reinforce the \nfact that AI is taking a whole bunch of jobs. Now,"
    },
    {
      "start": 572.32,
      "duration": 6.96,
      "text": "we've talked about this before and perhaps one of \nthe biggest concerns that we have around AI is the"
    },
    {
      "start": 579.28,
      "duration": 6.4,
      "text": "impact of very high levels of unemployment coming \noff the back of all these efficiencies being"
    },
    {
      "start": 585.68,
      "duration": 5.36,
      "text": "created. You can only retool people so much. And I \nthink that you'll probably see the effects of this"
    },
    {
      "start": 591.04,
      "duration": 4.96,
      "text": "start to manifest themselves in overseas locations \nwhere people are less likely to complain. Think"
    },
    {
      "start": 596.0,
      "duration": 4.96,
      "text": "Manila and Mumbai, right? Large offshoring \ncenters will be hit quite hard. Maybe it would"
    },
    {
      "start": 600.96,
      "duration": 4.08,
      "text": "be interesting to look at unemployment numbers \nover there. But for right now, we're interested"
    },
    {
      "start": 605.04,
      "duration": 4.8,
      "text": "in what's happening in our own backyard. And here \nyou can see that recessions, as I said before,"
    },
    {
      "start": 609.84,
      "duration": 5.6,
      "text": "always create unemployment. And this unemployment \nmanifests itself with very dramatic spikes. And"
    },
    {
      "start": 615.44,
      "duration": 6.24,
      "text": "when we look at an unemployment in this five-year \nrange, we see it slowly increasing and one wonders"
    },
    {
      "start": 621.68,
      "duration": 5.68,
      "text": "if that's going to start increasing at a higher \nrate because it's going to be more difficult"
    },
    {
      "start": 627.36,
      "duration": 6.24,
      "text": "finding a job once you're laid off. So just some \nthoughts here. They say that you should study"
    },
    {
      "start": 633.6,
      "duration": 5.28,
      "text": "economics because when when you inevitably end up \nin the employment line, at least you'll understand"
    },
    {
      "start": 638.88,
      "duration": 4.96,
      "text": "why you're there. Economics is one of the few \nprofessions where you can talk about money without"
    },
    {
      "start": 643.84,
      "duration": 6.48,
      "text": "ever having to make any money. They say it's the \nonly field where two economists can win the Nobel"
    },
    {
      "start": 650.32,
      "duration": 5.92,
      "text": "Prize for saying exactly the opposite thing. \nEconomists also create a lot of noise. I think"
    },
    {
      "start": 656.24,
      "duration": 5.04,
      "text": "for retail investors, the minimum information \nyou ought to know is inflation. You ought to"
    },
    {
      "start": 661.28,
      "duration": 4.72,
      "text": "understand how that works because it's very \nimportant when it comes to planning. the simple"
    },
    {
      "start": 666.0,
      "duration": 4.88,
      "text": "rule that your purchasing power halves every 30 \nyears. That's pretty important. So if you're on a"
    },
    {
      "start": 670.88,
      "duration": 6.72,
      "text": "fixed income and you're 65 years old, by the time \nyou get to 95 years old, your quality of life is"
    },
    {
      "start": 677.6,
      "duration": 3.92,
      "text": "halve that's not very good, right? That's not the \ngolden years that you were promised. So I think"
    },
    {
      "start": 681.52,
      "duration": 5.76,
      "text": "that having a basic understanding of economic \nindicators lets you understand financial news,"
    },
    {
      "start": 687.28,
      "duration": 5.68,
      "text": "hold better conversations. I certainly admire \neconomists for their ability to analyze"
    },
    {
      "start": 692.96,
      "duration": 4.0,
      "text": "the market in a manner that's actually quite \nsophisticated. There are a lot of moving parts,"
    },
    {
      "start": 696.96,
      "duration": 5.12,
      "text": "a lot of variables becomes very difficult to \nnavigate in a hurry. So we summarize so far."
    },
    {
      "start": 702.08,
      "duration": 5.36,
      "text": "Inflation is probably one of the most important \nmetrics for retail investors to understand, as"
    },
    {
      "start": 707.44,
      "duration": 6.4,
      "text": "is disinflation, right? And deflation. Right now \nthe rate of inflation seems to be about average."
    },
    {
      "start": 713.84,
      "duration": 6.0,
      "text": "it's sort of flatlined. And that means that goods \nare constantly getting more expensive over time,"
    },
    {
      "start": 719.84,
      "duration": 5.92,
      "text": "just at a slower pace. Let's say an average pace. \nHowever, when goods become cheaper over time,"
    },
    {
      "start": 725.76,
      "duration": 5.44,
      "text": "these short-lived events have largely surrounded \neconomic turmoil. You have to be very careful you"
    },
    {
      "start": 731.2,
      "duration": 6.16,
      "text": "don't fall into the deflationary cycle we talked \nabout. So obviously the question is how does this"
    },
    {
      "start": 737.36,
      "duration": 6.0,
      "text": "impact your portfolio? And the question you might \nask there is, well, what assets act as a hedge"
    },
    {
      "start": 743.36,
      "duration": 4.8,
      "text": "during deflationary periods? We already know that \nthe stock market's going to be performing horribly"
    },
    {
      "start": 748.16,
      "duration": 5.92,
      "text": "during periods of high unemployment and deflation, \nright? What assets don't perform horribly? Well,"
    },
    {
      "start": 754.08,
      "duration": 5.68,
      "text": "obviously cash is the simplest hedge against \ndeflation because cash is really strengthening"
    },
    {
      "start": 759.76,
      "duration": 3.84,
      "text": "in terms of the amount of goods that you \ncan buy with it, right? And of course,"
    },
    {
      "start": 763.6,
      "duration": 8.08,
      "text": "investment bonds. So bond prices rise as interest \nrates fall and they're falling right now, right?"
    },
    {
      "start": 771.68,
      "duration": 7.2,
      "text": "Central banks are often prone to cut rates to \ncombat deflation, so high quality fixed rate bonds"
    },
    {
      "start": 778.88,
      "duration": 3.84,
      "text": "would be a good hedge. There's a lot of reasons \nto own bonds. You know, people always joke,"
    },
    {
      "start": 782.72,
      "duration": 4.64,
      "text": "well, this is return-free risk. Yeah. Well, \nit's part of a well diversified portfolio,"
    },
    {
      "start": 787.36,
      "duration": 5.28,
      "text": "and this becomes more important as you age. And \neven for younger people, this is going to help"
    },
    {
      "start": 792.64,
      "duration": 5.84,
      "text": "reduce the extent to which you see your assets \ndraw down during recessionary periods, which can"
    },
    {
      "start": 798.48,
      "duration": 6.16,
      "text": "be very difficult for some to manage. As you know, \npeople feel the pain of losses twice as much as"
    },
    {
      "start": 804.64,
      "duration": 6.16,
      "text": "they feel the enjoyment of gains. And I think that \nin a market where most of the younger investors"
    },
    {
      "start": 810.8,
      "duration": 5.92,
      "text": "today have never felt pain, that that perhaps the \npain is three times as much. And then here they"
    },
    {
      "start": 816.72,
      "duration": 6.48,
      "text": "talk about defensive stocks with strong dividend \nhistories. That leans right into our Quantigence"
    },
    {
      "start": 823.2,
      "duration": 6.4,
      "text": "strategy which focuses solely on companies with \nstrong dividend histories. They say here cash-rich"
    },
    {
      "start": 829.6,
      "duration": 5.6,
      "text": "companies with low debt thrive. That's because \nif you're holding debt in a deflationary period,"
    },
    {
      "start": 835.2,
      "duration": 4.96,
      "text": "that's not a good thing. And then when it comes \nto gold, right, through traditional safe haven,"
    },
    {
      "start": 840.16,
      "duration": 5.28,
      "text": "results vary. Now, inevitably, somebody will \nbring up, you know, digital gold, Bitcoin, which"
    },
    {
      "start": 845.44,
      "duration": 5.52,
      "text": "doesn't have a history that's long enough for us \nto do proper correlation analysis, but certainly"
    },
    {
      "start": 850.96,
      "duration": 7.28,
      "text": "that's an alternative asset class, and those can \nbe useful to hold as well in small quantities. So,"
    },
    {
      "start": 858.24,
      "duration": 4.96,
      "text": "what to do? Well, you probably watched this \nvideo because you're concerned about something"
    },
    {
      "start": 863.2,
      "duration": 6.08,
      "text": "bad happening. Now, from our perspective, we're \npretty entrenched in those assets I just talked"
    },
    {
      "start": 869.28,
      "duration": 5.6,
      "text": "about. So, we're not very worried about any sort \nof deflation or recession that's coming up. We"
    },
    {
      "start": 874.88,
      "duration": 5.36,
      "text": "sleep very well at night. Now, what happens when \npeople get worried, and I see this all the time,"
    },
    {
      "start": 880.24,
      "duration": 4.88,
      "text": "is they get tempted to modify their investment \nstrategies in response to market events. I can't"
    },
    {
      "start": 885.12,
      "duration": 6.32,
      "text": "tell you how many people talked about going to \ncash during Trump's tariff drama. Don't react"
    },
    {
      "start": 891.44,
      "duration": 6.08,
      "text": "to market events. Have a strategy that you apply \nregardless of what the market is doing. Probably"
    },
    {
      "start": 897.52,
      "duration": 5.92,
      "text": "the most important thing to be watching here is \nwhether AI is going to threaten your income, your"
    },
    {
      "start": 903.44,
      "duration": 6.08,
      "text": "job. Now, we covered that in this next video which \ntalks about which jobs will likely be replaced"
    },
    {
      "start": 909.52,
      "duration": 5.12,
      "text": "by AI. You should give that a watch next. Thanks \nso much for taking the time to watch this today."
    }
  ]
}